[
    {
        "id": "895227",
        "title": "/spl epsi/-stabilization of multiple chained form control systems with input constraints and its application in mobile robots",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper is concerned with the stabilization problem of multiple chained form control systems with input constraints. A new controller presented can stabilize the system to an arbitrarily, small /spl epsi/-neighborhood of its equilibrium in a finite time. This is achieved by the sliding mode approach and a multi-step control strategy. The application of it to a nonholonomic wheeled mobile robot is described. Simulation result shouts that the proposed controller is effective.",
        "primary_area": "",
        "author": "Chaoli Wang;Weihuo;Dalong Tan;Yuechao Wang;Chaoli Wang;Weihuo;Dalong Tan;Yuechao Wang",
        "authorids": "/37087220021;/38016150300;/37087219180;/37086976968;/37087220021;/38016150300;/37087219180;/37086976968",
        "aff": "Robotics Laboratory, Shenyang Institute of Automation, Chinese Academy of Sciences, China; The Seventh Research Division, Beijing Aeronautics and Astronautics University, Astro, China; Robotics Laboratory, Shenyang Institute of Automation, Chinese Academy of Sciences, China; Robotics Laboratory, Shenyang Institute of Automation, Chinese Academy of Sciences, China",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895227/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10975999400800137464&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;1;0;0",
        "aff_unique_norm": "Shenyang Institute of Automation, Chinese Academy of Sciences;Beijing Aeronautics and Astronautics University",
        "aff_unique_dep": "Robotics Laboratory;The Seventh Research Division",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "China"
    },
    {
        "id": "895295",
        "title": "A basis for self-reconfiguring robots using crystal modules",
        "track": "main",
        "status": "Poster",
        "abstract": "We discuss a basis for creating self-reconfiguring robots and instantiate it for crystal modules. Crystalline robots consist of modules that can aggregate together to form distributed robot systems. Crystalline modules are actuated by expanding and contracting each unit. This actuation mechanism permits automated shape metamorphosis. We describe the crystalline module concept and its physical implementation. We prove that crystalline robots are general self-reconfiguring robots.",
        "primary_area": "",
        "author": "D. Rus;M. Vona;D. Rus;M. Vona",
        "authorids": "/37279652300;/37270524900;/37279652300;/37270524900",
        "aff": "Department of Computer Science, Dartmouth College, Hanover, NH, USA; Department of Computer Science, Dartmouth College, Hanover, NH, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895295/",
        "gs_citation": 75,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6115504876822981646&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Dartmouth College",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.dartmouth.edu",
        "aff_unique_abbr": "Dartmouth",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Hanover",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895269",
        "title": "A constrain-move based distributed cooperation strategy for four object lifting robots",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper extends the constrain-move strategy for four robots lifting an object in a distributed manner. Ahmadabadi et al. (1996, 1998) have successfully applied constrain-move to three robots, but due to existence of redundancy in vertical forces in a team of four robots, this protocol is not applicable to such systems in its original form. In the presented cooperation strategy, the robots support the load on its bottom face and there is no lateral artificial constraint on the object. The distributed coordination protocol is designed in such a way that with minimum volume of communication and implementing their own local sensors, the robots can lift the object while its Euler angles and robot-object contact are controlled. Stability condition for the system is attained mathematically. Simulation results are given to support the applicability of the presented system.",
        "primary_area": "",
        "author": "M.N. Ahmadabadi;S.M. Rushan;ZhiDong Wang;E. Nakano;M.N. Ahmadabadi;S.M. Rushan;ZhiDong Wang;E. Nakano",
        "authorids": "/37293861300;/37830322100;/37087158163;/37385914400;/37293861300;/37830322100;/37087158163;/37385914400",
        "aff": "Robotics Laboratory, Department of Electrical and Computer Engineering, Faculty of Eng, University of Tehran, Tehran, Iran; Robotics Laboratory, Department of Electrical and Computer Engineering, Faculty of Engineering, University of Tehran, Tehran, Iran; Advanced Robotics Laboratory, The Graduate School of Info. Sciences, University of Tohoku, Sendai, Japan; Advanced Robotics Laboratory, The Graduate School of Info. Sciences, University of Tohoku, Sendai, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895269/",
        "gs_citation": 20,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15788859210264758142&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;1",
        "aff_unique_norm": "University of Tehran;University of Tohoku",
        "aff_unique_dep": "Department of Electrical and Computer Engineering;The Graduate School of Information Sciences",
        "aff_unique_url": "https://www.ut.ac.ir;https://www.tohoku.ac.jp",
        "aff_unique_abbr": "UT;Tohoku U",
        "aff_campus_unique_index": "0;0;1;1",
        "aff_campus_unique": "Tehran;Sendai",
        "aff_country_unique_index": "0;0;1;1",
        "aff_country_unique": "Iran;Japan"
    },
    {
        "id": "895282",
        "title": "A fast collision check algorithm EDGE for moving 3D objects",
        "track": "main",
        "status": "Poster",
        "abstract": "We propose an octree-based collision check algorithm EDGE for multiple manipulators with many degrees-of-freedom. The manipulator consists of many links, and therefore it should plan a collision-free sequence of motions by a collision check between two moving 3D links. In previous octree-based algorithms, we drop each patch of an object on an octree of another object to investigate their collision. In our proposed algorithm, we drop each edge of an object on an octree of another object to find the collision. With our algorithm, tracing the edge is much faster than covering the patch on the octree. For this purpose, we first develop an efficient algorithm for finding neighbor nodes (cubes) along an edge in an octree. Next, we build a collision check algorithm with the support of the neighbor finding algorithm.",
        "primary_area": "",
        "author": "N. Kimura;N. Mori;H. Noborio;N. Kimura;N. Mori;H. Noborio",
        "authorids": "/37087617989;/37087616672;/37273218900;/37087617989;/37087616672;/37273218900",
        "aff": "Department of Engineering Informatics, Osaka Electro Communication University, Neyagawa, Osaka, Japan; Department of Engineering Informatics, Osaka Electro Communication University, Neyagawa, Osaka, Japan; Department of Engineering Informatics, Osaka Electro Communication University, Neyagawa, Osaka, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895282/",
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17370078934289876014&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Osaka Electro Communication University",
        "aff_unique_dep": "Department of Engineering Informatics",
        "aff_unique_url": "https://www.oecu.ac.jp",
        "aff_unique_abbr": "OECU",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Neyagawa",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895224",
        "title": "A framework for integrating sensory information in a humanoid robot",
        "track": "main",
        "status": "Poster",
        "abstract": "We propose a framework towards the integration of information sensors based on the idea that the stimulus perceived through different sensors are spatial-time correlated for a short time period. Applications in robotics need to be able to process information from multiple sensors, for instance, in the case of a visible talking person. How can we relate this kind of information in a simple way, without making use of high level representation? This is the question that we want to address. A new framework based on a correlation measure of low level data information is proposed. This low level correlation measure can be used as an integration data engine to support high level task description. In the paper a coherent approach from sensor level to task level for developing a robot which can handle a large number of sensors and actuators is developed. An example how this approach can be used for a visual-sound integration task is also presented.",
        "primary_area": "",
        "author": "I. Fermin;H. Okuno;H. Ishiguro;H. Kitano;I. Fermin;H. Okuno;H. Ishiguro;H. Kitano",
        "authorids": "/37322975900;/37273831200;/37274136400;/37271762500;/37322975900;/37273831200;/37274136400;/37271762500",
        "aff": "ERATO Kitano Symbiotic Systems Project, Japan Science and Technology Corporation, Shibuya, Tokyo, Japan; Department of Social Information, Kyoto University, Kyoto, Japan; ERATO Kitano Symbiotic Systems Project, Japan Science and Technology Corporation, Shibuya, Tokyo, Japan; ERATO Kitano Symbiotic Systems Project, Japan Science and Technology Corporation, Shibuya, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895224/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10146714896434784925&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;1;0;0",
        "aff_unique_norm": "Japan Science and Technology Corporation;Kyoto University",
        "aff_unique_dep": "ERATO Kitano Symbiotic Systems Project;Department of Social Information",
        "aff_unique_url": "https://www.jst.go.jp;https://www.kyoto-u.ac.jp",
        "aff_unique_abbr": "JST;Kyoto U",
        "aff_campus_unique_index": "0;1;0;0",
        "aff_campus_unique": "Tokyo;Kyoto",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895258",
        "title": "A general approach for modeling robots",
        "track": "main",
        "status": "Poster",
        "abstract": "Modeling manipulators has been an important part in robotic simulations. There are various types of robot systems used in today's robotic research and application, e.g., the six axis industrial robots, humanoid redundant manipulators and 4 finger grippers. Therefore, the model's structure can be very complex, requiring techniques for both modeling and simulating the system. \"Traditional\" simulation packages handle each robot respectively. This paper presents a formal model for arbitrary manipulators or grippers and implement the theoretical ideas into a real modeling and simulation tool.",
        "primary_area": "",
        "author": "O. Rogalla;K. Pohl;R. Dillmann;O. Rogalla;K. Pohl;R. Dillmann",
        "authorids": "/37338264800;/37269234200;/37280242100;/37338264800;/37269234200;/37280242100",
        "aff": "Institute for Process Control & Robotics, University of Karlsruhe, Karlsruhe, Germany; Institute for Process Control & Robotics, University of Karlsruhe, Karlsruhe, Germany; Institute for Process Control & Robotics, University of Karlsruhe, Karlsruhe, Germany",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895258/",
        "gs_citation": 5,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2650100854565592695&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Karlsruhe",
        "aff_unique_dep": "Institute for Process Control & Robotics",
        "aff_unique_url": "https://www.kit.edu",
        "aff_unique_abbr": "KIT",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Karlsruhe",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "895300",
        "title": "A geometric approach to gait generation for eel-like locomotion",
        "track": "main",
        "status": "Poster",
        "abstract": "We investigate issues of control and motion planning for a biomimetic robotic system. Previous work has shown that the motion problem can be decoupled into trajectory generation and steering. We investigate basic issues of momentum generation for a class of dynamic mobile robots, focusing on eel-like swimming robots. We use control laws based on a series of gaits motivated by the biological literature on coupled oscillators and central pattern generators. A primary characteristic of this class of robots is that drift plays a significant role in the generation of motion. We develop theoretical justification for a forward gait that has been observed in nature and for a turning gait, used in our control laws, that has not yet been studied in the biological literature. We also explore theoretical predictions of novel gaits for turning and sideways swimming.",
        "primary_area": "",
        "author": "K.A. McIsaac;J.P. Ostrowski;K.A. McIsaac;J.P. Ostrowski",
        "authorids": "/37282146200;/37340417700;/37282146200;/37340417700",
        "aff": "General Robotics Automation, Sensing and Perception GRASP Laboratory, University of Pennsylvania, Philadelphia, PA, USA; General Robotics Automation, Sensing and Perception GRASP Laboratory, University of Pennsylvania, Philadelphia, PA, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895300/",
        "gs_citation": 10,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17783175343117921248&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Pennsylvania",
        "aff_unique_dep": "General Robotics Automation, Sensing and Perception GRASP Laboratory",
        "aff_unique_url": "https://www.upenn.edu",
        "aff_unique_abbr": "UPenn",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Philadelphia",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895222",
        "title": "A gradient-based approach to collision-free quasi-optimal trajectory planning of nonholonomic systems",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper discusses the optimal trajectory planning problem of nonholonomic systems in the presence of obstacles. The problem can be formulated as an optimal control problem by incorporating final state errors and obstacle avoidance conditions in the cost function. To solve the highly nonlinear optimal control problem, we introduce the concept of the order of priority into the trajectory generation procedure. We place the first priority on the convergence of the state to a desired state. The second priority is given to obstacle avoidance and the third priority is given to trajectory optimization. Then, a gradient-based iterative algorithm which synthesizes the gradient function in a hierarchical manner considering the order of priority is proposed. The simulation results of the 3-link planar free-joint manipulator are given to show the effectiveness of the proposed algorithm.",
        "primary_area": "",
        "author": "M. Iwamura;M. Yamamoto;A. Mohri;M. Iwamura;M. Yamamoto;A. Mohri",
        "authorids": "/37340653300;/37279875200;/37275989300;/37340653300;/37279875200;/37275989300",
        "aff": "Department of Intelligent Machinery and Systems Faculty of Engineering, Kyushu University, Fukuoka, Japan; Department of Intelligent Machinery and Systems Faculty of Engineering, Kyushu University, Fukuoka, Japan; Department of Intelligent Machinery and Systems Faculty of Engineering, Kyushu University, Fukuoka, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895222/",
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13523509023745168510&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Kyushu University",
        "aff_unique_dep": "Department of Intelligent Machinery and Systems",
        "aff_unique_url": "https://www.kyushu-u.ac.jp",
        "aff_unique_abbr": "Kyushu U",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Fukuoka",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895288",
        "title": "A gripper for grasping non-rigid material pieces out of a bundle",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper deals with the concept, design, construction and experimental results of a gripper dedicated to the grasping of nonrigid material pieces out of a bundle. Based on a number of functional requirements a gripper is proposed with two passively rotating fingers and its performance is assessed experimentally in the case of grasping furs.",
        "primary_area": "",
        "author": "N. Fahantidis;Z. Doulgeri;N. Fahantidis;Z. Doulgeri",
        "authorids": "/37330686400;/37274011500;/37330686400;/37274011500",
        "aff": "Department of Electrical &Computer Engineering, Aristotle University of Thessaloniki, Thessaloniki, Greece; Department of Electrical &Computer Engineering, Aristotle University of Thessaloniki, Thessaloniki, Greece",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895288/",
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11486551199314820924&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Aristotle University of Thessaloniki",
        "aff_unique_dep": "Department of Electrical & Computer Engineering",
        "aff_unique_url": "https://www.auth.gr",
        "aff_unique_abbr": "AUTH",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Thessaloniki",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Greece"
    },
    {
        "id": "895197",
        "title": "A lightweight plastic robotic humanoid",
        "track": "main",
        "status": "Poster",
        "abstract": "Details the design and construction of a full sized robotic humanoid whose body is made entirely from lightweight polyurethane plastic and whose total size and weight are that of a typical human adult. The design of this robot was conceived with research in the conventional human environment in mind, incorporating all aspects of human mobility and sensory capabilities. Plastic components for the robot are easily and quickly manufactured, and are easy and cost effective to replace if damaged or broken. The substantial saving in weight that is possible through the use of plastics significantly affects other aspects of the design including motor and cabling capacities as well as battery life.",
        "primary_area": "",
        "author": "A. Price;R. Jarvis;R.A. Russell;L. Kleeman;A. Price;R. Jarvis;R.A. Russell;L. Kleeman",
        "authorids": "/37409003700;/37361772400;/38556838300;/37319383900;/37409003700;/37361772400;/38556838300;/37319383900",
        "aff": "Intelligent Robotics Research Centre, Monash University, Clayton, Australia; Intelligent Robotics Research Centre, Monash University, Clayton, Australia; Intelligent Robotics Research Centre, Monash University, Clayton, Australia; Intelligent Robotics Research Centre, Monash University, Clayton, Australia",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895197/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9900620394620710699&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Monash University",
        "aff_unique_dep": "Intelligent Robotics Research Centre",
        "aff_unique_url": "https://www.monash.edu",
        "aff_unique_abbr": "Monash",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Clayton",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "895283",
        "title": "A new algorithm for computing minimum distance",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper presents a new algorithm for computing the minimum distance between convex polyhedras. The algorithm of Gilbert-Johnson-Keerthi (GJK) and the algorithm of Lin-Canny (LC) are well-known fast solutions to the problem. We show how a mix between LC's idea and the GJK's algorithm can be used to solve the problem. In our algorithm, we use local methods to calculate the distance between features and new \"updating\" conditions to add stability. These new conditions enable one to ensure more stability when compared to GJK. We also modify our terminating conditions to add robustness to our approach. Our experiments also show that the expected running time of our approach is constant, independent of the complexity of the polyhedra. We present some comparisons of our method with GJK.",
        "primary_area": "",
        "author": "K. Sundaraj;D. D'Aulignac;E. Mazer;K. Sundaraj;D. D'Aulignac;E. Mazer",
        "authorids": "/37542974100;/37444065000;/37279811200;/37542974100;/37444065000;/37279811200",
        "aff": "ZIRST, INRIA-Rhone-Alpes SHARP Project, Saint Martin, France; ZIRST, INRIA-Rhone-Alpes SHARP Project, Saint Martin, France; ZIRST, INRIA-Rhone-Alpes SHARP Project, Saint Martin, France",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895283/",
        "gs_citation": 21,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17867786085322953202&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "INRIA-Rhone-Alpes",
        "aff_unique_dep": "SHARP Project",
        "aff_unique_url": "https://www.inria.fr/en",
        "aff_unique_abbr": "INRIA",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Saint Martin",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "France"
    },
    {
        "id": "895312",
        "title": "A new memory model for selective perception systems",
        "track": "main",
        "status": "Poster",
        "abstract": "Selectively perceiving systems explore their environment by fixating on and analyzing potentially interesting parts of a scene in a continual manner. During this process, a sequence of snapshots, each containing visual data with distinct spatio-temporal properties, is collected. We propose a visual memory model that enables the integration of this spatio-temporal data. This memory model, referred to as the bubble model, uses a spherical surface attached to the viewpoint in order to store and manipulate information collected during selective perception process. The bubble surface can be deformed by a number of control points to represent visual information obtained from different fixation points. Bubbles are indexed by the viewpoint vectors so that they can be recalled or updated as necessary. Different bubbles attached to the same viewpoint can store multiple simple and complex features. Using time stamps and parametric surface representations the model can also be used to extract changes and similarities in the environment.",
        "primary_area": "",
        "author": "C. Soyer;H.I. Bozma;Y. Istefanopulos;C. Soyer;H.I. Bozma;Y. Istefanopulos",
        "authorids": "/38241802400;/38222255200;/37370978800;/38241802400;/38222255200;/37370978800",
        "aff": "Institute of Biomedical Engineering, Boğaziçi University, Bebek, Istanbul, Turkey; Department of Electrical Engineering, Boğaziçi University, Bebek, Istanbul, Turkey; Y. Istefanopulos",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895312/",
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11643872633174608509&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Boğaziçi University;",
        "aff_unique_dep": "Institute of Biomedical Engineering;",
        "aff_unique_url": "https://www.boun.edu.tr;",
        "aff_unique_abbr": "Bogazici;",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Istanbul;Bebek, Istanbul;",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Turkey;"
    },
    {
        "id": "895299",
        "title": "A novel mobile robot with a backbone for self up-righting capability",
        "track": "main",
        "status": "Poster",
        "abstract": "Inspired by ground mammals that can easily recover themselves from a lying-down state, mobile robots with a backbone are expected to present the same capability, which might be an additional feature for autonomous mobile robots on rough terrains or in unstable environments. In the paper, the authors present the implementation of an electrically powered mobile robot, SRR-II, which has three body-segments and a backbone with seven degrees of freedom as well. Judging from sensory data, the robot can recover itself from any initial position to the normal up-right position in less than 26 seconds, the only thing an operator has to do is a single click on the UGI. Details are given on joint layouts, system design considerations and the robot performance.",
        "primary_area": "",
        "author": "Jinwu Qian;Weiming Cheng;Yongyi He;Jianliang Su;Yanan Zhang;Jinwu Qian;Weiming Cheng;Yongyi He;Jianliang Su;Yanan Zhang",
        "authorids": "/37087303829;/37087475082;/37087174144;/37087427898;/37087397811;/37087303829;/37087475082;/37087174144;/37087427898;/37087397811",
        "aff": "Department of Precision Mechanical Engineering, Shanghai University, Shanghai, China; Department of Precision Mechanical Engineering, Shanghai University, Shanghai, China; Department of Precision Mechanical Engineering, Shanghai University, Shanghai, China; Department of Precision Mechanical Engineering, Shanghai University, Shanghai, China; Department of Precision Mechanical Engineering, Shanghai University, Shanghai, China",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895299/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5594919163097339042&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Shanghai University",
        "aff_unique_dep": "Department of Precision Mechanical Engineering",
        "aff_unique_url": "https://www.shu.edu.cn",
        "aff_unique_abbr": "SHU",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Shanghai",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "China"
    },
    {
        "id": "895277",
        "title": "A robot snake to inspect broken buildings",
        "track": "main",
        "status": "Poster",
        "abstract": "We build a snake-like robot for the inspection of areas that are difficult or dangerous to be accessed by human. Pictures from a camera at the robot's head are sent to a remote screen and can be monitored by a human operator. This human operator can also control the robot's motion, but not every single body part. Thus the operator only gives general directives and the robot will then able to follow autonomously the given directives. This is the semi-autonomous behavior of the robot. However, the robot must also be able to act fully autonomous when the contact to the operator is lost. After a short description of the robot we present a method which makes the operator control easy and also allows the robot to act fully autonomous. The autonomous motion control of the robot moving in a sewer pipe has been implemented.",
        "primary_area": "",
        "author": "K.L. Paap;T. Christaller;F. Kirchner;K.L. Paap;T. Christaller;F. Kirchner",
        "authorids": "/37377699500;/37087251070;/37283559600;/37377699500;/37087251070;/37283559600",
        "aff": "Institute for Autonomous intelligent Systems, GMD, Sankt Augustin, Germany; Institute for Autonomous intelligent Systems, GMD, Sankt Augustin, Germany; Institute for Autonomous intelligent Systems, GMD, Sankt Augustin, Germany",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895277/",
        "gs_citation": 70,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14713908312924613891&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Institute for Autonomous Intelligent Systems",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "GMD",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "895201",
        "title": "A robotic CAD system using a Bayesian framework",
        "track": "main",
        "status": "Poster",
        "abstract": "We present a Bayesian CAD system for robotic applications. We address the problem of the propagation of geometric uncertainties, and how to take this propagation into account when solving inverse problems. We describe the methodology we use to represent and handle uncertainties using probability distributions of the system's parameters and sensor measurements. It may be seen as a generalization of constraint-based approaches where we express a constraint as a probability distribution instead of a simple equality or inequality. Appropriate numerical algorithms used to apply this methodology are also described. Using an example, we show how to apply our approach by providing simulation results using our CAD system.",
        "primary_area": "",
        "author": "K. Mekhnacha;E. Mazer;P. Bessiere;K. Mekhnacha;E. Mazer;P. Bessiere",
        "authorids": "/37296988100;/37279811200;/38528912300;/37296988100;/37279811200;/38528912300",
        "aff": "LEIBNIZ-IMAG, Grenoble, France; INRIA Rhcine-Alpes, ZIRST, GRAVIR/IMAG, Montbonnot, France; LEIBNIZ-IMAG, Grenoble, France",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895201/",
        "gs_citation": 22,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10108168599601545327&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "LEIBNIZ-IMAG;INRIA Rhône-Alpes",
        "aff_unique_dep": ";ZIRST, GRAVIR/IMAG",
        "aff_unique_url": ";https://www.inria.fr",
        "aff_unique_abbr": ";INRIA",
        "aff_campus_unique_index": "0;1;0",
        "aff_campus_unique": "Grenoble;Montbonnot",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "France"
    },
    {
        "id": "895314",
        "title": "A signal-based approach to localization and navigation of autonomous compliant motion",
        "track": "main",
        "status": "Poster",
        "abstract": "Architectures for the execution of autonomous compliant motion (ACM) require modules for 6 degree-of-freedom localization, navigation and force control of robot manipulators. We review existing model- and signal-based approaches to ACM and present a solution for the synthesis of localization and navigation using sensorimotor signals recorded from human demonstration.",
        "primary_area": "",
        "author": "R. Koeppe;G. Hirzinger;R. Koeppe;G. Hirzinger",
        "authorids": "/37275942000;/37279677100;/37275942000;/37279677100",
        "aff": "German Aerospace Center (DLR, Institute of Robotics and Mechatronics, Wessling, Germany; German Aerospace Center (DLR, Institute of Robotics and Mechatronics, Wessling, Germany",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895314/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14999213795859247944&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "German Aerospace Center",
        "aff_unique_dep": "Institute of Robotics and Mechatronics",
        "aff_unique_url": "https://www.dlr.de",
        "aff_unique_abbr": "DLR",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "895318",
        "title": "A simplified criterion for repeatability and its application in constraint path planning problems",
        "track": "main",
        "status": "Poster",
        "abstract": "Compared to typical industrial manipulators, redundant manipulators offer more dexterity and flexibility because of their ability to reach points in their workspace in many different ways, e.g. they can perform self-motions which do not change the position of the TCP. As a consequence a given path in workspace x(t), t/sub 0/",
        "primary_area": "",
        "author": "R. Schaufler;C.H. Fedrowitz;R. Kammuller;R. Schaufler;C.H. Fedrowitz;R. Kammuller",
        "authorids": "/38016143500;/38016148700;/37936515300;/38016143500;/38016148700;/37936515300",
        "aff": "Dept. of Electr. Eng., Inst. for Data Process., Siegen, Germany; C.H. Fedrowitz; R. Kammuller",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895318/",
        "gs_citation": 9,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1651376047724382687&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0",
        "aff_unique_norm": "University of Siegen;",
        "aff_unique_dep": "Department of Electrical Engineering;",
        "aff_unique_url": "https://www.uni-siegen.de;",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Siegen;",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Germany;"
    },
    {
        "id": "895236",
        "title": "A stable target-tracking control for unicycle mobile robots",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper deals with target tracking control of unicycle type mobile robots. Target tracking function is essential for autonomous robots such as guide robots, security guard robots, etc. In the field of mobile robot control, many control schemes for posture stabilization and trajectory tracking problem have been proposed. Target tracking control, however, cannot be achieved using these kinds of control laws. Therefore, a new global asymptotic stable controller for this problem is designed using the backstepping method. The stability of the system is proved using the Lyapunov function. Various simulation results validate the performance and theoretical analysis.",
        "primary_area": "",
        "author": "Sung-On Lee;Young-Jo Cho;Myung Hwang-Bo;Bum-Jae You;Sang-Rok Oh;Sung-On Lee;Young-Jo Cho;Myung Hwang-Bo;Bum-Jae You;Sang-Rok Oh",
        "authorids": "/37087515586;/37087287683;/37087549003;/37087169635;/37087178429;/37087515586;/37087287683;/37087549003;/37087169635;/37087178429",
        "aff": "Intelligent System Control Research Center, Korea Institute of Science and Technology, Seoul, South Korea; Intelligent System Control Research Center, Korea Institute of Science and Technology, Seoul, South Korea; Intelligent System Control Research Center, Korea Institute of Science and Technology, Seoul, South Korea; Intelligent System Control Research Center, Korea Institute of Science and Technology, Seoul, South Korea; Intelligent System Control Research Center, Korea Institute of Science and Technology, Seoul, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895236/",
        "gs_citation": 174,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9153590022473311077&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Korea Institute of Science and Technology",
        "aff_unique_dep": "Intelligent System Control Research Center",
        "aff_unique_url": "https://www.kist.re.kr",
        "aff_unique_abbr": "KIST",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Seoul",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "South Korea"
    },
    {
        "id": "895320",
        "title": "A symbolic-numeric silhouette algorithm",
        "track": "main",
        "status": "Poster",
        "abstract": "The silhouette algorithm developed by Canny (1988, 1993) is a general motion planning algorithm which is known to have the best complexity of all of the general and complete algorithms. The authors present a symbolic-numeric version of the algorithm. This version does not require the symbolic computation of the determinants of resultant matrices, and can work on floating point arithmetic. Though its combinatorial complexity remains the same, but its algebraic complexity has been improved significantly which is very important towards its implementation. Several numerical examples are also presented.",
        "primary_area": "",
        "author": "H. Hirukawa;B. Mourrain;Y. Papegay;H. Hirukawa;B. Mourrain;Y. Papegay",
        "authorids": "/37283738400;/37327070600;/37273442000;/37283738400;/37327070600;/37273442000",
        "aff": "Electrotech. Lab., Tsukuba, Japan; I.N.R.I.A. Sophia Antipolis, Sophia-Antipolis, France; I.N.R.I.A. Sophia Antipolis, Sophia-Antipolis, France",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895320/",
        "gs_citation": 10,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5348666816686880293&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1;1",
        "aff_unique_norm": "Electrotechnical Laboratory;INRIA Sophia Antipolis",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://www.inria.fr/en/centre/sophia-antipolis",
        "aff_unique_abbr": ";INRIA",
        "aff_campus_unique_index": "0;1;1",
        "aff_campus_unique": "Tsukuba;Sophia Antipolis",
        "aff_country_unique_index": "0;1;1",
        "aff_country_unique": "Japan;France"
    },
    {
        "id": "895219",
        "title": "A two level fuzzy PRM for manipulation planning",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper presents an algorithm which extends the probabilistic roadmap (PRM) framework to handle manipulation planning. This is done by using a two level approach, a PRM of PRMs. The first level builds a manipulation graph, whose nodes represent stable placements of the manipulated objects while the edges represent transfer and transit actions. The actual motion planning for the transfer and transit paths is done by PRM planners at the second level. The approach is made possible by the introduction of a new kind of roadmap, called the fuzzy roadmap. The fuzzy roadmap contains edges which are not verified by a local planner during construction. Instead, each edge is assigned a number which represents the probability that it is feasible. Later, if the edge is part of a solution path, the edge is checked for collisions. The overall effect is that our roadmaps evolve iteratively until they contain a solution. The use of fuzzy roadmaps in both levels of our manipulation planner offers many advantages. At the first level, a fuzzy roadmap represents the manipulation graph and addresses the problem of having probabilistically complete planners at the second level. At the second level, fuzzy roadmaps drastically reduce the number of collision checks. The paper contains experimental results demonstrating the feasibility and efficiency of our scheme.",
        "primary_area": "",
        "author": "C.L. Nielsen;L.E. Kavraki;C.L. Nielsen;L.E. Kavraki",
        "authorids": "/37086888095;/37279015600;/37086888095;/37279015600",
        "aff": "Maersk Inst., Univ. of Southern Denmark, Odense, Denmark; Department of Computer Science, Rice University, Houston, TX, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895219/",
        "gs_citation": 237,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10669511743867544859&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "University of Southern Denmark;Rice University",
        "aff_unique_dep": "Maersk Institute;Department of Computer Science",
        "aff_unique_url": "https://www.sdu.dk;https://www.rice.edu",
        "aff_unique_abbr": "SDU;Rice",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Odense;Houston",
        "aff_country_unique_index": "0;1",
        "aff_country_unique": "Denmark;United States"
    },
    {
        "id": "895265",
        "title": "A wall climbing robot with closed link mechanism",
        "track": "main",
        "status": "Poster",
        "abstract": "A compact and robust wall climbing robot, called MRWALLSPECT, has been developed. The robot is designed for scanning external surfaces of gas or oil tanks and inspecting defects with nondestructive testing tools during navigation. It accomplishes fundamental three-degree-of-freedom locomotion such as translation and rotation over the wall with a novel closed link mechanism that we have originally devised. Its design and implementation issues are discussed and the results of tests are addressed.",
        "primary_area": "",
        "author": "H.R. Choi;S.M. Ryew;T.H. Kang;J.H. Lee;H.M. Kim;H.R. Choi;S.M. Ryew;T.H. Kang;J.H. Lee;H.M. Kim",
        "authorids": "/37290854100;/38253700500;/37556817500;/37089064068;/38257153200;/37290854100;/38253700500;/37556817500;/37089064068;/38257153200",
        "aff": "School of Mechanical Engineering, Sungkyunkwan University, Suwon, Gyeonggi, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, Gyeonggi, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, Gyeonggi, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, Gyeonggi, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, Gyeonggi, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895265/",
        "gs_citation": 54,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9936467902866455690&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Sungkyunkwan University",
        "aff_unique_dep": "School of Mechanical Engineering",
        "aff_unique_url": "http://www.sungkyunkwan.ac.kr",
        "aff_unique_abbr": "SKKU",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Suwon",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "South Korea"
    },
    {
        "id": "895281",
        "title": "Accelerated proximity queries between convex polyhedra by multi-level Voronoi marching",
        "track": "main",
        "status": "Poster",
        "abstract": "We present an accelerated proximity query algorithm between moving convex polyhedra. The algorithm combines Voronoi-based feature tracking with a multi-level-of-detail representation, in order to adapt to the variation in levels of coherence and speed up the computation. It provides a progressive refinement framework for collision detection and distance queries. We have implemented our algorithm and have observed significant performance improvements in our experiments, especially on scenarios where the coherence is low.",
        "primary_area": "",
        "author": "S.A. Ehmann;M.C. Lin;S.A. Ehmann;M.C. Lin",
        "authorids": "/37449231600;/37278387400;/37449231600;/37278387400",
        "aff": "Department of Computer Science, North Carolina State University, Chapel Hill, NC, USA; Department of Computer Science, North Carolina State University, Chapel Hill, NC, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895281/",
        "gs_citation": 151,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5265908424333373901&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "North Carolina State University",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.ncsu.edu",
        "aff_unique_abbr": "NCSU",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Chapel Hill",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895218",
        "title": "Active visual localisation for cooperating inspection robots",
        "track": "main",
        "status": "Poster",
        "abstract": "In the routine inspection of industrial or other areas, teams of robots with various sensors could operate together to great effect, but require reliable, accurate and flexible localisation capabilities to be able to move around safely. We demonstrate accurate localisation for an inspection team consisting of a robot with stereo active vision and its companion with an active lighting system, and show that in this case a single sensor can be used for measuring the position of known or unknown scene features, measuring the relative location of the two robots, and actually carrying out an inspection task.",
        "primary_area": "",
        "author": "A.J. Davison;N. Kita;A.J. Davison;N. Kita",
        "authorids": "/37293837200;/37278493000;/37293837200;/37278493000",
        "aff": "Intelligent Systems Division, Electro Technical Laboratory, Tsukuba, Ibaraki, Japan; Intelligent Systems Division, Electro Technical Laboratory, Tsukuba, Ibaraki, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895218/",
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4673796692696514402&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Electro Technical Laboratory",
        "aff_unique_dep": "Intelligent Systems Division",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tsukuba",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895239",
        "title": "Adaptive generation of desired velocity field for cooperative mobile robots with decentralized PVFC",
        "track": "main",
        "status": "Poster",
        "abstract": "We have proposed a decentralized control method based on passive velocity field control (PVFC) in previous works (1997, 1998). However, the feedback was localized and the desired velocity field was given by a central controller. The geometry cooperative multiple mobile robot system whose subsystem is under nonholonomic constraints and which conveys a common rigid object in a horizontal plain was proposed. In this paper, we propose a method to generate the desired velocity field for cooperative mobile robots with decentralized PVFC. The proposed control method for cooperative mobile robots is constructed by extending the PVFC and ensures the stability and boundedness using projection algorithm. Finally, the efficiency of the proposed method is examined by computer simulations for cooperative tasks with two manipulators.",
        "primary_area": "",
        "author": "M. Yamakita;J.H. Suh;M. Yamakita;J.H. Suh",
        "authorids": "/37279385100;/37732596900;/37279385100;/37732596900",
        "aff": "Department of Control and Systems Engineering, Tokyo Institute of Technology, Meguro, Tokyo, Japan; Department of Control and Systems Engineering, Tokyo Institute of Technology, Meguro, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895239/",
        "gs_citation": 12,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15935978721245063127&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Department of Control and Systems Engineering",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Meguro, Tokyo",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895294",
        "title": "Algorithms for self-reconfiguring molecule motion planning",
        "track": "main",
        "status": "Poster",
        "abstract": "In this paper we present algorithms for planning the motion of robotic \"molecules\" (modules) on a substrate of other molecules. Our approach is to divide self-reconfiguration planning into three levels: trajectory planning, configuration planning, and task-level planning. This paper focuses on algorithms for trajectory planning, moving a single molecule from a start location to a goal location, and configuration planning, moving a set of molecules from a starting configuration to a goal configuration. We also present our scaffold planning approach in which the interior of a structure contains three-dimensional tunnels. This allows molecules to move within a structure as well as on the surface, simplifying molecule motion planning as well as increasing parallelism. In addition, we present a new gripper-type connection mechanism for the molecule which does not require power to maintain connections.",
        "primary_area": "",
        "author": "K.D. Kotay;D.L. Rus;K.D. Kotay;D.L. Rus",
        "authorids": "/37328560000;/37279652300;/37328560000;/37279652300",
        "aff": "Department of Computer Science, Dartmouth College, Hanover, NH, USA; Department of Computer Science, Dartmouth College, Hanover, NH, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895294/",
        "gs_citation": 119,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12500512956569062019&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Dartmouth College",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.dartmouth.edu",
        "aff_unique_abbr": "Dartmouth",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Hanover",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895220",
        "title": "An adaptive framework for 'single shot' motion planning",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper proposes an adaptive framework for single shot motion planning, i.e., planning without preprocessing. This framework can be used in any situation, and in particular, is suitable for crowded environments in which the robot's free C-space has narrow corridors such as maintainability studies in complex 3D CAD models. Our iterative strategy adaptively selects a planner whose strengths match the current situation, and then, online, switches to a different planner when circumstances change. This requires techniques to evaluate the characteristics of the current query, and a set of planners which are characterized so that we can match the query with the best planner for it. Our experimental results in complex 3D CAD environments show that our strategy solves queries that none of the planners could solve on their own.",
        "primary_area": "",
        "author": "D.R. Vallejo;C. Jones;N.M. Amato;D.R. Vallejo;C. Jones;N.M. Amato",
        "authorids": "/37296593600;/37440316500;/37277222500;/37296593600;/37440316500;/37277222500",
        "aff": "Texas A and M University, USA; Sandia National Laboratories, USA; Texas A and M University, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895220/",
        "gs_citation": 34,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1268607656041501432&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "Texas A&M University;Sandia National Laboratories",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.tamu.edu;https://www.sandia.gov",
        "aff_unique_abbr": "TAMU;SNL",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895315",
        "title": "Analysis of rigid body interactions for compliant motion tasks using the Grassmann-Cayley algebra",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper studies the statics and the instantaneous kinematics of a rigid body constrained to keep an arbitrary number of surface-surface contacts with a rigid static environment during its motion. These properties are analyzed under the frictionless assumption by modelling each contact with a kinematic chain that instantaneously gives the same motion freedom as the contact itself and by studying the resulting parallel chain using the Grassmann-Cayley algebra. With this algebra twists and wrenches can be expressed by means of extensors and operated using the join and meet operators. Moreover, the duality inherent in this algebra is used to reflect the reciprocity condition between possible twists and admissible wrenches between partially constrained rigid bodies.",
        "primary_area": "",
        "author": "E. Staffetti;F. Thomas;E. Staffetti;F. Thomas",
        "authorids": "/37277974200;/38308384700;/37277974200;/38308384700",
        "aff": "Institut de Robòtica i Informàtica Industrial UPC-CSIC, Barcelona, Spain; Institut de Robòtica i Informàtica Industrial UPC-CSIC, Barcelona, Spain",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895315/",
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8572530314258743067&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Institut de Robòtica i Informàtica Industrial",
        "aff_unique_dep": "UPC-CSIC",
        "aff_unique_url": "https://www.iri.upc.edu/",
        "aff_unique_abbr": "IRI",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Barcelona",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Spain"
    },
    {
        "id": "895278",
        "title": "Application of locomotive robot to rescue tasks",
        "track": "main",
        "status": "Poster",
        "abstract": "The research aim is to apply locomotive robots to rescue tasks, such as searching for sufferers and removing obstacles to save sufferers. The paper discusses the exploitation of arm and leg integrated robots and basic experiments of infrared probing sensor, in the application of rescue tasks. First, the limb mechanism is introduced and discussed in the aspect of locomotion capability and stability in rough terrain of disaster area. Then, the probing sensor is evaluated in the aspect of its detection range and capability. Assuming the sensor is mounted on the tip of robot arm for probing, the probing algorithm is proposed to find quickly and locate precisely a sufferer. The basic experiments have been carried out using a parallel arm to confirm the applicability and the usefulness of the proposed rescue system.",
        "primary_area": "",
        "author": "Y. Mae;A. Yoshida;T. Arai;K. Inoue;K. Miyawaki;H. Adachi;Y. Mae;A. Yoshida;T. Arai;K. Inoue;K. Miyawaki;H. Adachi",
        "authorids": "/37281355800;/37087614816;/37281360800;/37281357300;/37443783100;/37342435100;/37281355800;/37087614816;/37281360800;/37281357300;/37443783100;/37342435100",
        "aff": "Department of Systems and Human Science, Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science, Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science, Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science, Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Hitachi Zosen Company Limited, Japan; Mechanical Engineering Laboratory, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895278/",
        "gs_citation": 12,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5830811789451154415&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 12,
        "aff_unique_index": "0;0;0;0;1;2",
        "aff_unique_norm": "Osaka University;Hitachi Zosen Company Limited;Mechanical Engineering Laboratory",
        "aff_unique_dep": "Department of Systems and Human Science;;Mechanical Engineering",
        "aff_unique_url": "https://www.osaka-u.ac.jp;https://www.hitachi-zosen.com;",
        "aff_unique_abbr": "Osaka U;;",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Toyonaka;",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895251",
        "title": "Automated CAD-guided robot path planning for spray painting of compound surfaces",
        "track": "main",
        "status": "Poster",
        "abstract": "In this paper, a CAD-guided robot path generator is developed for the spray painting of compound surfaces commonly seen in automotive manufacturing. Instead of widely used parametric representation of surfaces, a planar facet scheme is used to approximate the painting surfaces. As a result, a new combinatorial gun path planning algorithm is proposed. In this algorithm, big patches are formed by stitching small surfaces together. Therefore, the path planning is solved based on the global characteristics of tire part, and the resulting spray gun paths are well-behaved in the sense of time, coverage, and wastage. The proposed algorithm has been implemented and tested using ROBCAD/sup TM//Paint.",
        "primary_area": "",
        "author": "Weihua Sheng;Ning Xi;Mumin Song;Yifan Chen;P. MacNeille;Weihua Sheng;Ning Xi;Mumin Song;Yifan Chen;P. MacNeille",
        "authorids": "/37087214949;/37087151867;/37087216084;/37087160322;/37330056600;/37087214949;/37087151867;/37087216084;/37087160322;/37330056600",
        "aff": "Electrical and Computer Engineering Department, Michigan State University, East Lansing, MI, USA; Electrical and Computer Engineering Department, Michigan State University, East Lansing, MI, USA; Scientific Research Laboratory, Ford Motor Company Limited, Dearborn, MI, USA; Scientific Research Laboratory, Ford Motor Company Limited, Dearborn, MI, USA; Scientific Research Laboratory, Ford Motor Company Limited, Dearborn, MI, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895251/",
        "gs_citation": 114,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=792856212776298377&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;1;1;1",
        "aff_unique_norm": "Michigan State University;Ford Motor Company",
        "aff_unique_dep": "Electrical and Computer Engineering Department;Scientific Research Laboratory",
        "aff_unique_url": "https://www.msu.edu;https://www.ford.com",
        "aff_unique_abbr": "MSU;Ford",
        "aff_campus_unique_index": "0;0;1;1;1",
        "aff_campus_unique": "East Lansing;Dearborn",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895313",
        "title": "Autonomous compliant motion: the Bayesian approach",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper gives an overview of the different levels of sensor processing complexity found in force controlled tasks, and explains which techniques from Bayesian probability theory are appropriate to cope with uncertainties and missing information at each of the different levels. The paper reduces all approaches for \"intelligent\" compliant, motion sensor processing to a basis set of just four classes. Some of these algorithms have already been tested experimentally, while others are still beyond the current state-of-the-art. The major contribution of this paper is to bring a clear structure to the field, which should eventually result in an easier integration of different research results, and a more precise discussion about their relative merits and innovations.",
        "primary_area": "",
        "author": "H. Bruyninckx;J. De Schutter;T. Lefebvre;H. Bruyninckx;J. De Schutter;T. Lefebvre",
        "authorids": "/37278642900;/37283056500;/37283070600;/37278642900;/37283056500;/37283070600",
        "aff": "Department Mechanical Engineering, Katholieke Universiteit Leuven, Leuven, Belgium; Department Mechanical Engineering, Katholieke Universiteit Leuven, Leuven, Belgium; Department Mechanical Engineering, Katholieke Universiteit Leuven, Leuven, Belgium",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895313/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17211688413410645663&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Katholieke Universiteit Leuven",
        "aff_unique_dep": "Department of Mechanical Engineering",
        "aff_unique_url": "https://www.kuleuven.be",
        "aff_unique_abbr": "KU Leuven",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Leuven",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Belgium"
    },
    {
        "id": "895291",
        "title": "Autonomous mobile robot in pipe for piping operations",
        "track": "main",
        "status": "Poster",
        "abstract": "An autonomous mobile robot that can move autonomously in a horizontal pipe, a vertical pipe and an elbow joint with bending angle of 90/spl deg/. Furthermore, the robot has a vision sensor and an operating arm in front of the robot body, and accordingly it has functions to execute piping operations, such as inspection of pipe surface, welding of the pipes and so on. The robot is constructed by several units with four wheels connected by universal joints each other. The robot is controlled by a host personal computer and one-chip microcomputers. As the results of operating experiments, the effectiveness of the robot system in autonomous movement in a pipe and an elbow joint and automatic tracking of a welding line was confirmed.",
        "primary_area": "",
        "author": "M. Muramatsu;N. Namiki;R. Koyama;Y. Suga;M. Muramatsu;N. Namiki;R. Koyama;Y. Suga",
        "authorids": "/38015248100;/38020835000;/38023181300;/38021416800;/38015248100;/38020835000;/38023181300;/38021416800",
        "aff": "Faculty of Science and Technology, Keio University, Yokohama, Japan; Faculty of Science and Technology, Keio University, Yokohama, Japan; Faculty of Science and Technology, Keio University, Yokohama, Japan; Faculty of Science and Technology, Keio University, Yokohama, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895291/",
        "gs_citation": 71,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3727438207761519956&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Keio University",
        "aff_unique_dep": "Faculty of Science and Technology",
        "aff_unique_url": "https://www.keio.ac.jp",
        "aff_unique_abbr": "Keio",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Yokohama",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895285",
        "title": "Behavior recognition based on head pose and gaze direction measurement",
        "track": "main",
        "status": "Poster",
        "abstract": "To build smart human interfaces, it is necessary for a system to know a user's intention and point of attention. Since the motion of a person's head pose and gaze direction are closely related to his/her intention and attention, detection of such information can be utilized to build natural and intuitive interfaces. In this paper, we describe a behavior recognition system based on the real-time stereo face tracking and gaze detection system to measure head pose and gaze direction simultaneously. The key aspect of our system is the use of real-time stereo vision together with a simple algorithm which is suitable for real-time processing. Our system we can significantly simplify the algorithm for 3D model fitting to obtain the full 3D pose of the head compared with conventional systems that use monocular camera. The recognition of attentions and gestures of a person is demonstrated in the experiments.",
        "primary_area": "",
        "author": "Y. Matsumoto;T. Ogasawara;A. Zelinsky;Y. Matsumoto;T. Ogasawara;A. Zelinsky",
        "authorids": "/37272999900;/37269488400;/37284697200;/37272999900;/37269488400;/37284697200",
        "aff": "Nara Institute of Science and Technology, Ikoma, Nara, Japan; Nara Institute of Science and Technology, Ikoma, Nara, Japan; Australian National University, Australia",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895285/",
        "gs_citation": 110,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12724859420411005134&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Nara Institute of Science and Technology;Australian National University",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.nist.jp;https://www.anu.edu.au",
        "aff_unique_abbr": "NIST;ANU",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Ikoma;",
        "aff_country_unique_index": "0;0;1",
        "aff_country_unique": "Japan;Australia"
    },
    {
        "id": "895276",
        "title": "Biomimetic search for urban search and rescue",
        "track": "main",
        "status": "Poster",
        "abstract": "A key objective for a mobile robot in urban search and rescue (USAR) is to efficiently fined survivors, get near enough to communicate and/or drop off communications and biomedical monitoring gear. This paper discusses a biomimetic search strategy extracted from ethological studies of how insects and animals forage for food, and cognitive studies of how children search for objects. This leads to a biomimetic search organization where a robot partitions the search space based on the semantic understanding of the expected distribution of survivors, then systematically searches each of the volumes in ranked order. While in transit between volumes, the robot conducts a passive opportunistic search. The paper also describes how this search strategy is being implemented and evaluated on a mobile robot for two upcoming USAR competitions.",
        "primary_area": "",
        "author": "R.R. Murphy;R.R. Murphy",
        "authorids": "/37273983600;/37273983600",
        "aff": "Computer Science and Engineering, University of South Florida, Tampa, FL, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895276/",
        "gs_citation": 23,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4390536362413717910&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 2,
        "aff_unique_index": "0",
        "aff_unique_norm": "University of South Florida",
        "aff_unique_dep": "Computer Science and Engineering",
        "aff_unique_url": "https://www.usf.edu",
        "aff_unique_abbr": "USF",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Tampa",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895229",
        "title": "Biomimetic trajectory planning via redundant actuation",
        "track": "main",
        "status": "Poster",
        "abstract": "It is well-known that bio-systems do not calculate inverse dynamics for trajectory planning, but they move by proper modulation of the system's impedances. Inspired by bio-systems, a biomimetic trajectory planning method is introduced. This scheme is based on employment of redundant actuation which prevails in bio-systems. We explain that in the generation of the biomimetic trajectory, intelligent structure of bio-systems plays an important role to completely modulate the dynamic behaviour of a system, such as natural frequencies and damping ratios. A five-bar mechanism equipped with two redundant actuators is employed to demonstrate the feasibility of the proposed biomimetic trajectory experimentally.",
        "primary_area": "",
        "author": "J.H. Lee;B.-J. Yi;I.H. Suh;J.H. Lee;B.-J. Yi;I.H. Suh",
        "authorids": "/37280332900;/37273970700;/37385851500;/37280332900;/37273970700;/37385851500",
        "aff": "School of Electrical Engineering and Computer Science, Hanyang University, South Korea; Hanyang University, Seongdong-gu, Seoul, KR; I.H. Suh",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895229/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1727660333464986427&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Hanyang University;Unknown Affiliation",
        "aff_unique_dep": "School of Electrical Engineering and Computer Science;",
        "aff_unique_url": "http://www.hanyang.ac.kr;",
        "aff_unique_abbr": "HYU;",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Seoul",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "South Korea;"
    },
    {
        "id": "895215",
        "title": "Campus walkway following of an autonomous mobile robot based on color image",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper describes a strategy of a mobile robot walkway following using color image. There are different colors in a walkway and lawn area along side the walkway. The walkway area is extracted by an image processing using the difference of color. The robot moves to the direction of vanishing point which is obtained from the image processing. Repeating these processes, the walkway following will be accomplished.",
        "primary_area": "",
        "author": "K. Ohno;T. Tsubouchi;S. Maeyama;S. Yuta;K. Ohno;T. Tsubouchi;S. Maeyama;S. Yuta",
        "authorids": "/37285220400;/37275128600;/37274065800;/37275124100;/37285220400;/37275128600;/37274065800;/37275124100",
        "aff": "Intelligent Robot LaboratoryInstitute of Engineering Mechanics and Systems, University of Tsukuba, Japan; Intelligent Robot LaboratoryInstitute of Engineering Mechanics and Systems, University of Tsukuba, Japan; Intelligent Robot LaboratoryInstitute of Engineering Mechanics and Systems, University of Tsukuba, Japan; Intelligent Robot LaboratoryInstitute of Engineering Mechanics and Systems, University of Tsukuba, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895215/",
        "gs_citation": 7,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3509979201338431684&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "University of Tsukuba",
        "aff_unique_dep": "Institute of Engineering Mechanics and Systems",
        "aff_unique_url": "https://www.tsukuba.ac.jp",
        "aff_unique_abbr": "UT",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Tsukuba",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895270",
        "title": "Capturing a spinning object by two flexible manipulators",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper discusses a way of capturing a spinning object using two flexible manipulators. We propose a capturing procedure using hybrid position/force control and vibration suppression control. The procedure is established so that the manipulators capture the object automatically measuring position and rotational velocity of the object. The motion of the two hands of the manipulators are synchronized with the rotation of the object. The hands make contact with the spinning object safely, considering link flexibility, and then brake the spin smoothly. The effectiveness of our method is shown in experiments using two 3D manipulators, each of which has two flexible links and seven joints.",
        "primary_area": "",
        "author": "M. Yamano;A. Konno;M. Uchiyama;T. Miyabe;M. Yamano;A. Konno;M. Uchiyama;T. Miyabe",
        "authorids": "/37275258300;/37323849300;/37281517000;/37993027400;/37275258300;/37323849300;/37281517000;/37993027400",
        "aff": "Department of Mechanical Systems Engineering, Yamagata University, Yonezawa, Yamagata, Japan; Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan; Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan; Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895270/",
        "gs_citation": 8,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8933082682599993567&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;1;1;1",
        "aff_unique_norm": "Yamagata University;University of Tohoku",
        "aff_unique_dep": "Department of Mechanical Systems Engineering;Department of Aeronautics and Space Engineering",
        "aff_unique_url": "https://www.yamagata-u.ac.jp;https://www.tohoku.ac.jp",
        "aff_unique_abbr": ";Tohoku U",
        "aff_campus_unique_index": "0;1;1;1",
        "aff_campus_unique": "Yonezawa;Sendai",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895319",
        "title": "Catching motion of casting manipulation",
        "track": "main",
        "status": "Poster",
        "abstract": "We have been developing a casting manipulator which includes a flexible arm made out of soft material like a string in the link mechanism to enlarge the work space of the manipulator. In casting manipulation, a gripper is thrown to its target by releasing the string at a suitable time after generating enough motion of the gripper by swinging. In this paper we deal with the catching motion control of the gripper. We consider the necessity of the midair control of the gripper for catching a target. In order to enlarge the reachable area of the gripper, we propose the method of controlling the movement of the string by the brake mechanism. We confirmed the effectiveness of the proposed multiple braking control by simulation results and experimental results.",
        "primary_area": "",
        "author": "H. Arisumi;K. Komoriya;H. Arisumi;K. Komoriya",
        "authorids": "/37293876100;/37280860600;/37293876100;/37280860600",
        "aff": "Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Ibaraki, Japan; Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Ibaraki, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895319/",
        "gs_citation": 25,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9243000613922258606&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Agency of Industrial Science and Technology",
        "aff_unique_dep": "Mechanical Engineering Laboratory",
        "aff_unique_url": "https://www.aist.go.jp",
        "aff_unique_abbr": "AIST",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tsukuba",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895309",
        "title": "Chromatic adaptation pre-filtering effect on visual based motion strategies",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper analyzes the effects of the application of visual adaptation mechanisms on snapshot-based guidance methods. The guidance principle of the visual homing is proven to be a visual potential function with an equilibrium point located at the goal position. The presence of a potential function means that classical control theory principles based on the Lyapunov functions can be applied to assess the robustness of the navigation strategy. The proposed adaptation mechanism is the Retinex algorithm, a blind chromatic adaptation pre-filtering that performs color constancy with no a priori information about the illuminant. It increases the visual information similarity under changes in the illuminant, increasing the robustness of the visual guidance. Tests and comparisons are presented.",
        "primary_area": "",
        "author": "G. Bianco;A. Rizzi;G. Bianco;A. Rizzi",
        "authorids": "/37329660600;/37273999500;/37329660600;/37273999500",
        "aff": "Computer Science Serv, University of Verona, Verona, Italy; Department of Electronics for Automation, University of Brescia, Brescia, Italy",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895309/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13362381114754604587&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "University of Verona;University of Brescia",
        "aff_unique_dep": "Computer Science Serv;Department of Electronics for Automation",
        "aff_unique_url": "https://www.univr.it;https://www.unibs.it",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Verona;Brescia",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Italy"
    },
    {
        "id": "895249",
        "title": "Computation of optimal and collisionfree movements for mobile robots",
        "track": "main",
        "status": "Poster",
        "abstract": "In this paper we present a method for calculating optimal, collisionfree movements for nonholonomic mobile robots. This is formulated as a nonlinear optimal control problem and solved using advanced numerical methods. The concept of artifical potential fields is used for accounting for the obstacles in the environment. Apart from taking advantage of the large body of knowledge from the numerical methods community this has the virtue of facilitating a simple and general problem description. Experiments show that using this method, complex movements can be calculated in a timely fashion.",
        "primary_area": "",
        "author": "K. Kondak;G. Hommel;S. Horstmann;S. Kristensen;K. Kondak;G. Hommel;S. Horstmann;S. Kristensen",
        "authorids": "/37427143400;/37331640300;/37330769000;/37330769800;/37427143400;/37331640300;/37330769000;/37330769800",
        "aff": "Institut für Technische Informatik, Technische Universität Berlin, Berlin, Germany; Institut für Technische Informatik, Technische Universität Berlin, Berlin, Germany; Research & Technology, Intelligent Systems Group, DaimlerChrysler Corporation, Berlin, Germany; Research & Technology, Intelligent Systems Group, DaimlerChrysler Corporation, Berlin, Germany",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895249/",
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8767387582228445899&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;1",
        "aff_unique_norm": "Technische Universität Berlin;DaimlerChrysler Corporation",
        "aff_unique_dep": "Institut für Technische Informatik;Intelligent Systems Group",
        "aff_unique_url": "https://www.tu-berlin.de;https://www.daimler.com",
        "aff_unique_abbr": "TU Berlin;Daimler",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Berlin",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "895206",
        "title": "Constraints in human visuomotor systems",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper reviews empirical work on human visuomotor systems and describes the constraints that limit the transformations these systems can perform. A tentative model is put forward, which describes how information might flow from visual input to motor output. The purpose of this paper is to show how visual neuroscience and robotics can inform each other.",
        "primary_area": "",
        "author": "Yaoping Hu;M.A. Goodale;Yaoping Hu;M.A. Goodale",
        "authorids": "/37087574626;/37443423200;/37087574626;/37443423200",
        "aff": "National Research Council, IMTI, London, ONT, Canada; MRC Group on Action and Perception Department of Psychology, University of Western Ontario, London, ONT, Canada",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895206/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15924496426568476702&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "National Research Council Canada;University of Western Ontario",
        "aff_unique_dep": "Institute for Microstructural Sciences (IMTI);Department of Psychology",
        "aff_unique_url": "https://www.nrc-cnrc.gc.ca;https://www.uwo.ca",
        "aff_unique_abbr": "NRC-CNRC;UWO",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "London",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Canada"
    },
    {
        "id": "895213",
        "title": "Control of giant swing motion of a two-link underactuated horizontal bar robot",
        "track": "main",
        "status": "Poster",
        "abstract": "We investigated a control method to realize the three types of free giant swing motions of a two-link horizontal bar robot. By evaluating eigenvalues of the transitional error matrix on the Poincare plane, it was found that the stable giant swing motions can be obtained by configuration control, in which the actuated joint torque is controlled such that the measured state variables follow the reference configuration with respect to the angular position of the passive joint. We also demonstrated that the stable giant swing motions of type B and C could be realized by the configuration method.",
        "primary_area": "",
        "author": "K. Ono;K. Yamamoto;A. Imadu;K. Ono;K. Yamamoto;A. Imadu",
        "authorids": "/37269086800;/37536641800;/37706336300;/37269086800;/37536641800;/37706336300",
        "aff": "Mechanical Engineering and Science, Tokyo Institute of Technology, Tokyo, Japan; Mechanical Engineering and Science, Tokyo Institute of Technology, Tokyo, Japan; Motor Drives Research Section, Yaskawa Electric Corporation, Fukuoka, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895213/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17399829003836610095&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Tokyo Institute of Technology;Yaskawa Electric Corporation",
        "aff_unique_dep": "Mechanical Engineering and Science;Motor Drives Research Section",
        "aff_unique_url": "https://www.titech.ac.jp;https://www.yaskawa.com",
        "aff_unique_abbr": "Titech;Yaskawa",
        "aff_campus_unique_index": "0;0;1",
        "aff_campus_unique": "Tokyo;Fukuoka",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895304",
        "title": "Coordinated deployment of multiple, heterogeneous robots",
        "track": "main",
        "status": "Poster",
        "abstract": "To be truly useful, mobile robots need to be fairly autonomous and easy to control. This is especially true in situations where multiple robots are used, due to the increase in sensory information and the fact that the robots can interfere with one another. The paper describes a system that integrates autonomous navigation, a task executive, task planning, and an intuitive graphical user interface to control multiple, heterogeneous robots. We have demonstrated a prototype system that plans and coordinates the deployment of teams of robots. Testing has shown the effectiveness and robustness of the system, and of the coordination strategies in particular.",
        "primary_area": "",
        "author": "R. Simmons;D. Apfelbaum;D. Fox;R.P. Goldman;K.Z. Haigh;D.J. Musliner;M. Pelican;S. Thrun;R. Simmons;D. Apfelbaum;D. Fox;R.P. Goldman;K.Z. Haigh;D.J. Musliner;M. Pelican;S. Thrun",
        "authorids": "/37270716800;/37564351100;/37284329000;/37339768700;/37332325900;/37268680200;/37332326500;/37280207800;/37270716800;/37564351100;/37284329000;/37339768700;/37332325900;/37268680200;/37332326500;/37280207800",
        "aff": "School of Computer Science, Carnegie Mellon University, Pittsburgh, PA, USA; School of Computer Science, Carnegie Mellon University, Pittsburgh, PA, USA; School of Computer Science, Carnegie Mellon University, Pittsburgh, PA, USA; Honeywell Technology Center, Minneapolis, MN, USA; Honeywell Technology Center, Minneapolis, MN, USA; D.J. Musliner; Honeywell Technology Center, Minneapolis, MN, USA; School of Computer Science, Carnegie Mellon University, Pittsburgh, PA, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895304/",
        "gs_citation": 114,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6562831493834653095&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 23,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 16,
        "aff_unique_index": "0;0;0;1;1;1;0",
        "aff_unique_norm": "Carnegie Mellon University;Honeywell Technology Center;",
        "aff_unique_dep": "School of Computer Science;;",
        "aff_unique_url": "https://www.cmu.edu;https://www.honeywell.com;",
        "aff_unique_abbr": "CMU;;",
        "aff_campus_unique_index": "0;0;0;1;1;1;0",
        "aff_campus_unique": "Pittsburgh;Minneapolis;",
        "aff_country_unique_index": "0;0;0;0;0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "895268",
        "title": "Coordinated transportation of a single object by multiple mobile robots without position information of each robot",
        "track": "main",
        "status": "Poster",
        "abstract": "We propose a decentralized control algorithm of multiple mobile robots transporting a single object in coordination. In this algorithm, each robot is controlled as if it has a caster-like mechanism and transportation of a single object by multiple mobile robots is realized without using the geometric relations among robots. The proposed control algorithm is experimentally applied to two mobile robots. Experimental results illustrate the validity of the proposed control algorithm.",
        "primary_area": "",
        "author": "Y. Hirata;K. Kosuge;H. Asama;H. Kaetsu;K. Kawabata;Y. Hirata;K. Kosuge;H. Asama;H. Kaetsu;K. Kawabata",
        "authorids": "/37274134900;/37278595800;/37294904700;/37328564500;/37298000800;/37274134900;/37278595800;/37294904700;/37328564500;/37298000800",
        "aff": "Department of Machine Intelligence and Systems Engineering, University of Tohoku, Sendai, Japan; Department of Machine Intelligence and Systems Engineering, University of Tohoku, Sendai, Japan; Biochemical Systems Laboratory, Institute for Physical and Chemical Research, Wako, Saitama, Japan; Biochemical Systems Laboratory, Institute for Physical and Chemical Research, Wako, Saitama, Japan; Biochemical Systems Laboratory, Institute for Physical and Chemical Research, Wako, Saitama, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895268/",
        "gs_citation": 40,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14151777034250732263&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;1;1;1",
        "aff_unique_norm": "University of Tohoku;Institute for Physical and Chemical Research",
        "aff_unique_dep": "Department of Machine Intelligence and Systems Engineering;Biochemical Systems Laboratory",
        "aff_unique_url": "https://www.tohoku.ac.jp;",
        "aff_unique_abbr": "Tohoku U;",
        "aff_campus_unique_index": "0;0;1;1;1",
        "aff_campus_unique": "Sendai;Wako",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895195",
        "title": "Design and development of research platform for perception-action integration in humanoid robot: H6",
        "track": "main",
        "status": "Poster",
        "abstract": "A humanoid robot \"H6\" is developed as a platform for the research on perception-action coupling in intelligent behaviour of humanoid type robots. The H6 has the features as follows: 1) a body which has enough DOFs and each joint has enough torque for full body motion, 2) a PC/AT compatible on-board computer which is controlled by RT-linux so that low-level to high-level control is achieved simultaneously, 3) is self-contained and connected to a network via radio ethernet, 4) a 3D vision function can be applied. The H6 is expected to be a common test-bed for experiment and discussion for various aspects of intelligent humanoid robotics.",
        "primary_area": "",
        "author": "K. Nishiwaki;T. Sugihara;S. Kagami;F. Kanehiro;M. Inaba;H. Inoue;K. Nishiwaki;T. Sugihara;S. Kagami;F. Kanehiro;M. Inaba;H. Inoue",
        "authorids": "/37295621700;/37288884300;/37273845800;/37283667500;/37286658200;/37280631000;/37295621700;/37288884300;/37273845800;/37283667500;/37286658200;/37280631000",
        "aff": "Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895195/",
        "gs_citation": 326,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6257579188595389429&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 12,
        "aff_unique_index": "0;0;0;0;0;0",
        "aff_unique_norm": "University of Tokyo",
        "aff_unique_dep": "Department of Mechano-Informatics",
        "aff_unique_url": "https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "UTokyo",
        "aff_campus_unique_index": "0;0;0;0;0;0",
        "aff_campus_unique": "Bunkyo",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895235",
        "title": "Design of a robust adaptive controller for a mobile robot",
        "track": "main",
        "status": "Poster",
        "abstract": "In the design of a controller for mobile robot, there are only few results on the problem of integrating the nonholonomic kinematic controller and the dynamic controller for mobile robots. Also there are only few literatures on the robustness of the controller in the presence of uncertainties or external disturbances in the dynamical model of mobile robot. In this paper, a robust adaptive controller which can achieve velocity tracking while considering not only kinematic model but also dynamic model of mobile robot is proposed. The proposed controller can overcome model uncertainty or external disturbances by the robust adaptive technique. The stability of the dynamic system is shown through the Lyapunov method.",
        "primary_area": "",
        "author": "M.S. Kim;J.H. Shin;J.J. Lee;M.S. Kim;J.H. Shin;J.J. Lee",
        "authorids": "/37291555300;/37087838727;/37280306200;/37291555300;/37087838727;/37280306200",
        "aff": "Department of Computer Science and Electrical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, South Korea; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Computer Science and Electrical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895235/",
        "gs_citation": 65,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11669359844630796796&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "Korea Advanced Institute of Science and Technology;University of Tokyo",
        "aff_unique_dep": "Department of Computer Science and Electrical Engineering;Department of Mechano-Informatics",
        "aff_unique_url": "https://www.kaist.ac.kr;https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "KAIST;UTokyo",
        "aff_campus_unique_index": "0;1;0",
        "aff_campus_unique": "Daejeon;Bunkyo",
        "aff_country_unique_index": "0;1;0",
        "aff_country_unique": "South Korea;Japan"
    },
    {
        "id": "895253",
        "title": "Design of central pattern generator for humanoid robot walking based on multi-objective GA",
        "track": "main",
        "status": "Poster",
        "abstract": "Recently, the field of humanoid robotics attracts more and more interest and the research on humanoid locomotion based on central pattern generators (CPG) reveals many challenging aspects. This paper describes the design of CPG for stable humanoid bipedal locomotion using an evolutionary approach. In this research, each joint of the humanoid is driven by a neuron that consists of two coupled neural oscillators, and corresponding joint's neurons are connected by strength weight. To achieve natural and robust walking pattern, an evolutionary-based multi-objective optimization algorithm is used to solve the weight optimization problem. The fitness functions are formulated based on zero moment point (ZMP), global attitude of the robot and the walking speed. In the algorithms, real value coding and tournament selection are applied, the crossover and mutation operators are chosen as heuristic crossover and boundary mutation respectively. Following evolving, the robot is able to walking in the given environment and a simulation shows the result.",
        "primary_area": "",
        "author": "Jiang Shan;Cheng Junshi;Chen Jiapin;Jiang Shan;Cheng Junshi;Chen Jiapin",
        "authorids": "/37087540782;/37087615400;/37087617352;/37087540782;/37087615400;/37087617352",
        "aff": "Information storage research center, Shanghai Jiaotong University, Shanghai, China; Information storage research center, Shanghai Jiaotong University, Shanghai, China; Information storage research center, Shanghai Jiaotong University, Shanghai, China",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895253/",
        "gs_citation": 52,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13053579230708456100&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Shanghai Jiaotong University",
        "aff_unique_dep": "Information storage research center",
        "aff_unique_url": "https://www.sjtu.edu.cn",
        "aff_unique_abbr": "SJTU",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Shanghai",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "China"
    },
    {
        "id": "895231",
        "title": "Design of multi-degree-of-freedom spring mechanisms: biomimetic approach",
        "track": "main",
        "status": "Poster",
        "abstract": "Springs have been employed in a wide range of mechanical systems. This work deals with the design of multi degree-of-freedom spring mechanism. The adaptable spring is desired for enhancing performances of various mechanical systems employing springs. We demonstrate that such adaptable springs can be realized by adopting anthropomorphic musculoskeletal structures of the human upper-extremity, which possesses highly nonlinear kinematic-coupling among redundant muscles existing in its structures. We propose multi-degree-of-freedom spring mechanisms resembling the musculoskeletal structure of the human upper-extremity, and verify the applicability of these mechanisms through simulation.",
        "primary_area": "",
        "author": "Byung-Ju Yi;Jae Hoon Lee;Whee Kuk Kim;Il Hong Suh;Byung-Ju Yi;Jae Hoon Lee;Whee Kuk Kim;Il Hong Suh",
        "authorids": "/37087160810;/37087148946;/37086987143;/37086974346;/37087160810;/37087148946;/37086987143;/37086974346",
        "aff": "School of Electrical Engineering and Computer Science, Hanyang University, South Korea; School of Electrical Engineering and Computer Science, Hanyang University, South Korea; Department of Control and Instrumentation Engineering, Korea University, South Korea; School of Electrical Engineering and Computer Science, Hanyang University, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895231/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15343089003702538030&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;0",
        "aff_unique_norm": "Hanyang University;Korea University",
        "aff_unique_dep": "School of Electrical Engineering and Computer Science;Department of Control and Instrumentation Engineering",
        "aff_unique_url": "http://www.hanyang.ac.kr;https://www.korea.ac.kr",
        "aff_unique_abbr": "HYU;KU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "South Korea"
    },
    {
        "id": "895225",
        "title": "Design of the TUAT/Karlsruhe humanoid hand",
        "track": "main",
        "status": "Poster",
        "abstract": "The increasing demand for robotic applications in dynamic unstructured environments is motivating the need for dextrous end-effectors which can cope with the wide variety of tasks and objects encountered in these environments. The human hand is a very complex grasping tool that can handle objects of different sizes and shapes. Many research activities have been carried out to develop artificial robot hands with capabilities similar to the human hand. In this paper the mechanism and design of a new humanoid-type hand (called TUAT/Karlsruhe Humanoid Hand) with human-like manipulation abilities is discussed. The new hand is designed for the humanoid robot ARMAR which has to work autonomously or interactively in cooperation with humans and for an artificial lightweight arm for handicapped persons. The arm is developed as close as possible to the human arm and is driven by spherical ultrasonic motors. The ideal end-effector for such an artificial arm or a humanoid would be able to use the tools and objects that a person uses when working in the same environment. Therefore a new hand is designed for anatomical consistency with the human hand. This includes the number of fingers and the placement and motion of the thumb, the proportions of the link lengths and the shape of the palm. It can also perform most part of human grasping types. The TUAT/Karlsruhe Humanoid Hand possesses 20 DOF and is driven by one actuator which can be placed into or around the hand.",
        "primary_area": "",
        "author": "N. Fukaya;S. Toyama;T. Asfour;R. Dillmann;N. Fukaya;S. Toyama;T. Asfour;R. Dillmann",
        "authorids": "/37589216200;/37295741900;/37295529100;/37280242100;/37589216200;/37295741900;/37295529100;/37280242100",
        "aff": "Department of Mechanical System Engineering, Tokyo University of Agriculture슠and슠Technology, Japan; Department of Mechanical System Engineering, Tokyo University of Agriculture슠and슠Technology, Japan; Department of Computer Science, Institute for Control and Robotics, University of Karlsruhe, Germany; Department of Computer Science, Institute for Control and Robotics, University of Karlsruhe, Germany",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895225/",
        "gs_citation": 357,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12513031073216488129&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;1",
        "aff_unique_norm": "Tokyo University of Agriculture and Technology;University of Karlsruhe",
        "aff_unique_dep": "Department of Mechanical System Engineering;Department of Computer Science, Institute for Control and Robotics",
        "aff_unique_url": "https://www.tuat.ac.jp;https://www.kit.edu",
        "aff_unique_abbr": "TUAT;KIT",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;1;1",
        "aff_country_unique": "Japan;Germany"
    },
    {
        "id": "895264",
        "title": "Design, implementation, and evaluation of an under-actuated miniature biped climbing robot",
        "track": "main",
        "status": "Poster",
        "abstract": "The design, implementation, and evaluation of a miniature biped robot for urban reconnaissance are presented. Design specifications for mobility, space requirement weight, sensing, and control are defined. A revolute hip joint is selected based on its enhanced mobility and capability to function in reasonably confined spaces. Small size dictates minimal weight, which is achieved by an under actuated joint structure, providing steering at only one foot, minimizing sensors, and structural optimization. The smart robotic foot supports the robot on a variety of smooth surfaces and provides feedback when a firm grip is established. Adaptable control strategies and dithering are implemented in lieu of minimal sensors and uncertainty created by backlash, gravity, and compliance in the suction feet. The robot is evaluated while performing tasks on surfaces with a variety of inclinations.",
        "primary_area": "",
        "author": "M. Minor;H. Dulimarta;G. Danghi;R. Mukherjee;R. Lal Tummala;D. Aslam;M. Minor;H. Dulimarta;G. Danghi;R. Mukherjee;R. Lal Tummala;D. Aslam",
        "authorids": "/37279831800;/37329301500;/37087617473;/37279356800;/37087618760;/37281547700;/37279831800;/37329301500;/37087617473;/37279356800;/37087618760;/37281547700",
        "aff": "Mechanical Engineering Departments., Michigan State University, East Lansing, MI, USA; Department of Informatics, Institute of Technology, Bandung, Indonesia; Electrical Engineering Departments., Michigan State University, East Lansing, MI, USA; Mechanical Engineering Departments., Michigan State University, East Lansing, MI, USA; Electrical Engineering Departments., Michigan State University, East Lansing, MI, USA; Electrical Engineering Departments., Michigan State University, East Lansing, MI, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895264/",
        "gs_citation": 109,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18397435565385713947&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 12,
        "aff_unique_index": "0;1;0;0;0;0",
        "aff_unique_norm": "Michigan State University;Institute of Technology",
        "aff_unique_dep": "Mechanical Engineering;Department of Informatics",
        "aff_unique_url": "https://www.msu.edu;",
        "aff_unique_abbr": "MSU;",
        "aff_campus_unique_index": "0;1;0;0;0;0",
        "aff_campus_unique": "East Lansing;Bandung",
        "aff_country_unique_index": "0;1;0;0;0;0",
        "aff_country_unique": "United States;Indonesia"
    },
    {
        "id": "895308",
        "title": "Developing rigid motion constraints for the registration of free-form shapes",
        "track": "main",
        "status": "Poster",
        "abstract": "We propose a novel method to deal with sphere ambiguity, occlusion, appearance and disappearance of points in image registration. We have developed a number of rigid motion constraints through analysis of geometrical properties of reflected correspondence vectors synthesised into a single coordinate frame. The properties are used as further constraints to eliminate false matches obtained by the iterative closest point criterion. A number of experiments based on both synthetic data and real images demonstrate that the proposed method is accurate, robust, and efficient for the registration of free-form shapes.",
        "primary_area": "",
        "author": "Y. Liu;M.A. Rodrigues;Ying Wang;Y. Liu;M.A. Rodrigues;Ying Wang",
        "authorids": "/37089074541;/37328078000;/37087146147;/37089074541;/37328078000;/37087146147",
        "aff": "School of Computing and Management, Sheffield Hallam University, Sheffield, UK; School of Computing and Management, Sheffield Hallam University, Sheffield, UK; Department of Geology, Xi''an University of Science and Technology, Xi'an, China",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895308/",
        "gs_citation": 26,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10827590051992786439&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Sheffield Hallam University;Xi'an University of Science and Technology",
        "aff_unique_dep": "School of Computing and Management;Department of Geology",
        "aff_unique_url": "https://www.shu.ac.uk;http://www.xust.edu.cn",
        "aff_unique_abbr": "SHU;XUST",
        "aff_campus_unique_index": "0;0;1",
        "aff_campus_unique": "Sheffield;Xi'an",
        "aff_country_unique_index": "0;0;1",
        "aff_country_unique": "United Kingdom;China"
    },
    {
        "id": "895267",
        "title": "Development of MEL HORSE",
        "track": "main",
        "status": "Poster",
        "abstract": "MEL HORSE has been developed for studying quadruped robots and biped robots. Biped robot \"MEL Deinonychus II\" is a fore-portion of \"MEL HORSE II\" developed by the author (1996, 1999). To develop a legged robot, one can not avoid the problem of how to control the robot in real-time. Particularly, the zero moment point (ZMP) control is hard work. In this paper, a new approach to generate ZMP reference trajectory of quadruped robot, biped robot and other type legged robot is proposed. Simulation results are also explained.",
        "primary_area": "",
        "author": "H. Takeuchi;H. Takeuchi",
        "authorids": "/37346737100;/37346737100",
        "aff": "Agency of Industrial Science and Technology Mechanical Engineering Laboratory Robotics Department, Ministry of International Trade and Industry, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895267/",
        "gs_citation": 38,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11541024708700614666&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 2,
        "aff_unique_index": "0",
        "aff_unique_norm": "Agency of Industrial Science and Technology",
        "aff_unique_dep": "Mechanical Engineering Laboratory Robotics Department",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895254",
        "title": "Development of a biped humanoid simulator",
        "track": "main",
        "status": "Poster",
        "abstract": "Since a biped humanoid inherently suffers from instability and always risks to tipping over, stable and reliable biped walking is the most important goal. The simulator is a significant tool to pursue this goal. In this paper, we first present a method for constructing a humanoid simulator that can closely model and predict the motion of an actual humanoid. We then propose a balance controller consisting of an off-line walk-pattern generator and a real-time modification. Using the simulator, we can predict the humanoid's physical capability subject to the constraints of actuators, and clarify the required specifications of actuators to execute a desired task. The functions of the developed simulator and the effectiveness of the proposed balance controller were evaluated through simulated walks on an unknown rough terrain, soft ground, and an environment in the presence of disturbances.",
        "primary_area": "",
        "author": "Qiang Huang;Y. Nakamura;H. Arai;K. Tanie;Qiang Huang;Y. Nakamura;H. Arai;K. Tanie",
        "authorids": "/37087193469;/37280754600;/37333485800;/37441233000;/37087193469;/37280754600;/37333485800;/37441233000",
        "aff": "Department of Mechano-Informat, ics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informat, ics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Robobics, Mechanical Engineering Laboratory, Tsukuba, Ibaraki, Japan; Department of Robobics, Mechanical Engineering Laboratory, Tsukuba, Ibaraki, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895254/",
        "gs_citation": 30,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=667545446716945497&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;1",
        "aff_unique_norm": "University of Tokyo;Mechanical Engineering Laboratory",
        "aff_unique_dep": "Department of Mechano-Informatics;Department of Robobics",
        "aff_unique_url": "https://www.u-tokyo.ac.jp;",
        "aff_unique_abbr": "UTokyo;",
        "aff_campus_unique_index": "0;0;1;1",
        "aff_campus_unique": "Bunkyo;Tsukuba",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895289",
        "title": "Development of a high performance direct-drive joint",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper reports on advances in the design and development of a high performance direct-drive joint for robotics and automation. The key design aspects of the mechanical components, sensors, control architecture, and a hydraulically actuated dynamometer testbed are described. We also present a number of advanced implementations in control, motor torque control, and motion control using positive joint torque feedback. Experimental results illustrate outstanding performance regarding thermal response, torque ripple, reference trajectory tracking, torque disturbance rejection, and joint stiffness.",
        "primary_area": "",
        "author": "F. Aghili;M. Buehler;J.M. Hollerbach;F. Aghili;M. Buehler;J.M. Hollerbach",
        "authorids": "/37282166400;/37272992400;/37297489500;/37282166400;/37272992400;/37297489500",
        "aff": "Space Systems, Canadian Space Agency, Saint-Hubert, QUE, Canada; Department of Mechanical Engineering, McGill University, Montreal, QUE, Canada; Department of Computer Science, University of Utah, Salt Lake, UT, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895289/",
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15777091530689018797&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1;2",
        "aff_unique_norm": "Canadian Space Agency;McGill University;University of Utah",
        "aff_unique_dep": "Space Systems;Department of Mechanical Engineering;Department of Computer Science",
        "aff_unique_url": "https://www.asc-csa.gc.ca;https://www.mcgill.ca;https://www.utah.edu",
        "aff_unique_abbr": "CSA;McGill;Utah",
        "aff_campus_unique_index": "0;1;2",
        "aff_campus_unique": "Saint-Hubert;Montreal;Salt Lake",
        "aff_country_unique_index": "0;0;1",
        "aff_country_unique": "Canada;United States"
    },
    {
        "id": "895198",
        "title": "Development of a high-performance upper-body humanoid system",
        "track": "main",
        "status": "Poster",
        "abstract": "Presents the hardware of the upper body of the ETL-Humanoid system. It has 24 degrees of freedom with high performance actuators, which gives the system high mobility, such as is required for pushups, lifting itself or another person. The mechanical design is able to achieve human proportions, with smooth outer shape, and is light weight at a very high level, considering the high motor performance embedded inside. Custom compact electronics for AC servo control and fast embedded network for control and measurement was also developed. The system is still evolving, being used as a working testbed for versatile human interaction experiments.",
        "primary_area": "",
        "author": "A. Nagakubo;Y. Kuniyoshi;G. Cheng;A. Nagakubo;Y. Kuniyoshi;G. Cheng",
        "authorids": "/37295667600;/37299294900;/37276253300;/37295667600;/37299294900;/37276253300",
        "aff": "Humanoid Interaction Laboratory Intelligent Systems Division, Electro Technical Laboratory, Tsukuba, Ibaraki, Japan; Humanoid Interaction Laboratory Intelligent Systems Division, Electro Technical Laboratory, Tsukuba, Ibaraki, Japan; Humanoid Interaction Laboratory Intelligent Systems Division, Electro Technical Laboratory, Tsukuba, Ibaraki, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895198/",
        "gs_citation": 19,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13347202401881724569&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Electro Technical Laboratory",
        "aff_unique_dep": "Humanoid Interaction Laboratory Intelligent Systems Division",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Tsukuba",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895196",
        "title": "Development of a light-weight biped humanoid robot",
        "track": "main",
        "status": "Poster",
        "abstract": "In order to meet the demand of a research platform for intelligent robotics, a humanoid robot named Saika-3 has been developed. It is a self-sustaining biped robot with dual arms and a robotic head. It is equipped with a PC (IBM PC/AT clone), batteries, a wireless ethernet modem, a gyroscope and motor drivers inside its body. Saika-3 can be teleoperated via wireless' ethernet communication. A graphic dynamic simulator is also developed to study control strategy. The paper presents an outline of the hardware of Saika-3 and a simulation result.",
        "primary_area": "",
        "author": "A. Konno;N. Kato;S. Shirata;T. Furuta;M. Uchiyama;A. Konno;N. Kato;S. Shirata;T. Furuta;M. Uchiyama",
        "authorids": "/37323849300;/37087784713;/37929431600;/37088206590;/37281517000;/37323849300;/37087784713;/37929431600;/37088206590;/37281517000",
        "aff": "Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan; Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan; Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan; Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan; Department of Aeronautics and Space Engineering, University of Tohoku, Sendai, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895196/",
        "gs_citation": 68,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13033821124276665659&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "University of Tohoku",
        "aff_unique_dep": "Department of Aeronautics and Space Engineering",
        "aff_unique_url": "https://www.tohoku.ac.jp",
        "aff_unique_abbr": "Tohoku U",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Sendai",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895226",
        "title": "Development of a talking robot",
        "track": "main",
        "status": "Poster",
        "abstract": "The vocal movement isn't only a movement of the vocal organs. It is also a movement that produces acoustic signals received by hearing as linguistic information through hydroacoustic phenomena along with the formation of the vocal way. The purpose of this research is to make clear human vocal mechanism from the view of engineering by reproducing the vocal movement using a robot, and to make the dynamic model. Therefore, the authors developed an anthropomorphic talking robot, WT-1 (Waseda Talker-No.1). It simulates human voice movement, and has articulators (the 4-DOF lips, 1-DOF teeth, 6-DOF tongue, nasal cavity and 1-DOF soft palate) and the vocal organs (the 1-DOF vocal cords, 1-DOF lungs); Total DOF of the robot is 14.",
        "primary_area": "",
        "author": "K. Nishikawa;K. Asama;K. Hayashi;H. Takanobu;A. Takanishi;K. Nishikawa;K. Asama;K. Hayashi;H. Takanobu;A. Takanishi",
        "authorids": "/37280723900;/37725005400;/37277905800;/37280786900;/37280756700;/37280723900;/37725005400;/37277905800;/37280786900;/37280756700",
        "aff": "Department of Mechanical Engineering, Waseda University, Shinjuku, Tokyo, Japan; Department of Mechanical Engineering, Waseda University, Shinjuku, Tokyo, Japan; Department of Mechanical Engineering, Waseda University, Shinjuku, Tokyo, Japan; Department of Mechanical Engineering, Waseda University, Shinjuku, Tokyo, Japan; Department of Mechanical Engineering, Waseda University, Shinjuku, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895226/",
        "gs_citation": 25,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2934718524303327911&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Waseda University",
        "aff_unique_dep": "Department of Mechanical Engineering",
        "aff_unique_url": "https://www.waseda.jp/top",
        "aff_unique_abbr": "Waseda",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Shinjuku, Tokyo",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895266",
        "title": "Development of multi-limb robot with omnidirectional manipulability and mobility",
        "track": "main",
        "status": "Poster",
        "abstract": "In order to develop a high performance working robot, we design and develop a new robot based on the concept of \"limb mechanism \" for integration of legged locomotion and arm manipulation. The robot developed has six limbs which can be used for both locomotion and manipulation. The six limbs are set on vertices of regular hexagonal body so that this robot can have omnidirectional manipulability and mobility. We evaluate the stroke and the stability margin in all walking directions on six-legged and four-legged locomotion. As a result, this robot has higher omnidirectional mobility than conventional mechanisms.",
        "primary_area": "",
        "author": "Y. Takahashi;T. Arai;Y. Mae;K. Inoue;N. Koyachi;Y. Takahashi;T. Arai;Y. Mae;K. Inoue;N. Koyachi",
        "authorids": "/37277164500;/37281360800;/37281355800;/37281357300;/37355496200;/37277164500;/37281360800;/37281355800;/37281357300;/37355496200",
        "aff": "Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Robotics, Mechanical Engineering Laboratory, Tsukuba, Ibaraki, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895266/",
        "gs_citation": 55,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14827813518472212786&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;1",
        "aff_unique_norm": "Osaka University;Mechanical Engineering Laboratory",
        "aff_unique_dep": "Department of Systems and Human Science Graduate School of Engineering Science;Department of Robotics",
        "aff_unique_url": "https://www.osaka-u.ac.jp;",
        "aff_unique_abbr": "Osaka U;",
        "aff_campus_unique_index": "0;0;0;0;1",
        "aff_campus_unique": "Toyonaka;Tsukuba",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895241",
        "title": "Docking to pallets with feedback from a sheet-of-light range camera",
        "track": "main",
        "status": "Poster",
        "abstract": "The problem studied is feedback for docking a mobile robot or AGV, to a pallet. The pallet is of known size but with an essentially unknown load. The pallet has an initial uncertainty in pose (position and orientation) of the order /spl plusmn/15 cm and /spl plusmn/20 degrees. The docking error is required to be within /spl plusmn/1 cm and /spl plusmn/1 degree with \"very low\" failure rate. For the docking a combination of a range camera and a video camera is used. In the paper the range camera is emphasized. Experimental results from this work in progress are presented. Successful docking has been made with typical /spl plusmn/5 mm as errors. Currently one weak part is the integration with the control system on board the robot. Our persistent experience from this and earlier tests is that the weak part when using non-contact sensing for feedback in robots is the association problem. It should be mentioned that the resolution of a range camera is strongly distance dependent. One finding in the paper is that this type of docking is feasible and can be made self-monitoring.",
        "primary_area": "",
        "author": "J. Nygards;T. Hogstrom;A. Wernersson;J. Nygards;T. Hogstrom;A. Wernersson",
        "authorids": "/37346733500;/38244711100;/37266112900;/37346733500;/38244711100;/37266112900",
        "aff": "Robotics Linköping University, Linkoping, Sweden; Robotics Linköping University, Linkoping, Sweden; Robotics Lulea University of Technology, Lulea, Sweden",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895241/",
        "gs_citation": 30,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9025092574555371034&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Linköping University;Lulea University of Technology",
        "aff_unique_dep": "Robotics;Robotics",
        "aff_unique_url": "https://www.liu.se;https://www.ltu.se",
        "aff_unique_abbr": "LiU;LTU",
        "aff_campus_unique_index": "0;0;1",
        "aff_campus_unique": "Linköping;Lulea",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Sweden"
    },
    {
        "id": "895293",
        "title": "Dynamic rolling, locomotion planning, and control of an icosahedral modular robot",
        "track": "main",
        "status": "Poster",
        "abstract": "In a recent study of modular robots (2000), the authors demonstrated the feasibility of dynamic rolling motions as a novel means of locomotion. In such a system the capability of large shape change is used to induce tipping and rolling behaviors of the robot itself. However, the dynamics of the tipping motion and the contact forces that occur on impact with the ground are complex. In this paper, a two-phase planning and switching control sequence is introduced to achieve stable and reliable motion of an icosahedral Tetrobot modular robot. Simulation of the resulting rolling motions suggests that speed and direction of the rolling can be controlled, and both sustained uphill and downhill rolling motions are feasible.",
        "primary_area": "",
        "author": "W.H. Lee;A.C. Sanderson;W.H. Lee;A.C. Sanderson",
        "authorids": "/37089088745;/37283733100;/37089088745;/37283733100",
        "aff": "Department of Mechanical Engineering Aeronautical Engineering, and Mechanics, Rensselaer Polytechnic Institute, Troy, NY, USA; Department of Electrical, Computer and Systems Engineering, Rensselaer Polytechnic Institute, Troy, NY, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895293/",
        "gs_citation": 22,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3487243434770437638&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Rensselaer Polytechnic Institute",
        "aff_unique_dep": "Department of Mechanical Engineering Aeronautical Engineering, and Mechanics",
        "aff_unique_url": "https://www.rpi.edu",
        "aff_unique_abbr": "RPI",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Troy",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895248",
        "title": "Dynamic workspace analysis and motion planning for a micro biped walking robot",
        "track": "main",
        "status": "Poster",
        "abstract": "The dynamic workspace and the motion plans for a micro biped walking robot are studied in the paper. The dynamic model and controller of an under-actuated walking robot system are developed. Two optimal navigation algorithms for the motion of the robot in the same plane without obstacles are developed, and optimality is proved. The motion of the robot is divided into normal motion status and transition status. The complete scheme to perform the two status and this real time implementation are presented. The dynamic simulation results and 2D-rendering of the robot navigation is given.",
        "primary_area": "",
        "author": "Meng Yue;Ning Xi;M. Minor;R. Mukherjee;Meng Yue;Ning Xi;M. Minor;R. Mukherjee",
        "authorids": "/37087215957;/37087151867;/37279831800;/37279356800;/37087215957;/37087151867;/37279831800;/37279356800",
        "aff": "Electrical and Computer Engineering Department, Michigan State University, East Lansing, MI, USA; Electrical and Computer Engineering Department, Michigan State University, East Lansing, MI, USA; Department of Mechanical Engineering, Michigan State University, East Lansing, MI, USA; Department of Mechanical Engineering, Michigan State University, East Lansing, MI, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895248/",
        "gs_citation": 9,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8442166022264553548&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Michigan State University",
        "aff_unique_dep": "Electrical and Computer Engineering Department",
        "aff_unique_url": "https://www.msu.edu",
        "aff_unique_abbr": "MSU",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "East Lansing",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895232",
        "title": "Evolving co-operative homogeneous multi-robot teams",
        "track": "main",
        "status": "Poster",
        "abstract": "The application of artificial evolution to the design of co-operative homogeneous multi-robot teams encounters the basic yet important issue of how such teams are to be generated. One approach is to evaluate teams comprising identical copies of a single evolutionary individual. The alternative is to use a separate evolutionary individual to specify each member of a team. Intuitively the former seems better suited, and it has been widely applied to the evolution of many kinds of homogeneous system. However, so little consideration has been given to the latter approach that, despite its apparent unsuitability, there is insufficient empirical evidence on which to discount it. This paper reports on a comparison of the two approaches over multiple runs in the context of a non-trivial cooperative task carried out by simulated mobile robots controlled by arbitrarily recurrent neural networks. It was found that, contrary to expectations, the latter approach performed significantly better than the former.",
        "primary_area": "",
        "author": "M. Quinn;M. Quinn",
        "authorids": "/37337519100;/37337519100",
        "aff": "Centre for Computational Neuroscience and Robotics, University of Sussex, Brighton, UK",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895232/",
        "gs_citation": 34,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5473786738172484287&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 2,
        "aff_unique_index": "0",
        "aff_unique_norm": "University of Sussex",
        "aff_unique_dep": "Centre for Computational Neuroscience and Robotics",
        "aff_unique_url": "https://www.sussex.ac.uk",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Brighton",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United Kingdom"
    },
    {
        "id": "895305",
        "title": "Expertness measuring in cooperative learning",
        "track": "main",
        "status": "Poster",
        "abstract": "Cooperative learning in a multi-agent system can improve the learning quality and learning speed. The improvement can be gained if each agent detects the expert agents and uses their knowledge properly. In the paper, a cooperative learning method, called weighted strategy sharing (WSS) is introduced. Also some criteria are introduced to measure the expertness of agents. In WSS, based on the amount of its team-mate expertness, each agent assigns a weight to their knowledge. These weights are used in sharing knowledge among agents in our system. WSS and the expertness criteria are tested on two simulated hunter-prey problems and on object pushing systems.",
        "primary_area": "",
        "author": "M.N. Ahmadabadi;M. Asadpur;S.H. Khodanbakhsh;E. Nakano;M.N. Ahmadabadi;M. Asadpur;S.H. Khodanbakhsh;E. Nakano",
        "authorids": "/37293861300;/37087550071;/37086985180;/37385914400;/37293861300;/37087550071;/37086985180;/37385914400",
        "aff": "Robotics Laboratory, Faculty of Engineering, University of Tehran, Iran; Robotics Laboratory, Faculty of Engineering, University of Tehran, Iran; S.H. Khodanbakhsh; Advanced Robotics Laboratory, GSIS, University of Tohoku, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895305/",
        "gs_citation": 25,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12506886197680733056&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;2",
        "aff_unique_norm": "University of Tehran;;University of Tohoku",
        "aff_unique_dep": "Faculty of Engineering;;Advanced Robotics Laboratory, GSIS",
        "aff_unique_url": "https://www.ut.ac.ir;;https://www.tohoku.ac.jp",
        "aff_unique_abbr": ";;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;2",
        "aff_country_unique": "Iran;;Japan"
    },
    {
        "id": "895274",
        "title": "Fast and inexpensive color image segmentation for interactive robots",
        "track": "main",
        "status": "Poster",
        "abstract": "Vision systems employing region segmentation by color are crucial in real-time mobile robot applications. With careful attention to algorithm efficiency, fast color image segmentation can be accomplished using commodity image capture and CPU hardware. This paper describes a system capable of tracking several hundred regions of up to 32 colors at 30 Hz on general purpose commodity hardware. The software system consists of: a novel implementation of a threshold classifier, a merging system to form regions through connected components, a separation and sorting system that gathers various region features, and a top down merging heuristic to approximate perceptual grouping. A key to the efficiency of our approach is a new method for accomplishing color space thresholding that enables a pixel to be classified into one or more, up to 32 colors, using only two logical AND operations. The algorithms and representations are described, as well as descriptions of three applications in which it has been used.",
        "primary_area": "",
        "author": "J. Bruce;T. Balch;M. Veloso;J. Bruce;T. Balch;M. Veloso",
        "authorids": "/37327505200;/37277553900;/37274032100;/37327505200;/37277553900;/37274032100",
        "aff": "School of Computer Science, Carnegie Mellon University, Pittsburgh, PA, USA; School of Computer Science, Carnegie Mellon University, Pittsburgh, PA, USA; School of Computer Science, Carnegie Mellon University, Pittsburgh, PA, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895274/",
        "gs_citation": 884,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7810117192843951776&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 16,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "School of Computer Science",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Pittsburgh",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895202",
        "title": "Fast convex minimization to detect collisions between polyhedra",
        "track": "main",
        "status": "Poster",
        "abstract": "The subject of the paper is a fast algorithm for detecting collisions of two convex polyhedra translating in space. A major feature is the novelty of the approach: collision detection for two convex bodies is reduced to collision detection for pairs of planar sections and minimization of a bivariate convex function; furthermore, most of the subproblems are solved using two-dimensional geometry. As proved by previous theoretical work, on this basis it is possible to design an algorithm, which runs in O(log/sup 2/n) time in the average and O(log/sup 3/n) in the worst case, where n is the total number of vertices. Here the focus is on a more practical version of the algorithm, which is particularly suited to plan collision-free paths on the basis of fine-grain descriptions of the objects in the workspace, as it is the case for the systems supported by sophisticated geometric modelers. After explaining the main ideas underlying the approach, a set of experimental results are presented and discussed in some depth.",
        "primary_area": "",
        "author": "C. Mirolo;E. Pagello;C. Mirolo;E. Pagello",
        "authorids": "/37354371000;/37317887500;/37354371000;/37317887500",
        "aff": "Dip. di Matematica e lnformatica, University di Udine, Udine, Italy; Dip. di Elettronica e Informatica, University di Padova and Ist. Ladseb C. N. R. di Padova, Padova, Italy",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895202/",
        "gs_citation": 7,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2301064284591002671&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "University of Udine;University of Padova",
        "aff_unique_dep": "Department of Mathematics and Computer Science;Department of Electronics and Information Engineering",
        "aff_unique_url": "https://www.uniud.it;https://www.unipd.it",
        "aff_unique_abbr": ";Unipd",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Udine;Padova",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Italy"
    },
    {
        "id": "895310",
        "title": "Flexible hand-eye calibration for multi-camera systems",
        "track": "main",
        "status": "Poster",
        "abstract": "Calibration of coordinate systems between cameras and robots, i.e. hand-eye-calibration, is of key importance in sensor based robotics. We present a method which is based on using a very simple, conic calibration object, and results in fast and simple calculations. It originates from the pose estimation algorithms and contributes to earlier methods robustness for the location of the calibration object and simplicity from the point of view of image processing. Our method is also based on the Bayesian model, thus it also provides estimates for the spatial uncertainties, in the form of covariances of the pose parameters. The algorithm has been tested by simulations and practical experiments.",
        "primary_area": "",
        "author": "T. Heikkila;M. Sallinen;T. Matsushita;F. Tomita;T. Heikkila;M. Sallinen;T. Matsushita;F. Tomita",
        "authorids": "/37325597800;/37328609900;/37358544200;/37372443800;/37325597800;/37328609900;/37358544200;/37372443800",
        "aff": "VTT Automation, Oulu, Finland; VTT Automation, Oulu, Finland; Electro Technical Laboratory, Tsukuba, Japan; Electro Technical Laboratory, Tsukuba, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895310/",
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18420482530973471992&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;1",
        "aff_unique_norm": "VTT Automation;Electro Technical Laboratory",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "0;0;1;1",
        "aff_campus_unique": "Oulu;Tsukuba",
        "aff_country_unique_index": "0;0;1;1",
        "aff_country_unique": "Finland;Japan"
    },
    {
        "id": "895208",
        "title": "Force tracking in multiple impedance control of space free-flyers",
        "track": "main",
        "status": "Poster",
        "abstract": "The new algorithm of multiple impedance control (MIC) which enforces designated impedance on both a manipulated object, and all cooperating manipulators is applied to a space robotic system in which robotic arms, mounted on a free-flying-base, manipulate an object. A vigorous stability analysis of the MIC algorithm based on Lyapunov direct method, besides error analysis, show that the MIC law guarantees good tracking of cooperative manipulators and the object, in performing a manipulation task. Also, a force tracking strategy inspired by human control system is added to the MIC algorithm and the general formulation is revised to fulfil a desired force tracking task after impact. A system of three manipulators mounted on a space free-flyer is simulated, and the results show that, even in the occurrence of an impact due to collision with an obstacle, the response of the MIC algorithm is smooth. Also, relying on the new modification of the algorithm, the contact force follows successfully a desired tracking trajectory.",
        "primary_area": "",
        "author": "S.A.A. Moosavian;R. Rastegari;S.A.A. Moosavian;R. Rastegari",
        "authorids": "/37698088200;/38556219000;/37698088200;/38556219000",
        "aff": "Department of Mechanical Engineer, K.N. Toosi University of Technology, Tehran, Iran; Department of Mechanical Engineer, K.N. Toosi University of Technology, Tehran, Iran",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895208/",
        "gs_citation": 25,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13710074773698794856&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "K.N. Toosi University of Technology",
        "aff_unique_dep": "Department of Mechanical Engineer",
        "aff_unique_url": "https://www.kntu.ac.ir",
        "aff_unique_abbr": "KNTU",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tehran",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Iran"
    },
    {
        "id": "895212",
        "title": "Fundamental mechanism of dinosaur-like robot TITRUS-II utilizing coupled drive",
        "track": "main",
        "status": "Poster",
        "abstract": "The mechanism design and the fundamental concepts of the dinosaur-like robot called TITRUS-II are reported. It is based on practical concepts so that it can be applied in the real world. The design features include: 1) realizing high dynamic stability by using a neck and a tail as an active damper when the robot walks; 2) standing with the tail to compose a stable supporting triangle so that the robot can work stably; and 3) enabling it to do various tasks by applying a manipulator as a neck. The mechanism of the legs is also distinctive, using a coupled drive to compose four degrees of freedom.",
        "primary_area": "",
        "author": "K. Takita;R. Hodoshima;S. Hirose;K. Takita;R. Hodoshima;S. Hirose",
        "authorids": "/37286070500;/37320222900;/37273278900;/37286070500;/37320222900;/37273278900",
        "aff": "Tokyo Institute of Technology, Meguro, Tokyo, Japan; Tokyo Institute of Technology, Meguro, Tokyo, Japan; Tokyo Institute of Technology, Meguro, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895212/",
        "gs_citation": 32,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12441827750556324058&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Meguro",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895250",
        "title": "Fuzzy behavior-based motion planning for the PUMA robot",
        "track": "main",
        "status": "Poster",
        "abstract": "A fuzzy behavior-based system, which act as a planning system, is realized for the task control of a six-degree of freedom PUMA robot manipulator. A fuzzy behavior control system that was applied to a three-link manipulator by Dassanayake et al. (1999) is modified as a planning system for the PUMA robot. Fuzzy behavior elements are trained by a genetic algorithm. This has been conducted for three behavior groups namely objective behavior group, free behavior group and reactive behavior group. Simulation has been carried out for the PUMA robot to reach a target from a given point while avoiding an obstacle. Result shows that the fuzzy behavior based approach can be applied to plan the manipulator's joint angles and angular velocities to reach a particular point while avoiding obstacles.",
        "primary_area": "",
        "author": "P. Dassanayake;K. Watanabe;K. Kiguchi;K. Izumi;P. Dassanayake;K. Watanabe;K. Kiguchi;K. Izumi",
        "authorids": "/37437478100;/37280393800;/37279644500;/37279642000;/37437478100;/37280393800;/37279644500;/37279642000",
        "aff": "Graduate School of Science and Engineering, Saga University, Japan; Saga Daigaku, Saga, JP; K. Kiguchi; K. Izumi",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895250/",
        "gs_citation": 8,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3802885945599933556&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Saga University;",
        "aff_unique_dep": "Graduate School of Science and Engineering;",
        "aff_unique_url": "https://www.saga-u.ac.jp;",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Saga",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan;"
    },
    {
        "id": "895255",
        "title": "Graphical simulation and high-level control of humanoid robots",
        "track": "main",
        "status": "Poster",
        "abstract": "Physically-based simulation software is commonly used for developing and testing low-level robot control algorithms. In order to facilitate the development and evaluation of higher-level robot behaviors, broader-based simulations are needed. Examples include software for simulating 3D vision, motion planning for obstacle avoidance, and integrating vision and planning. In addition to modeling the general interaction between the robot and its environment, the software can be used as a graphical user interface for directly controlling or interacting with a robot operating in the real world. This paper describes our current efforts toward building a large-scale software simulation framework for the development and testing of high-level behaviors for humanoid robots. We view this as a potential useful tool for the visualization and development of robotic systems, as well as an interactive, task-level programming interface for robots.",
        "primary_area": "",
        "author": "J.J. Kuffner;S. Kagami;M. Inaba;H. Inoue;J.J. Kuffner;S. Kagami;M. Inaba;H. Inoue",
        "authorids": "/37280115900;/37273845800;/37286658200;/37280631000;/37280115900;/37273845800;/37286658200;/37280631000",
        "aff": "Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895255/",
        "gs_citation": 32,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4566957668692676907&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "University of Tokyo",
        "aff_unique_dep": "Department of Mechano-Informatics",
        "aff_unique_url": "https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "UTokyo",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Bunkyo",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895240",
        "title": "Ground experiment system for dual-manipulator-based capture of damaged satellites",
        "track": "main",
        "status": "Poster",
        "abstract": "A robot satellite with dual-manipulators is one of the choices to capture damaged satellites in orbit. We have constructed a ground experiment simulator system including two 7-degree-of-freedom (DOF) manipulators as a chaser satellite model and floating testbeds on a flat floor as target satellite models. This system is a tele-operation ground experiment system and consists of the following subsystems: the robot system, vision system, manipulator operating system, ground control system and damage satellite model system. Using this system, we will study feasible capturing and berthing methods of damaged satellites using dual-manipulators. In the paper we explain the detailed description of the system and report the results of fundamental capture experiments.",
        "primary_area": "",
        "author": "S. Matunaga;K. Yoshihara;T. Takahashi;S. Tsurumi;K. Ui;S. Matunaga;K. Yoshihara;T. Takahashi;S. Tsurumi;K. Ui",
        "authorids": "/37443331100;/37270308700;/38023841200;/38017288400;/38016114100;/37443331100;/37270308700;/38023841200;/38017288400;/38016114100",
        "aff": "Mechanical-Aerospace Engineering, Tokyo Institute of Technology, Okayama, Tokyo, Japan; Mechanical-Aerospace Engineering, Tokyo Institute of Technology, Okayama, Tokyo, Japan; Mechanical-Aerospace Engineering, Tokyo Institute of Technology, Okayama, Tokyo, Japan; Mechanical-Aerospace Engineering, Tokyo Institute of Technology, Okayama, Tokyo, Japan; Mechanical-Aerospace Engineering, Tokyo Institute of Technology, Okayama, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895240/",
        "gs_citation": 37,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3368174904509133296&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Mechanical-Aerospace Engineering",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Tokyo",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895303",
        "title": "Grounded representations for a robots team",
        "track": "main",
        "status": "Poster",
        "abstract": "Realistic applications of autonomous robotics face a lot of difficulties in real environments. To navigate, self-localize and cooperate in such contexts, a multi-robot system has to find a way to represent and share knowledge about the world it is living in. We discuss the necessity and the advantages of grounding representations and communications of a robot team in real perceptions. We describe a technical framework designed for this purpose, which is based on the classification of the perceptions of a robot population. Percepts must have specific properties to enable grounding, and we present particular percepts well suited to this process. Finally we discuss the possible usages of grounded classes and propose a grid representation for fusion and exchange.",
        "primary_area": "",
        "author": "L. Hughes;L. Hughes",
        "authorids": "/37088239955;/37088239955",
        "aff": "Univ. Pierre et Marie Curie, Paris, France",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895303/",
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15914123806051132603&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 2,
        "aff_unique_index": "0",
        "aff_unique_norm": "Pierre et Marie Curie University",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.upmc.fr",
        "aff_unique_abbr": "UPMC",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Paris",
        "aff_country_unique_index": "0",
        "aff_country_unique": "France"
    },
    {
        "id": "895297",
        "title": "Hardware design of modular robotic system",
        "track": "main",
        "status": "Poster",
        "abstract": "In this paper we describe the hardware design of a novel self-reconfigurable robotic system. We have classified previous studies on self-reconfigurable robotic systems into \"lattice type\" composed of spatially symmetric modules and \"string type\" like snake robots. The proposed system has both the advantages of simple operation of self-reconfiguration of the former and motion generation ability of the latter. Its simple structure and reliable operation allows us to construct large 3D self-reconfigurable structure which functions as a robotic system such as a legged walking machine. We have examined its basic mechanical functions and verified its reliable operation of self-reconfiguration.",
        "primary_area": "",
        "author": "S. Murata;E. Yoshida;K. Tomita;H. Kurokawa;A. Kamimura;S. Kokaji;S. Murata;E. Yoshida;K. Tomita;H. Kurokawa;A. Kamimura;S. Kokaji",
        "authorids": "/37273152900;/37286468100;/37323543400;/37286960000;/37427752900;/37427753700;/37273152900;/37286468100;/37323543400;/37286960000;/37427752900;/37427753700",
        "aff": "Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Japan; Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Japan; Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Japan; Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Japan; Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Japan; Mechanical Engineering Laboratory, Agency of Industrial Science and Technology, Tsukuba, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895297/",
        "gs_citation": 208,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5399185854065196453&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 12,
        "aff_unique_index": "0;0;0;0;0;0",
        "aff_unique_norm": "Agency of Industrial Science and Technology",
        "aff_unique_dep": "Mechanical Engineering Laboratory",
        "aff_unique_url": "https://www.aist.go.jp",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "0;0;0;0;0;0",
        "aff_campus_unique": "Tsukuba",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895200",
        "title": "Hardware-in-loop simulation of robots interacting with environment via algebraic differential equation",
        "track": "main",
        "status": "Poster",
        "abstract": "Hardware-in-the-loop simulation is an attractive tool to validate the functionality of space robots. It is the purpose of the hardware-in-the-loop simulation to make a rigid robot prototype behave, in contact/noncontact phases, as closely as possible to a given robot reference model that would be encountered in the real-world. We introduce a method for the hardware-in-the-loop simulation that is based on the projection of the generalized coordinates of the robot model into two subspaces representing independent and dependent coordinates. The independent coordinate is obtained via simulation by making use of its acceleration model expressed in a closed form. While, the dependent coordinate is obtained from the generalized coordinated of the linearized robot prototype acting as a double integrator on the input dependent-coordinate acceleration. It is followed by investigating the effect of external disturbance on the performance of the hardware-in-the-loop simulation, by the method of Lagrangian multiplier. Finally experimental results obtained from implementation of a single axis arm is presented.",
        "primary_area": "",
        "author": "F. Aghili;J.-C. Piedboeuf;F. Aghili;J.-C. Piedboeuf",
        "authorids": "/37282166400;/37328655300;/37282166400;/37328655300",
        "aff": "Canadian Space Agency, Saint-Hubert, Canada; Canadian Space Agency, Saint-Hubert, Canada",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895200/",
        "gs_citation": 26,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3087958384681268667&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Canadian Space Agency",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.asc-csa.gc.ca",
        "aff_unique_abbr": "CSA",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Saint-Hubert",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Canada"
    },
    {
        "id": "895273",
        "title": "Hierarchical part decomposition method of articulated body contour, and its application to human body motion measurement",
        "track": "main",
        "status": "Poster",
        "abstract": "Segmentation of an articulated object is one of the fundamental techniques of computer vision, and it can be applied to human body structure analysis and motion measurement. In this report, we propose a method that generates the contour model of each link element of an articulated object by using the hierarchical part decomposition (HPD) method of body contour. The HPD can divide the body region into characteristic elements without any model of link parameters or shape based on the distribution of high-curvature points of the object's contour in the video sequence. Although the HPD only works under the restricted situation, the proposed method can also handle more general body motion by using the shape model of human body generated from the decomposed result. Experiment results of measuring the kip motion under real environment show that the proposed method can divide the body into characteristic elements and obtain postures of the body from the video sequence.",
        "primary_area": "",
        "author": "K. Koara;A. Nishikawa;F. Miyazaki;K. Koara;A. Nishikawa;F. Miyazaki",
        "authorids": "/37724729700;/37357105100;/37283015200;/37724729700;/37357105100;/37283015200",
        "aff": "Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895273/",
        "gs_citation": 10,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2083795495048043219&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Osaka University",
        "aff_unique_dep": "Graduate School of Engineering Science",
        "aff_unique_url": "https://www.osaka-u.ac.jp",
        "aff_unique_abbr": "Osaka U",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Toyonaka",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895316",
        "title": "High-level control of a mobile manipulator for door opening",
        "track": "main",
        "status": "Poster",
        "abstract": "In this paper, off-the-shelf algorithms for force/torque control are used in the context of mobile manipulation, in particular, the task of opening a door is studied. To make the solution robust, as few assumptions as possible are made. By using relaxation of forces as the basic level of control more complex information can be derived from the resulting motion. In our system, the radius and centre of rotation of the door are estimated online. This enables the complete system to have a higher degree of autonomy in an unknown environment. In addition, the redundancy of the robot is exploited in such a way to drive the system towards a desired configuration. The framework of hybrid dynamic systems is used to implement the algorithm which gives a theoretically sound framework for analysing the system with respect to safety and functionality. The integration of the above approaches results in a system which can robustly locate and grasp the handle and then open the door.",
        "primary_area": "",
        "author": "L. Peterson;D. Austin;D. Kragic;L. Peterson;D. Austin;D. Kragic",
        "authorids": "/37086985126;/37283045900;/37281296000;/37086985126;/37283045900;/37281296000",
        "aff": "Centre for Autonomous Syst., R. Inst. of Technol., Stockholm, Sweden; Centre for Autonomous Systems, Royal Institute of Technology, Stockholm, Sweden; Centre for Autonomous Systems, Royal Institute of Technology, Stockholm, Sweden",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895316/",
        "gs_citation": 160,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13530300552487891114&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Royal Institute of Technology",
        "aff_unique_dep": "Centre for Autonomous Systems",
        "aff_unique_url": "https://www.kth.se",
        "aff_unique_abbr": "KTH",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Stockholm",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Sweden"
    },
    {
        "id": "895216",
        "title": "Image-based positioning with respect to a non-structured scene using 2D image motion",
        "track": "main",
        "status": "Poster",
        "abstract": "Visual servoing based upon geometrical features such as image points coordinates is now well set on. Nevertheless, this approach has the drawback that it usually needs visual marks on the observed object to retrieve geometric features. The idea developed here is that these features can be retrieved by integrating dynamic ones, which can be estimated without any a priori knowledge of the scene. Thus, more realistic scenes can be used to achieve vision-based control such as positioning tasks. We show that an affine model is insufficient to ensure convergence and that a quadratic one is needed. Finally, results are presented related to the positioning with respect to a complex scene.",
        "primary_area": "",
        "author": "A. Cretual;F. Chaumette;G. Sandini;A. Cretual;F. Chaumette;G. Sandini",
        "authorids": "/37089124839;/37265186700;/37295479800;/37089124839;/37265186700;/37295479800",
        "aff": "LIRA-Laboratory, Università di Genova, Genoa, Italy; IRISA/INRIA, Rennes, France; LIRA-Laboratory, Università di Genova, Genoa, Italy",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895216/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7692894199594013332&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "Università di Genova;INRIA",
        "aff_unique_dep": "LIRA-Laboratory;IRISA",
        "aff_unique_url": "https://www.unige.it;https://www.inria.fr",
        "aff_unique_abbr": ";INRIA",
        "aff_campus_unique_index": "0;1;0",
        "aff_campus_unique": "Genoa;Rennes",
        "aff_country_unique_index": "0;1;0",
        "aff_country_unique": "Italy;France"
    },
    {
        "id": "895306",
        "title": "Improved information sharing method for multiple autonomous mobile robot systems using one to one bidirectional proximity communication",
        "track": "main",
        "status": "Poster",
        "abstract": "An essential task for a multiple autonomous mobile robot system is to search for and to gather objects. To accomplish such a task effectively, it is essential that all the agents share common information on locations of objects, comrade agents and the place to deposit the objects. The authors have proposed a method called \"COMPASS\" to realize this only using two functions of each agent-to estimate the location of the objects by dead reckoning and to exchange the information with each other by one to one bidirectional proximity communication. In the paper, a new concept \"figure of confidence (FOC)\" is introduced to the COMPASS for higher performance and additional capability. The FOC is a self-estimated measure for accuracy of information in each agent. Using the FOC, agents can accelerate information sharing and handle multiple objects without significantly increasing complexity of the algorithm. The validity of FOC is confirmed through computer simulations.",
        "primary_area": "",
        "author": "H. Kobayashi;Y. Matsuo;H. Kobayashi;Y. Matsuo",
        "authorids": "/37292103000;/37347120300;/37292103000;/37347120300",
        "aff": "Tokyo Kogyo Daigaku, Meguro-ku, Tokyo, JP; Y. Matsuo",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895306/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17434887817996364102&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0",
        "aff_unique_norm": "Tokyo Kogyo Daigaku;",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Tokyo;",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Japan;"
    },
    {
        "id": "895209",
        "title": "In-pipe inspection robot system with active steering mechanism",
        "track": "main",
        "status": "Poster",
        "abstract": "We present a robot system for in-pipe inspection of underground urban gas pipelines. The robot is configured as an articulated structure like a snake with a tether cable. Two active driving vehicles are located in front and rear of the system, and passive modules such as a control module are chained between the active vehicles. The proposed robot has outstanding mobility offered by a new steering mechanism, called double active universal joint, which makes it possible to cope with complicated configurations of underground pipelines. Characteristic features of the system are described and the construction of the system is briefly outlined.",
        "primary_area": "",
        "author": "S.M. Ryew;S.H. Baik;S.W. Ryu;K.M. Jung;S.G. Roh;H.R. Choi;S.M. Ryew;S.H. Baik;S.W. Ryu;K.M. Jung;S.G. Roh;H.R. Choi",
        "authorids": "/38253700500;/38018941600;/38002542700;/38197318700;/37277412700;/37290854100;/38253700500;/38018941600;/38002542700;/38197318700;/37277412700;/37290854100",
        "aff": "School of Mechanical Engineering, Sungkyunkwan University, Suwon, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, South Korea; School of Mechanical Engineering, Sungkyunkwan University, Suwon, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895209/",
        "gs_citation": 99,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14920493210248018446&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 12,
        "aff_unique_index": "0;0;0;0;0;0",
        "aff_unique_norm": "Sungkyunkwan University",
        "aff_unique_dep": "School of Mechanical Engineering",
        "aff_unique_url": "http://www.skku.edu",
        "aff_unique_abbr": "SKKU",
        "aff_campus_unique_index": "0;0;0;0;0;0",
        "aff_campus_unique": "Suwon",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "South Korea"
    },
    {
        "id": "895223",
        "title": "Interactive hand/eye coordination between a human and a humanoid-a proposal",
        "track": "main",
        "status": "Poster",
        "abstract": "This research concerns the development of a binocular computer vision system for a robotic humanoid using interactive hand/eye coordination as a focus for skills teaching and capability demonstrations. The humanoid form aids natural transference of sophisticated human skills of perception, spatial reasoning, sensor guided manipulation and person-to-person communications (eye contact, body language, speech, touch etc.) to the robot and simultaneously stimulates considerations of human centred applications requiring such skills. This research builds on a humanoid project undertaken within the Intelligent Robotics Research Centre at Monash University and funded internally in 1999. At this early stage of the project much of the material presented in this paper is speculative and part of the planning for an extended piece of research over a number of years.",
        "primary_area": "",
        "author": "R. Jarvis;R. Jarvis",
        "authorids": "/37361772400;/37361772400",
        "aff": "Intelligent Robotics Research Centre, Monash University, VIC, Australia",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895223/",
        "gs_citation": 1,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5970915417436265524&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 2,
        "aff_unique_index": "0",
        "aff_unique_norm": "Monash University",
        "aff_unique_dep": "Intelligent Robotics Research Centre",
        "aff_unique_url": "https://www.monash.edu",
        "aff_unique_abbr": "Monash",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "VIC",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "895245",
        "title": "Investigation report of the rescue problem at Hanshin-Awaji earthquake in Kobe",
        "track": "main",
        "status": "Poster",
        "abstract": "The Great Hanshin-Awaji (Kobe) earthquake killed more than 6500 on January 17, 1995. Many people barely escaped from the debris and actively saved buried people. Rescue facilities are really important for robust social systems. Robotics and mechatronics are effective for advanced rescue equipment and systems. However, there has been little research and development performed until now. In order for robotics researchers to start, analysis of the tasks and requirements is necessary. In this research, the processes of rescue activities just after the disaster were investigated. Specifications of rescue robotic facilities are proposed on the basis of the analysis.",
        "primary_area": "",
        "author": "S. Tadokoro;T. Takamori;K. Osuka;S. Tsurutani;S. Tadokoro;T. Takamori;K. Osuka;S. Tsurutani",
        "authorids": "/37296054300;/37339206800;/37280720500;/37087333373;/37296054300;/37339206800;/37280720500;/37087333373",
        "aff": "Department of Computer and Systems Engineering, Kobe University, Nada, Japan; Department of Computer and Systems Engineering, Kobe University, Nada, Japan; Graduate School of Informatics, Kyoto University, Uji, Japan; Kobe Steel Company Limited, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895245/",
        "gs_citation": 41,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12530820126296895386&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;2",
        "aff_unique_norm": "Kobe University;Kyoto University;Kobe Steel Company Limited",
        "aff_unique_dep": "Department of Computer and Systems Engineering;Graduate School of Informatics;",
        "aff_unique_url": "https://www.kobe-u.ac.jp;https://www.kyoto-u.ac.jp;https://www.kobesteel.co.jp",
        "aff_unique_abbr": "Kobe U;Kyoto U;Kobe Steel",
        "aff_campus_unique_index": "0;0;1",
        "aff_campus_unique": "Nada;Uji;",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895233",
        "title": "Lateral control of a skid-steering mining vehicle",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper proposes a nonlinear feedback path controller for a skid-steering mining vehicle. The dynamic model of the vehicle is derived using the Boltzmann-Hamel formalism. The control design utilizes the computed torque type technique combined with an auxiliary continuous static state feedback, which involves error coordinates expressed in a moving reference frame partially linked to the vehicle. Assuming that the lateral friction forces caused by the skidding of the wheels are not exactly known, the last part of the paper is centered on the analysis of the effect of Coulomb friction on the behaviour of the system. Asymptotic stabilization of the equilibrium set is achieved for the closed-loop system with discontinuous right-hand side.",
        "primary_area": "",
        "author": "P. Petrov;J. de Lafontaine;P. Bigras;M. Tetreault;P. Petrov;J. de Lafontaine;P. Bigras;M. Tetreault",
        "authorids": "/38508831700;/37542923100;/37328259100;/37344382600;/38508831700;/37542923100;/37328259100;/37344382600",
        "aff": "Département de génie de la production automatisée, École de technologie supérieure, Montreal, Canada; Département de génie électrique, Université de Sherbrook, Sherbrooke, Canada; Département de génie de la production automatisée, École de technologie supérieure, Montreal, Canada; Département de génie de la production automatisée, École de technologie supérieure, Montreal, Canada",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895233/",
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10311209907505446178&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;1;0;0",
        "aff_unique_norm": "École de technologie supérieure;Université de Sherbrooke",
        "aff_unique_dep": "Département de génie de la production automatisée;Département de génie électrique",
        "aff_unique_url": "https://www.etsmtl.ca;https://www.usherbrooke.ca",
        "aff_unique_abbr": "ETS;UdeS",
        "aff_campus_unique_index": "0;1;0;0",
        "aff_campus_unique": "Montreal;Sherbrooke",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Canada"
    },
    {
        "id": "895242",
        "title": "Load balancing algorithm of parallel vision processing system for real-time navigation",
        "track": "main",
        "status": "Poster",
        "abstract": "We present a load balancing algorithm called perpendicular image partitioning (PIP) for parallel vision processing. Image partitioning plays two roles: load distribution and load balancing. Image partitioning is executed not simply by the number of pixels, but by the number of interested pixels, or features. The characteristics of load variance are analyzed, and the positions of two perpendicular (vertical, horizontal) lines are determined using these characteristics. The PIP algorithm offers fast load balancing, and enables efficient vision processing with well balanced load. We apply the PIP algorithm to real-time depth determination for mobile robot navigation with a sequence of images.",
        "primary_area": "",
        "author": "Young-Jip Kim;Byung-Kook Kim;Young-Jip Kim;Byung-Kook Kim",
        "authorids": "/37087334049;/37087151321;/37087334049;/37087151321",
        "aff": "Department of Electrical Engineering & Computer Science, Korea Advanced Institute of Science and Technology, Daejeon, South Korea; Department of Electrical Engineering & Computer Science, Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895242/",
        "gs_citation": 4,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1377373562797500829&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Korea Advanced Institute of Science and Technology",
        "aff_unique_dep": "Department of Electrical Engineering & Computer Science",
        "aff_unique_url": "https://www.kaist.ac.kr",
        "aff_unique_abbr": "KAIST",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Daejeon",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "South Korea"
    },
    {
        "id": "895301",
        "title": "Locomotion control of a snake-like robot based on dynamic manipulability",
        "track": "main",
        "status": "Poster",
        "abstract": "We discuss autonomous locomotion control of a snake-like articulated robot with passive wheels. Such a robot has a quite different mechanism in locomotion from that of other locomotion systems, namely, it has no driving wheel and moves only by bending its body. Hence the locomotability depends on its posture. In order to evaluate the locomotability, we utilize a notion of dynamic manipulability which has been applied to a robot manipulator. We also propose a simple controller based on this manipulability. Simulation results show that a certain periodic winding motion is automatically generated.",
        "primary_area": "",
        "author": "H. Date;Y. Hoshi;M. Sampei;H. Date;Y. Hoshi;M. Sampei",
        "authorids": "/37281926600;/37737413800;/37270726000;/37281926600;/37737413800;/37270726000",
        "aff": "Tokyo Institute of Technology, Meguro, Tokyo, Japan; Tokyo Institute of Technology, Meguro, Tokyo, Japan; Tokyo Institute of Technology, Meguro, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895301/",
        "gs_citation": 103,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17723093235172840363&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Meguro",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895296",
        "title": "Mechanical design of a module for reconfigurable robots",
        "track": "main",
        "status": "Poster",
        "abstract": "The goal of the Conro project is to build deployable self-reconfigurable robots, i.e., small homogeneous modular robots that can be reconfigured into different shapes such as snakes or hexapods. In this paper we describe the mechanical design of the first generation of Conro modules: the philosophy of their design, their parts and functionality and derive two inequalities that relate the design parameters of a module. Each module is fully self-contained in every sense; it carries its own CPU, power supply, and actuators. The modules were designed to work in groups, as robots, and thus, they also support inter-module communication. We conclude the paper describing a Conro hexapod as an example of the robots that can be built using these modules.",
        "primary_area": "",
        "author": "A. Castano;P. Will;A. Castano;P. Will",
        "authorids": "/37270312300;/37282506800;/37270312300;/37282506800",
        "aff": "Information Sciences Institute, University of Southern California, Marina del Rey, CA, USA; Information Sciences Institute, University of Southern California, Marina del Rey, CA, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895296/",
        "gs_citation": 121,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12647951464325911972&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Southern California",
        "aff_unique_dep": "Information Sciences Institute",
        "aff_unique_url": "https://www.usc.edu",
        "aff_unique_abbr": "USC",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Marina del Rey",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895252",
        "title": "Mobile manipulation of humanoid robots-analysis of manipulability and stability in mobile manipulation",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper describes mobile manipulation of humanoid robots. A humanoid robot is a kind of integrated machines: two arm and two leg mechanism. It could be well applied to mobile manipulation in nonroutine task automation. The main objective of the mobile manipulation is to obtain versatile and efficient manipulation by the arms. In this respect the legs are required to assist the arms obtaining their high manipulability by changing step length and timing of step motion. Accordingly, the required motion of the legs in mobile manipulation is different from conventional biped locomotion. From this point of view, the relationship between manipulability of the arm and various leg motions is analyzed and evaluated by computer simulations.",
        "primary_area": "",
        "author": "H. Yoshida;K. Inoue;T. Arai;Y. Mae;H. Yoshida;K. Inoue;T. Arai;Y. Mae",
        "authorids": "/37336803200;/37281357300;/37281360800;/37281355800;/37336803200;/37281357300;/37281360800;/37281355800",
        "aff": "Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895252/",
        "gs_citation": 11,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=351196436799609757&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Osaka University",
        "aff_unique_dep": "Department of Systems and Human Science Graduate School of Engineering Science",
        "aff_unique_url": "https://www.osaka-u.ac.jp",
        "aff_unique_abbr": "Osaka U",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Toyonaka",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895207",
        "title": "Mobility of a microgravity rover using internal electro-magnetic levitation",
        "track": "main",
        "status": "Poster",
        "abstract": "A new type of mobility is discussed for space projects such as the MUSES-C aiming at small asteroid exploration. We propose the use of electro-magnetic levitation in order to integrate a mobility into the microgravity rover. The rover has a spherical shape and a smaller spherical shell inside. Four electromagnets are symmetrically located between the outer sphere surface and the inner sphere shell with one end of each directed to the center of the shell. With electromagnetic force of the magnets, a sphere iron ball inside the shell is controlled and levitated. When the rover lifts the ball inside with the electro-magnetic force, the rover is in return pressed down the ground by the reaction force, due to which the rover system not only gains upward momentum for floatation, but also obtains friction that enables its rolling on the ground. The prototype microgravity rover was developed and experimental results indicate effectiveness of the proposed mobility.",
        "primary_area": "",
        "author": "Y. Nakamura;S. Shimoda;S. Shoji;Y. Nakamura;S. Shimoda;S. Shoji",
        "authorids": "/37280754600;/38185136400;/37088052355;/37280754600;/38185136400;/37088052355",
        "aff": "Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Environmental Studies, University of Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Bunkyo, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895207/",
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5460536109475101828&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Tokyo",
        "aff_unique_dep": "Department of Mechano-Informatics",
        "aff_unique_url": "https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "UTokyo",
        "aff_campus_unique_index": "0;1;0",
        "aff_campus_unique": "Bunkyo;Tokyo",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895257",
        "title": "Modeling and analysis of internal impact for general classes of robotic mechanisms",
        "track": "main",
        "status": "Poster",
        "abstract": "When a robot system collides with environment not only the contact point but also the joints of the robot system experience impulsive forces or moments. However analysis on the so-called internal impulses acting on the joints has not attracted much attention although excessive impact may cause damage to the joint. In this work, we propose a closed-form internal impact model applicable to general classes of robotic mechanisms. The characteristics of the internal impulse are analyzed through simulation for serial-chain, closed-chain, and hybrid-chain systems. It is shown that the external impulse is distributed to the internal impulses of the various structures and that configurations best for external impulses might not be best for internal impulses.",
        "primary_area": "",
        "author": "S.H. Lee;S.H. Kim;Y.K. Kwak;S.H. Lee;S.H. Kim;Y.K. Kwak",
        "authorids": "/37089068015;/37089078171;/37088331955;/37089068015;/37089078171;/37088331955",
        "aff": "Dept. of Mech. Eng., Korea Adv. Inst. of Sci. & Technol., Taejon, South Korea; S.H. Kim; Y.K. Kwak",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895257/",
        "gs_citation": 31,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2866698503841380847&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0",
        "aff_unique_norm": "Korea Advanced Institute of Science and Technology;",
        "aff_unique_dep": "Department of Mechanical Engineering;",
        "aff_unique_url": "https://www.kaist.ac.kr;",
        "aff_unique_abbr": "KAIST;",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Taejon;",
        "aff_country_unique_index": "0",
        "aff_country_unique": "South Korea;"
    },
    {
        "id": "895259",
        "title": "Motion characteristics in releasing manipulation",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper mainly discusses the characteristics of free sliding motion in releasing manipulation. Releasing manipulation is such a manipulation, in which an object is given initial velocities by striking and slides on a surface to stop at the pre-assigned destination under the action of friction. After the properties of releasing manipulation are given out based on our previous work, the trajectory, the relationship of the sliding motion and the object shape, and the motion monotonicity of any one object with arbitrary shape are intensively discussed. Several important results are originally obtained. Finally, a simple and effectual approach of determining the necessary initial velocity of the object is presented with the above obtained results.",
        "primary_area": "",
        "author": "Chi Zhu;Y. Aiyama;T. Arai;A. Kawamura;Chi Zhu;Y. Aiyama;T. Arai;A. Kawamura",
        "authorids": "/37087296144;/37341430000;/37281361000;/37282061300;/37087296144;/37341430000;/37281361000;/37282061300",
        "aff": "Department of Electrical and computer Engineering, Yokohama National University, Yokohama, Japan; Institute of Engineering Mechanics and Systems, University of Tsukuba, Tsukuba, Ibaraki, Japan; Department of Precision Machiuery Engineering, University of Tokyo, Bunkyo, Tokyo, Japan; Department of Electrical and computer Engineering, Yokohama National University, Yokohama, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895259/",
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7799819035643156102&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;1;2;0",
        "aff_unique_norm": "Yokohama National University;University of Tsukuba;University of Tokyo",
        "aff_unique_dep": "Department of Electrical and Computer Engineering;Institute of Engineering Mechanics and Systems;Department of Precision Machinery Engineering",
        "aff_unique_url": "https://www.yokohama-nu.ac.jp;https://www.tsukuba.ac.jp;https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "YNU;;UTokyo",
        "aff_campus_unique_index": "0;1;2;0",
        "aff_campus_unique": "Yokohama;Tsukuba;Bunkyo",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895199",
        "title": "Motion simulation using a high-speed parallel link mechanism",
        "track": "main",
        "status": "Poster",
        "abstract": "A new kind of motion simulation is proposed for the purpose of simulating complicated motions such as those caused by interactions between objects in special environments (e.g., those of micro-gravity). The motion simulation is based on a hybrid simulation: consisting of a combined analog-digital system. Hence it has functions of real-time numerical simulation and embedding a physical model in the simulation. In addition, the motion simulation is equipped with flexibility of modeling, effective human interface and scalability of system. Finally, as a preliminary experiment, motion caused by interactions between a chaser (space robot) and a target (nano satellite) has been simulated with a prototype of the hybrid motion simulator.",
        "primary_area": "",
        "author": "S. Tarao;E. Inohira;M. Uchiyama;S. Tarao;E. Inohira;M. Uchiyama",
        "authorids": "/37860579700;/37590457900;/37281517000;/37860579700;/37590457900;/37281517000",
        "aff": "Dept. of Intelligent Syst. Eng., Ichinoseki Nat. Coll. of Technol., Japan; E. Inohira; Department of Aeronautics and Space Eng, Graduate School of Eng, University of Tohoku, Sendai, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895199/",
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4467132661874620083&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;2",
        "aff_unique_norm": "Ichinoseki National College of Technology;;University of Tohoku",
        "aff_unique_dep": "Department of Intelligent Systems Engineering;;Department of Aeronautics and Space Eng",
        "aff_unique_url": ";;https://www.tohoku.ac.jp",
        "aff_unique_abbr": ";;Tohoku U",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Sendai",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan;"
    },
    {
        "id": "895280",
        "title": "Nearness diagram navigation (ND): a new real time collision avoidance approach",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper presents a new real-time collision avoidance approach for mobile robots. The nearness diagram method (ND) performs a high level information extraction and interpretation of the environment. Subsequently, this information is used to generate the motion commands. The proposed approach is well-suited to deal with unknown, unstructured and dynamic environments, where problems of other approaches are avoided. Some experimental results are shown using an holonomic mobile base to demonstrate the usefulness of the method.",
        "primary_area": "",
        "author": "J. Minguez;L. Montano;J. Minguez;L. Montano",
        "authorids": "/37278579300;/37278575700;/37278579300;/37278575700",
        "aff": "Computer Science and Systems Engineering, Universidad de Zaragoza, Spain; L. Montano",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895280/",
        "gs_citation": 219,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2366090247284895804&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0",
        "aff_unique_norm": "Universidad de Zaragoza;",
        "aff_unique_dep": "Computer Science and Systems Engineering;",
        "aff_unique_url": "https://www.unizar.es;",
        "aff_unique_abbr": "UniZar;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Spain;"
    },
    {
        "id": "895210",
        "title": "Neural network control of mobile manipulators",
        "track": "main",
        "status": "Poster",
        "abstract": "In this paper, a novel neural-net (NN) based control methodology is developed for the motion control of mobile manipulators subject to kinematic constraints. The dynamics of the mobile manipulator is assumed to be unknown and is to be identified by the NN online estimators. No preliminary learning stage of NN weight matrices is required. The controller is capable of disturbance-rejection in the presence of unknown bounded disturbances. Closed-loop stability of the control system and convergence of the NN learning processes are both guaranteed. Experimental tests on a two-DOE manipulator arm illustrate that the proposed control is significantly better than conventional robust control.",
        "primary_area": "",
        "author": "Sheng Lin;A.A. Goldenberg;Sheng Lin;A.A. Goldenberg",
        "authorids": "/37087511408;/37338111900;/37087511408;/37338111900",
        "aff": "Robotics and Automation Laboratory, University of Toronto, Toronto, ONT, Canada; Robotics and Automation Laboratory, University of Toronto, Toronto, ONT, Canada",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895210/",
        "gs_citation": 280,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12547628179700667479&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Toronto",
        "aff_unique_dep": "Robotics and Automation Laboratory",
        "aff_unique_url": "https://www.utoronto.ca",
        "aff_unique_abbr": "U of T",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Toronto",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Canada"
    },
    {
        "id": "895237",
        "title": "Numerical computation of reconfigurable multibody dynamics",
        "track": "main",
        "status": "Poster",
        "abstract": "There has been much research on capturing and berthing damaged satellites in space, and such systems are categorized as reconfigurable multibody systems whose constraint conditions are time varying. On the other hand the theory for reconfigurable multibody dynamics is not well developed. There are many technical issues such as the dynamics algorithm with topological changes, contact dynamics, collision detection and computation of Jacobian matrices concerned with constraint conditions, and so on. We propose the algorithms to solve and implement some of these issues.",
        "primary_area": "",
        "author": "T. Takahashi;S. Matunaga;T. Takahashi;S. Matunaga",
        "authorids": "/38023841200;/37443331100;/38023841200;/37443331100",
        "aff": "Mechanical and Aerospace Engineering, Tokyo Institute of Technology, Meguro, Tokyo, Japan; Mechanical and Aerospace Engineering, Tokyo Institute of Technology, Meguro, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895237/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8553473804207811079&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Mechanical and Aerospace Engineering",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Meguro, Tokyo",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895221",
        "title": "On optimal nonholonomic paths in a limited space",
        "track": "main",
        "status": "Poster",
        "abstract": "This work addresses the problem of finding the shortest path for a vehicle (say, a mobile robot or a car) moving in a limited workspace. The proposed approach makes use of a tool dubbed the reflective unfolding operator which has a clear geometric interpretation and provides an interesting means for solving other trajectory design problems. The authors' previously reported result (1997) which relates to the special case of a car maneuvering within a disc-shaped area, is extended here to the general case of an arbitrarily shaped area. The approach is illustrated by computer simulations.",
        "primary_area": "",
        "author": "A.M. Shkel;V.J. Lumelsky;A.M. Shkel;V.J. Lumelsky",
        "authorids": "/37283225500;/37283224200;/37283225500;/37283224200",
        "aff": "Mechanical & Aerospace Engineering, University of California, Irvine, Irvine, CA, USA; Mechanical Engineering, University of Wisconsin, Madison, Madison, WI, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895221/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17965071040182368733&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "University of California, Irvine;University of Wisconsin-Madison",
        "aff_unique_dep": "Mechanical & Aerospace Engineering;Mechanical Engineering",
        "aff_unique_url": "https://www.uci.edu;https://www.wisc.edu",
        "aff_unique_abbr": "UCI;UW-Madison",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Irvine;Madison",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895205",
        "title": "On the performance of a biologically motivated visual control strategy for robotic hand-eye coordination",
        "track": "main",
        "status": "Poster",
        "abstract": "Research has focused on developing control strategies that allow to work with imprecisely calibrated or even uncalibrated robot systems. A popular approach is to close the control loop with visual feedback (visual servoing), even though this requires continuous, high rate image processing. In contrast, we developed a strategy that can compensate calibration errors by integrating sparse visual feedback asynchronously. This strategy was motivated by neuroscientific studies which show that human grasping definitely requires only sparse asynchronous visual feedback, even with disturbed visual input. We analyze the performance of our control strategy on a robotic hand-eye system consisting of a 6 d.o.f. manipulator and a pan-tilt head with a stereo camera system. To analyze thoroughly which calibration errors can be compensated by sparse feedback, we furthermore built a complete simulation model of the real hand-eye system, including the vision modules. Taken together, experimental and simulation results show that calibration errors can be compensated with a very moderate amount of (asynchronous) visual feedback. Thus, the proposed control strategy can indeed be seen as a serious alternative to visual servoing for real robotics applications. This shows that robotics can profit from taking a closer look at the results of neuroscience.",
        "primary_area": "",
        "author": "A. Hauck;G. Passig;T. Schenk;M. Sorg;G. Farber;A. Hauck;G. Passig;T. Schenk;M. Sorg;G. Farber",
        "authorids": "/37371390500;/37571601200;/37369776300;/37330105000;/37376079100;/37371390500;/37571601200;/37369776300;/37330105000;/37376079100",
        "aff": "Institute for Real-Time Computer Systems, Technische Universität München, Germany; Institute for Real-Time Computer Systems, Technische Universität München, Germany; Department of Neurology, Ludwig-Maximilians-Universitaet Muenchen, Germany; Institute for Real-Time Computer Systems, Technische Universität München, Germany; G. Farber",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895205/",
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1078997784044698960&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;1;0",
        "aff_unique_norm": "Technische Universität München;Ludwig-Maximilians-Universitaet Muenchen;",
        "aff_unique_dep": "Institute for Real-Time Computer Systems;Department of Neurology;",
        "aff_unique_url": "https://www.tum.de;https://www.lmu.de;",
        "aff_unique_abbr": "TUM;LMU;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Germany;"
    },
    {
        "id": "895234",
        "title": "Planning and model-based control for mobile manipulators",
        "track": "main",
        "status": "Poster",
        "abstract": "Mobile manipulator systems, comprised of a mobile platform with one or more manipulators, are of great interest in a number of applications. This paper presents a planning and control methodology for such systems allowing them to follow simultaneously desired end-effector and platform trajectories without violating the nonholonomic constraints. Based on a reduction of system dynamics, a model-based controller is designed to eliminate tracking errors without requiring large gains. The sensitivity to parameter errors is examined and found to be negligible. The validity of the methodology is demonstrated using example systems.",
        "primary_area": "",
        "author": "E. Papadopoulos;J. Poulakakis;E. Papadopoulos;J. Poulakakis",
        "authorids": "/37273090500;/37087222246;/37273090500;/37087222246",
        "aff": "Department of Mechanical Engineering, National and Technical University of Athens, Greece; Department of Mechanical Engineering, National and Technical University of Athens, Greece",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895234/",
        "gs_citation": 143,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2970736319186460502&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 13,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "National and Technical University of Athens",
        "aff_unique_dep": "Department of Mechanical Engineering",
        "aff_unique_url": "https://www.ntua.gr",
        "aff_unique_abbr": "NTUA",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Greece"
    },
    {
        "id": "895260",
        "title": "Planning of rapid grasp operations in unstructured scenes",
        "track": "main",
        "status": "Poster",
        "abstract": "Grasping of unmodelled objects in unstructured scenes is a significant task in numerous robot applications. In order to reach short cycle times, grasp planning must make the best of the image information acquired all at once, which comprises more or less visual occlusions and thus unknown regions. For time reasons, it is not acceptable to inspect in further steps all unknown regions by means of local sensing before grasp planning. We present a grasp planning system, which determines explicitly the fractions of grasp operations in known and unknown regions. Using that crucial information, a planning system may not request a tool change, but prefer a grasping operation with the mounted gripper, which moves mostly in known and free regions. Then, only a small part has to be executed slowly using local sensing with, for examples, proximity or force torque sensors.",
        "primary_area": "",
        "author": "M. Muller;H. Worn;M. Muller;H. Worn",
        "authorids": "/37089100325;/37303972500;/37089100325;/37303972500",
        "aff": "Department of Computer Science Institute for Process Control and Robotics, University of Karlsruhe, Karlsruhe, Germany; Department of Computer Science Institute for Process Control and Robotics, University of Karlsruhe, Karlsruhe, Germany",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895260/",
        "gs_citation": 7,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=524516339434966398&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Karlsruhe",
        "aff_unique_dep": "Department of Computer Science Institute for Process Control and Robotics",
        "aff_unique_url": "https://www.kit.edu",
        "aff_unique_abbr": "KIT",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Karlsruhe",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "895244",
        "title": "Position and pose detection of active camera-head in a nuclear power plant",
        "track": "main",
        "status": "Poster",
        "abstract": "A method to determine the position and pose of an active camera-head by aligning a 3D model of its surrounding environment with an observed 2D image is proposed. The camera-head is mounted on a mobile robot and freely moves in a 3D space. We aim at visual feedback to correct the estimation error of its position and pose obtained from dead reckoning. Since the nuclear power plant where the robot moves about consists of many pipes without particular marks, most of features in the observed images are occluding edges of the pipes. For robustly finding 3D-2D point correspondences on the occluding edges, two-type predicted images which are calculated from the 3D environmental model by a view simulator are used as follows: 1) 3D model points which correspond to the observed occluding edges are quickly obtained from the predicted depth image; 2) The predicted intensity image is used to select only the 3D model points which are expected to appear clearly in the observed image. As a result, point correspondences between the observed image and the 3D model can be robustly found even in complicated scenes. Preliminary experiments using an actual plant mock-up have shown that the method is promising.",
        "primary_area": "",
        "author": "Y. Kita;N. Kita;Y. Kita;N. Kita",
        "authorids": "/37278620500;/37278493000;/37278620500;/37278493000",
        "aff": "Intelligent Systems Division, Electro Technical Laboratory, Tsukuba, Japan; Intelligent Systems Division, Electro Technical Laboratory, Tsukuba, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895244/",
        "gs_citation": 5,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3910181125461216520&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Electro Technical Laboratory",
        "aff_unique_dep": "Intelligent Systems Division",
        "aff_unique_url": "https://www.etl.go.jp",
        "aff_unique_abbr": "ETL",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tsukuba",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895279",
        "title": "Proposal of new engineering field: rescue engineering",
        "track": "main",
        "status": "Poster",
        "abstract": "In this note, we consider natural disasters and protection against disasters. Then, we discuss rescue activities from a viewpoint of robotics, and consider the development of a new field of engineering, rescue engineering.",
        "primary_area": "",
        "author": "K. Osuka;K. Osuka",
        "authorids": "/37280720500;/37280720500",
        "aff": "Department of Systems Science, Kyoto University, Kyoto, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895279/",
        "gs_citation": 2,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7718915917853647182&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 2,
        "aff_unique_index": "0",
        "aff_unique_norm": "Kyoto University",
        "aff_unique_dep": "Department of Systems Science",
        "aff_unique_url": "https://www.kyoto-u.ac.jp",
        "aff_unique_abbr": "Kyoto U",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Kyoto",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895204",
        "title": "Proto-symbol emergence",
        "track": "main",
        "status": "Poster",
        "abstract": "Robotics can serve as a testbed for cognitive theories. One behavioral criterion for comparing theories is the extent to which their implementations can learn to exploit new environmental opportunities. Furthermore, a robotics testbed forces researchers to confront fundamental issues concerning how internal representations are grounded in activity. In our approach, a mobile robot takes the role of a creature that must survive in an unknown environment. The robot has no a priori knowledge about what constitutes a suitable goal, what is edible, inedible, or dangerous, or even its shape or how its body works. Nevertheless, the robot learns how to survive. The robot does this by tracking segmented regions of its camera image while moving. The robot projects these regions into a canonical wavelet domain that highlights color and intensity changes at various scales. This reveals sensory invariance that is readily extracted with Bayesian statistics. The robot simultaneously learns an adaptable sensorimotor mapping by recording how motor signals transform the locations of regions on its camera image. The robot learns about its own physical extension when it touches an object, but it also undergoes an internal state change analogous to the thirst quenching or nausea producing effects of intake in animals. This allows the robot to learn what an object affords: is it edible or poisonous, by relating these effects to learned clusters of invariance. In this way primitive symbols emerge. These proto-symbols provide the robot with goals that it can achieve by using its sensorimotor mapping to navigate, for example, toward food and away from danger.",
        "primary_area": "",
        "author": "K.F. MacDorman;K. Tatani;Y. Miyazaki;M. Koeda;K.F. MacDorman;K. Tatani;Y. Miyazaki;M. Koeda",
        "authorids": "/37266176100;/37324159200;/37730516000;/37269468800;/37266176100;/37324159200;/37730516000;/37269468800",
        "aff": "Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Department of Systems and Human Science Graduate School of Engineering Science, Osaka University, Toyonaka, Osaka, Japan; Nara Institute of Science and Technology, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895204/",
        "gs_citation": 30,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2145063763028016455&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;1",
        "aff_unique_norm": "Osaka University;Nara Institute of Science and Technology",
        "aff_unique_dep": "Department of Systems and Human Science Graduate School of Engineering Science;",
        "aff_unique_url": "https://www.osaka-u.ac.jp;https://www.nist.jp",
        "aff_unique_abbr": "Osaka U;NIST",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Toyonaka;",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895230",
        "title": "Quadrupedal mammal locomotion dynamics 2D model",
        "track": "main",
        "status": "Poster",
        "abstract": "Making a quadrupedal robotic machine walk is a problem with an infinity of solutions. Nevertheless, this question seems to have been solved successfully by mammals. Hence a particular approach in the design of walking robots has been considered, based on the animals movement characteristics. Indeed, studying animal walking can help produce a class of solutions towards the definition of quadrupedal robots. From this starting point, a model can be created according to a reduced number of criteria, notably the shape of the trajectory followed by the ankle or wrist during motion relatively to the hip or to the shoulder respectively. The problem lies in the difficulty to extract significant and valuable information from the mere observation of animals walking. This paper presents an experiment designed to extract angular variations data from the observation of a walking hedgehog and the use of these data to create a 2D dynamical simulation model to be used as an analysis basis.",
        "primary_area": "",
        "author": "J. Villanova;J.-C. Guinot;P. Neveu;J.-P. Gasc;J. Villanova;J.-C. Guinot;P. Neveu;J.-P. Gasc",
        "authorids": "/37425994700;/37425994800;/37425993900;/37425997800;/37425994700;/37425994800;/37425993900;/37425997800",
        "aff": "Laboratory de Robotique de Paris, U.P.M.C., Velizy, France; Laboratory de Robotique de Paris, U.P.M.C., Velizy, France; Laboratory dE28099Anatomie Comparée, M. N. H. N, Paris, France; Laboratory dE28099Anatomie Comparée, M. N. H. N, Paris, France",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895230/",
        "gs_citation": 8,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3671413498373082743&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;1",
        "aff_unique_norm": "Université Pierre et Marie Curie (UPMC);Muséum National d'Histoire Naturelle",
        "aff_unique_dep": "Laboratory de Robotique de Paris;Laboratory of Comparative Anatomy",
        "aff_unique_url": "https://www.upmc.fr;https://www.mnhn.fr",
        "aff_unique_abbr": "UPMC;MNHN",
        "aff_campus_unique_index": "0;0;1;1",
        "aff_campus_unique": "Velizy;Paris",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "France"
    },
    {
        "id": "895272",
        "title": "Real-time estimating spatial configuration between multiple robots by triangle and enumeration constraints",
        "track": "main",
        "status": "Poster",
        "abstract": "In the multi-agent environment, it is important to identify position and orientation of multiple robots for accomplishing a given task in cooperative manner. This paper proposes a method for estimating position and orientation of multiple robots using multiple omnidirectional images based on geometrical constraints. Our method reconstruct not only the relative configuration between robots but also an absolute one using the knowledge of landmarks in the environment. Even if there are some obstacles in the environment, our method can estimate absolute configuration between robots based on the results of self-localization of each robot.",
        "primary_area": "",
        "author": "T. Nakamura;A. Ebina;M. Imai;T. Ogasawara;H. Ishiguro;T. Nakamura;A. Ebina;M. Imai;T. Ogasawara;H. Ishiguro",
        "authorids": "/37439855800;/38030838100;/37346157100;/37269488400;/37274136400;/37439855800;/38030838100;/37346157100;/37269488400;/37274136400",
        "aff": "Graduate Sch. of Inf. Sci, Nara Inst. of Sci. & Technol., Japan; Graduate School of Information Science, Nara Institute of Science and Technology, Ikoma, Nara, Japan; Graduate School of Information Science, Nara Institute of Science and Technology, Ikoma, Nara, Japan; Graduate School of Information Science, Nara Institute of Science and Technology, Ikoma, Nara, Japan; Department of Computer and Communication System, Wakayama University, Wakayama, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895272/",
        "gs_citation": 21,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=526929172579123322&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;0;0;0;1",
        "aff_unique_norm": "Nara Institute of Science and Technology;Wakayama University",
        "aff_unique_dep": "Graduate School of Information Science;Department of Computer and Communication System",
        "aff_unique_url": "https://www.nist.go.jp;https://www.wakayama-u.ac.jp",
        "aff_unique_abbr": "NIST;Wakayama U",
        "aff_campus_unique_index": "1;1;1;2",
        "aff_campus_unique": ";Ikoma;Wakayama",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895284",
        "title": "Recognition of human task by attention point analysis",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper presents a novel method of constructing a human task model by attention point (AP) analysis. The AP analysis consists of two steps: at the first step, it broadly observes human task, constructs rough human task model and finds APs which require detailed analysis; and at the second step, by applying time-consuming analysis on APs in the same human task, it can enhance the human task model. This human task model is highly abstracted and is able to change the degree of abstraction adapting to the environment so as to be applicable in a different environment. We describe this method and its implementation using data gloves and a stereo vision system. We also show an experimental result in which a real robot observed a human task and performed the same human task successfully in a different environment using this model.",
        "primary_area": "",
        "author": "K. Ogawara;S. Iba;T. Tanuki;H. Kimura;K. Ikeuchi;K. Ogawara;S. Iba;T. Tanuki;H. Kimura;K. Ikeuchi",
        "authorids": "/37339602900;/37089048735;/37728038900;/37335051100;/37281068600;/37339602900;/37089048735;/37728038900;/37335051100;/37281068600",
        "aff": "Institute of Industrial Science, University of Tokyo, Tokyo, Japan; Research Division, Komatsu Limited, Kanagawa, Japan; University of Electro-Communications, Tokyo, Japan; Institute of Industrial Science, University of Tokyo, Tokyo, Japan; The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895284/",
        "gs_citation": 40,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14276621536516826833&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 10,
        "aff_unique_index": "0;1;2;0;3",
        "aff_unique_norm": "University of Tokyo;Komatsu Limited;University of Electro-Communications;Carnegie Mellon University",
        "aff_unique_dep": "Institute of Industrial Science;Research Division;;The Robotics Institute",
        "aff_unique_url": "https://www.iis.u-tokyo.ac.jp;https://www.komatsu.com;https://www.uec.ac.jp;https://www.cmu.edu",
        "aff_unique_abbr": "UTokyo;;UEC;CMU",
        "aff_campus_unique_index": "0;0;0;2",
        "aff_campus_unique": "Tokyo;;Pittsburgh",
        "aff_country_unique_index": "0;0;0;0;1",
        "aff_country_unique": "Japan;United States"
    },
    {
        "id": "895261",
        "title": "Regrasp planner using look-up table",
        "track": "main",
        "status": "Poster",
        "abstract": "Regrasping, given initial and final pose of the target object, is a construction of sequential transition of object poses that are compatible with two poses in the point of grasp configuration. This paper presents a novel approach for solving the regrasp problem. The approach consists of a preprocessing and planning stages. Preprocessing, which is done only once for a given robot, generates a look-up table which has information of kinematically feasible task space of end-effector through all the workspace. Then, using the table, planning automatically determines possible intermediate location, pose and regrasp sequence leading from the pick-up to put-down grasp. Experiments show that the approach presented is complete in the total workspace. The regrasp planner was combined with the existing path.",
        "primary_area": "",
        "author": "Kyoungrae Cho;Munsang Kim;Chongwon Lee;Jae-Bok Song;Kyoungrae Cho;Munsang Kim;Chongwon Lee;Jae-Bok Song",
        "authorids": "/37087146161;/37087167061;/37087265964;/37087150757;/37087146161;/37087167061;/37087265964;/37087150757",
        "aff": "Advanced Robotics Research Center, Korea Institute of Science and Technology, Seoul, South Korea; Advanced Robotics Research Center, Korea Institute of Science and Technology, Seoul, South Korea; Advanced Robotics Research Center, Korea Institute of Science and Technology, Seoul, South Korea; Advanced Robotics Research Center, Korea Institute of Science and Technology, Seoul, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895261/",
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6161602925016031212&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Korea Institute of Science and Technology",
        "aff_unique_dep": "Advanced Robotics Research Center",
        "aff_unique_url": "https://www.kist.re.kr",
        "aff_unique_abbr": "KIST",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Seoul",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "South Korea"
    },
    {
        "id": "895247",
        "title": "Rescue simulation project and comprehensive disaster simulator architecture",
        "track": "main",
        "status": "Poster",
        "abstract": "The RoboCup Rescue project aims to simulate large urban disasters and rescue agents' activities. The simulator must support both simulation of heterogeneous agents such as fire fighters, victims' behaviors and interface to disaster's environments in the real world. The RoboCup Rescue simulator is a comprehensive urban disaster simulator into which a new disasters simulator or rescue agents can be easily plugged. In the paper, the simulator's specification based on the Hanshin-Awaji Earthquake and the simulator's architecture are described.",
        "primary_area": "",
        "author": "T. Takahashi;I. Takeuchi;F. Matsuno;S. Tadokoro;T. Takahashi;I. Takeuchi;F. Matsuno;S. Tadokoro",
        "authorids": "/37277761500;/37446985500;/37277023100;/37296054300;/37277761500;/37446985500;/37277023100;/37296054300",
        "aff": "Chubu University, Matsumoto, Japan; University of Electro-Communications, Chofu, Japan; Tokyo Institute of Technology, Yokohama, Japan; Kobe University, Kobe, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895247/",
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13462731371721923271&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;1;2;3",
        "aff_unique_norm": "Chubu University;University of Electro-Communications;Tokyo Institute of Technology;Kobe University",
        "aff_unique_dep": ";;;",
        "aff_unique_url": "https://www.chubu-u.ac.jp;https://www.uec.ac.jp;https://www.titech.ac.jp;https://www.kobe-u.ac.jp",
        "aff_unique_abbr": ";UEC;Titech;Kobe U",
        "aff_campus_unique_index": "0;1;2;3",
        "aff_campus_unique": "Matsumoto;Chofu;Yokohama;Kobe",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895238",
        "title": "Research and development of tethered satellite cluster systems",
        "track": "main",
        "status": "Poster",
        "abstract": "We propose the concept of tethered satellite cluster systems, as an application of the RoboSat clusters. The system consists of some satellites joined by tethers, and keeps and changes the constellation with tension/length control of the tethers to perform various orbit service missions. We formulate the motion of the system in order to analyze the dynamics and establish the methods of coordinated control of tension and attitude of the satellite. In addition, we develop a ground experiment system including a reel mechanism for the tethered satellite cluster systems. We outline the system components and show results of the fundamental experiments for verification of the reel mechanism and the control methods.",
        "primary_area": "",
        "author": "O. Mori;S. Matunaga;N. Waeda;O. Mori;S. Matunaga;N. Waeda",
        "authorids": "/37278866600;/37443331100;/37086983138;/37278866600;/37443331100;/37086983138",
        "aff": "Mechanical and Aerospace Engineering, Tokyo Institute of Technology, Tokyo, Japan; Tokyo Kogyo Daigaku, Meguro-ku, Tokyo, JP; N. Waeda",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895238/",
        "gs_citation": 10,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15398825687791525299&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "Tokyo Institute of Technology;Tokyo Kogyo Daigaku;",
        "aff_unique_dep": "Mechanical and Aerospace Engineering;;",
        "aff_unique_url": "https://www.titech.ac.jp;;",
        "aff_unique_abbr": "Titech;;",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tokyo;",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan;"
    },
    {
        "id": "895246",
        "title": "RoboCup Rescue project: challenges and benchmark",
        "track": "main",
        "status": "Poster",
        "abstract": "Disaster rescue is one of the most serious social issues which involves very large numbers of heterogenous agents in the hostile environment. The intention of the RoboCup Rescue project is to promote research and development in this socially significant domain by creating a standard simulator and forum for researchers and practitioners. While the rescue domain is intuitively appealing as a large scale multi-agent domain, it has not yet been given thorough analysis of its domain characteristics. We present detailed analysis of the task domain, challenges, and outline benchmark evaluations.",
        "primary_area": "",
        "author": "H. Kitano;S. Tadokoro;K. Osuka;H. Kitano;S. Tadokoro;K. Osuka",
        "authorids": "/37271762500;/37296054300;/37280720500;/37271762500;/37296054300;/37280720500",
        "aff": "Sony Computer Science Laboratories, Inc., Shinagawa, Tokyo, Japan; Department of Computer and Systems Engineering, Kobe University, Japan; Department of Systems Science, Kyoto University, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895246/",
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18082502567800657238&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;1;2",
        "aff_unique_norm": "Sony Computer Science Laboratories, Inc.;Kobe University;Kyoto University",
        "aff_unique_dep": ";Department of Computer and Systems Engineering;Department of Systems Science",
        "aff_unique_url": "https://www.sony.net/;https://www.kobe-u.ac.jp;https://www.kyoto-u.ac.jp",
        "aff_unique_abbr": "Sony CSL;Kobe U;Kyoto U",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Shinagawa;Kobe;",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895321",
        "title": "Self-reconfiguration in task space of a holonic structure",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper introduces a methodology developed for the self-organization of a colony of holons in its task space where holons act as intelligent agents in this decentralized robotic structure such that they self localize themselves in the reconfiguration task space of their colony and identify their individual role in the colony re-organization. We term such an n-holon colony where intelligent agents can self-localize in the reconfiguration task space without their individual tasks within the colony configuration being assigned by a central controller, an n-holony. The proposed method is based on a cascaded computation scheme for the self-reconfiguration of the n-holony: self-localization followed by self-organization. The holon communicates with its neighbours in order to acquire knowledge about the colony configuration within a neighbourhood of radius d based on configuration invariants namely the eigenstructures. Self-organization uses this knowledge to take the next action for achieving the desired holony configuration.",
        "primary_area": "",
        "author": "M. Durna;I. Erkmen;A.M. Erkmen;M. Durna;I. Erkmen;A.M. Erkmen",
        "authorids": "/37449042600;/37283557700;/37265860800;/37449042600;/37283557700;/37265860800",
        "aff": "Electrical and Electronics Department, Middle East Technical University, Turkey; Electrical and Electronics Department, Middle East Technical University, Turkey; Electrical and Electronics Department, Middle East Technical University, Turkey",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895321/",
        "gs_citation": 11,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8017773984729153894&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Middle East Technical University",
        "aff_unique_dep": "Electrical and Electronics Department",
        "aff_unique_url": "https://www.metu.edu.tr",
        "aff_unique_abbr": "METU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Turkey"
    },
    {
        "id": "895203",
        "title": "Sensor allocation for behavioral sensor fusion using min-conflict with happiness",
        "track": "main",
        "status": "Poster",
        "abstract": "For mobile robots employing reactive behaviors, allocation of physical sensors to satisfy sensing needs should be dynamic and fast. It is becoming increasingly apparent that this allocation should also support behavioral sensor fusion, as indicated by experimental data, in order to maximize the use of available sensing hardware and to increase the quality of sensing. These issues are addressed in the context of the min-conflict with happiness algorithm for dynamic sensor allocation, whose execution rates on two real robots ranged from 11 to 17 milliseconds. Experimental results are shown which illustrate the improvements (27.5%-75% of observations) achieved using sensor fusion. The paper also contributes a quantitative representation of sensing quality using t-norms, allowing fused sensors to be compared with single sensors for a behavior.",
        "primary_area": "",
        "author": "A. Gage;R.R. Murphy;A. Gage;R.R. Murphy",
        "authorids": "/37267300300;/37273983600;/37267300300;/37273983600",
        "aff": "Computer Science and Engineering, University of South Florida, Tampa, FL, USA; Computer Science and Engineering, University of South Florida, Tampa, FL, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895203/",
        "gs_citation": 4,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8243485058525498100&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of South Florida",
        "aff_unique_dep": "Computer Science and Engineering",
        "aff_unique_url": "https://www.usf.edu",
        "aff_unique_abbr": "USF",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tampa",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895311",
        "title": "Similarity based linear n/spl ges/5-point structure and pose estimation from it single image",
        "track": "main",
        "status": "Poster",
        "abstract": "We present a novel two-stage algorithm for structural and pose estimation from a single image. Our method is a significant improvement on the work described by Quan et al. (1999) because: our algorithm is developed in similarity space rather than in camera centred coordinate frame; our algorithm is directly based on a fourth order polynomial rather than on an eighth order polynomial resulting in an easier and more efficient implementation; and finally our algorithm is a unified linear algorithm for structural estimation. The algorithm has been extensively validated by experimentation using both synthetic and real images and compared with a classical linear algorithm and an algorithm based on epipolar geometry. Experimental results show that the proposed algorithm is generally accurate, robust, and efficient for the calibration of all parameters of interest.",
        "primary_area": "",
        "author": "Y. Liu;M.A. Rodrigues;D. Cooper;Y. Liu;M.A. Rodrigues;D. Cooper",
        "authorids": "/37089074540;/37328078000;/37089120156;/37089074540;/37328078000;/37089120156",
        "aff": "School of Computing and Management, Sheffield Hallam University, Sheffield, UK; School of Computing and Management, Sheffield Hallam University, Sheffield, UK; School of Computing and Management, Sheffield Hallam University, Sheffield, UK",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895311/",
        "gs_citation": 0,
        "gs_cited_by_link": "https://scholar.google.com/scholar?q=related:8CGDRbcJOWsJ:scholar.google.com/&scioq=Similarity+based+linear+n/spl+ges/5-point+structure+and+pose+estimation+from+it+single+image&hl=en&as_sdt=0,5",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Sheffield Hallam University",
        "aff_unique_dep": "School of Computing and Management",
        "aff_unique_url": "https://www.shu.ac.uk",
        "aff_unique_abbr": "SHU",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Sheffield",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United Kingdom"
    },
    {
        "id": "895292",
        "title": "Spray painting of a general three-dimensional surface",
        "track": "main",
        "status": "Poster",
        "abstract": "An economic automatic system for spray painting of a general three dimensional surface is described. The spray gun is mounted on the wrist of a six degree of freedom (6 DOF) industrial robot. The system functions by the method of camera space manipulation, using two CCD cameras to scan the surface dimensions off-line, and store them in a supervisory computer in the form of nodes. An inverse kinematic program is developed and stored in the computer to calculate the trajectories of the six joints corresponding to the nodes on the surface, to acquire the correct position and orientation of the spray nozzle. The values of the joint angles are fed to the controllers of the joint motors every time interval, depending on the number of nodes and the required spray painting rate. Sensors inform the computer of the presence of the surface as well as of the home position and end of trajectory. The computer also receives sensory data from the motor controllers as spray painting of the workpiece is accomplished. The position and velocity trajectories of two surfaces with different geometries (rectangular and hemispherical) are calculated using the proposed algorithm, and plotted for each of the six joints angles.",
        "primary_area": "",
        "author": "A. Zaki;M. Eskander;A. Zaki;M. Eskander",
        "authorids": "/37089121648;/37295289100;/37089121648;/37295289100",
        "aff": "Electronics Research Institute, National Research Centre, Cairo, Egypt; Electronics Research Institute, National Research Centre, Cairo, Egypt",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895292/",
        "gs_citation": 12,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1978681296496720667&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "National Research Centre",
        "aff_unique_dep": "Electronics Research Institute",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Egypt"
    },
    {
        "id": "895262",
        "title": "Structure and growth: a model of development for grasping with robot hands",
        "track": "main",
        "status": "Poster",
        "abstract": "According to recent theories of sensorimotor development in biological systems, the dynamics of physical interaction with the world encodes control knowledge. Control is derived by reinforcing and learning to predict constructive patterns of interaction, and behavior is an artifact of coupled dynamical systems with a number of controllable degrees of freedom. For grasping and manipulation, we propose a closed-loop control process that is parametric in the number and identity of contact resources. In this paper, we show how control decisions can be made by estimating patterns of membership in a family of prototypical dynamic models. A grasp controller can thus be tuned continuously online to optimize performance over a variety of object geometries. This same process can be used to estimate the haptic category in which the object resides. We illustrate how a grasping policy that is incrementally optimal for several objects can be acquired using our Salisbury hand with tactile sensor feedback.",
        "primary_area": "",
        "author": "R.A. Grupen;J.A. Coelho;R.A. Grupen;J.A. Coelho",
        "authorids": "/37283681700;/37345215100;/37283681700;/37345215100",
        "aff": "Department of Computer Science, Laboratory for Perceptual Robotics, Amherst, MA, USA; Department of Computer Science, Laboratory for Perceptual Robotics, Amherst, MA, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895262/",
        "gs_citation": 5,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11779146860392619072&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Massachusetts Amherst",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.umass.edu",
        "aff_unique_abbr": "UMass Amherst",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Amherst",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895211",
        "title": "Study of super-mechano-colony (concept and basic experimental setup)",
        "track": "main",
        "status": "Poster",
        "abstract": "We focus on a heterogeneous robotic system of decentralized autonomous agents with a leader, which we call \"super-mechano-colony (SMC)\". It has characteristics of both hierarchical and distributed control systems. This paper explains the basic concept and a physical test bed of SMC, and discusses an example, specifically planetary rovers, for SMC.",
        "primary_area": "",
        "author": "S. Hirose;R. Damoto;A. Kawakami;S. Hirose;R. Damoto;A. Kawakami",
        "authorids": "/37273278900;/37728466200;/37556579500;/37273278900;/37728466200;/37556579500",
        "aff": "Department of Mechano-Aerospace Eng, Tokyo Institute of Technology, Meguro, Tokyo, Japan; Department of Mechano-Aerospace Eng, Tokyo Institute of Technology, Meguro, Tokyo, Japan; Department of Mechano-Aerospace Eng, Tokyo Institute of Technology, Meguro, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895211/",
        "gs_citation": 59,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15806912192656253454&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Department of Mechano-Aerospace Engineering",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Meguro, Tokyo",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895298",
        "title": "Study on slime robot (proposal of slime robot and design of slim slime robot)",
        "track": "main",
        "status": "Poster",
        "abstract": "The authors call the group of flexible deformation robots with multiple degrees of freedom \"slime robots\" (SRs). First the configuration of a robot with multiple pneumatic actuators is described. This configuration makes the most of the characteristics of a slime robot. Next the mechanism of an \"SR unit\", the minimum drive unit of a pneumatically driven slime robot, is examined experimentally. Next an \"SR module\" composed of SR units is described. An SR module is the three degrees of freedom pneumatic module with pneumatic actuators, valves, original displacement sensors and a microprocessor in its body. Lastly, as one of application of a slime robot, a \"slim slime robot (SSR)\" is described. The SSR is a mobile robot with long and thin body composed of serially connected SR modules.",
        "primary_area": "",
        "author": "H. Ohno;S. Hirose;H. Ohno;S. Hirose",
        "authorids": "/37323690500;/37273278900;/37323690500;/37273278900",
        "aff": "Department of Mechano-Aerospace Engineering, Tokyo Institute of Technology, Meguro, Tokyo, Japan; Department of Mechano-Aerospace Engineering, Tokyo Institute of Technology, Meguro, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895298/",
        "gs_citation": 71,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12178340968645517535&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Department of Mechano-Aerospace Engineering",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Meguro, Tokyo",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895302",
        "title": "Study on three-dimensional active cord mechanism: development of ACM-R2",
        "track": "main",
        "status": "Poster",
        "abstract": "Describes the development of ACM-R2, which is new version of the active cord mechanism with 3D mobility. This ACM-R2 has installed a driving mechanism called \"M-drive\". This mechanism enables the ACM-R2 to acquire a high output/mass ratio and torque limiting joints, which works as a normal joint and deforms under excessive torque. It has also installed a new type of torque sensor, the \"float differential torque sensor\" on each joint. Additionally the ACM-R2 has also a self-contained structure with control computer and battery in the joint units. These specific driving mechanisms and the self-contained structure enable ACM-R2 to demonstrate new propulsion methods and motions combining the ability of a manipulator and a locomotor.",
        "primary_area": "",
        "author": "K. Togawa;M. Mori;S. Hirose;K. Togawa;M. Mori;S. Hirose",
        "authorids": "/37446097200;/37333732100;/37273278900;/37446097200;/37333732100;/37273278900",
        "aff": "Department of Mechano-Aerospace Engineering, Tokyo Institute of Technology, Tokyo, Japan; Department of Mechano-Aerospace Engineering, Tokyo Institute of Technology, Tokyo, Japan; Department of Mechano-Aerospace Engineering, Tokyo Institute of Technology, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895302/",
        "gs_citation": 80,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15068130786770593280&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Department of Mechano-Aerospace Engineering",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Tokyo",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895228",
        "title": "Task space control for the whole arm",
        "track": "main",
        "status": "Poster",
        "abstract": "In this paper, task space control for the whole arm of a serial-chain manipulator is considered. The task space for the whole arm is interpreted in two ways, the space of rolled shapes or bunches of ordered n-frames. A rolled shape is a set of restricted points with rolling angles of links, and gives us intuitive viewpoint of the space. To represent the rolls of links, the concept of the canonical manipulator is introduced. A bunch of n-frames is a collection of frames each of which corresponds to the link orientation of the chain, and allows us to handle the space easily. A rolled spatial curve, which has a roll distribution over the curve, is used for specifying a desired rolled shape of the chain. A method generating the bunch of desired n-frames from a desired rolled curve is proposed. Based on the method, we derive a regulation law in the task space for the whole arm by Lyapunov design. The derived control law is very simple; recursive with respect to the link/joint number, and calculated by geometric operations in three-dimensional Euclidean space.",
        "primary_area": "",
        "author": "H. Mochiyama;H. Mochiyama",
        "authorids": "/37295991600;/37295991600",
        "aff": "Department of Mechanical Systems Engineering, National Defense Academy, Yokosuka, Kanagawa, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895228/",
        "gs_citation": 1,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10127674386359243450&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 2,
        "aff_unique_index": "0",
        "aff_unique_norm": "National Defense Academy",
        "aff_unique_dep": "Department of Mechanical Systems Engineering",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Yokosuka",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895271",
        "title": "The paparazzi problem",
        "track": "main",
        "status": "Poster",
        "abstract": "Multiple mobile robots, or robot collectives, have been proposed as solutions to various tasks in which distributed sensing and action are required. Here we consider applying a collective of robots to the paparazzi problem - the problem of providing sensor coverage of a target robot. We demonstrate how the computational task of the collective can be formulated as a global energy minimization task over the entire collective, and show how individual members of the collective can solve the task in a distributed fashion so that the entire collective meets its goal. This result is then extended to consider unbounded communication delays between members and complete failure of individual members of the collective.",
        "primary_area": "",
        "author": "M. Jenkin;G. Dudek;M. Jenkin;G. Dudek",
        "authorids": "/37269066400;/37274057100;/37269066400;/37274057100",
        "aff": "Department of Computer Science, York University, Toronto, ONT, Canada; Department of Computer Science, McGill University, Montreal, QUE, Canada",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895271/",
        "gs_citation": 28,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2284055786324953561&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "York University;McGill University",
        "aff_unique_dep": "Department of Computer Science;Department of Computer Science",
        "aff_unique_url": "https://www.yorku.ca;https://www.mcgill.ca",
        "aff_unique_abbr": "York U;McGill",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Toronto;Montreal",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Canada"
    },
    {
        "id": "895263",
        "title": "The self-reconfiguration of a holonic hand: the holonic regrasp",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper uses a holonic hand model introduced in our early works (1998), which is composed of 2-stems-of-links-1-joint nonconvex biped planar holons working in colony in order to perform dexterous grasps. This paper focuses on the reconfiguration control of the colony that we structure as a sequence of planar grasp operations defining a holonic regrasp, which uses a graph theoretic formalization of configuration changes that occur in this holonic hand during this regrasping phase.",
        "primary_area": "",
        "author": "M. Durna;A.M. Erkmen;I. Erkmen;M. Durna;A.M. Erkmen;I. Erkmen",
        "authorids": "/37449042600;/37265860800;/37283557700;/37449042600;/37265860800;/37283557700",
        "aff": "Electrical And Electronics Department, Middle East Technical University, Ankara, Turkey; A.M. Erkmen; Electrical And Electronics Department, Middle East Technical University, Ankara, Turkey",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895263/",
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5263722783281655746&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Middle East Technical University;",
        "aff_unique_dep": "Electrical And Electronics Department;",
        "aff_unique_url": "https://www.metu.edu.tr;",
        "aff_unique_abbr": "METU;",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Ankara;",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Turkey;"
    },
    {
        "id": "895275",
        "title": "Towards cognitive agents: embodiment based object recognition for vision-based mobile agents",
        "track": "main",
        "status": "Poster",
        "abstract": "We propose a new architecture for recognizing objects based on a concept of \"embodiment\" as one of primitive functions for a cognitive robot. We define the term \"embodiment\" as the size and shape of the agent's body, locomotive ability and its sensor. According to embodiment, an object is represented by reaching action paths, which correspond to a set of sequences of movements taken by the agent for reaching the object. Visual information is used to obtain sensorimotor mapping which represents the relationship between the change of object's appearance and the movement of the agent. On the other hands, tactile information is utilized to evaluate the change of physical condition of the object caused by such movement. By means of this method, the agent can recognize an object without depending on its position and orientation in the environment. The experimental result of computer simulation is shown to validate the method.",
        "primary_area": "",
        "author": "K. Terada;T. Nakamura;H. Takeda;T. Ogasawara;K. Terada;T. Nakamura;H. Takeda;T. Ogasawara",
        "authorids": "/37286158900;/37439855800;/37290918000;/37269488400;/37286158900;/37439855800;/37290918000;/37269488400",
        "aff": "Department of Information Systems, Nara Institute of Science and Technology, Ikoma, Nara, Japan; Department of Information Systems, Nara Institute of Science and Technology, Ikoma, Nara, Japan; National Institute of Information, Chiyoda, Tokyo, Japan; Department of Information Systems, Nara Institute of Science and Technology, Ikoma, Nara, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895275/",
        "gs_citation": 5,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12958211798348755799&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;0",
        "aff_unique_norm": "Nara Institute of Science and Technology;National Institute of Information",
        "aff_unique_dep": "Department of Information Systems;",
        "aff_unique_url": "https://www.nist.go.jp;https://www.nii.ac.jp",
        "aff_unique_abbr": "NIST;NII",
        "aff_campus_unique_index": "0;0;1;0",
        "aff_campus_unique": "Ikoma;Tokyo",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895307",
        "title": "Traffic signal networks simulator with learning emotional algorithm",
        "track": "main",
        "status": "Poster",
        "abstract": "Proposes traffic signal networks, which optimize the traffic flow by estimation of the driver's mind. The proposed simulator applies the emotional algorithm to determine the performance of each traffic signal individually and to avoid the traffic jam around it. The emotional algorithm estimates the emotional value based on the emotional functions, which are defined on the emotional space. The emotional space consists of four factors, \"happy\" \"relief,\" \"afraid\" and \"angry,\" and provides the emotional states of the system by the value of it. The emotional function evaluates and imitates the state of driver's mind, and aims at not inflicting psychological stress on the driver. This report proposes the principal architecture of the emotional algorithm and some simulators to use it to decide its performance of the traffic signal system. The numerical simulations clear the effectiveness of the proposed emotional algorithm and the applied system. The learning simulator, of which parameters dynamically change by evaluating the congestion of a road, especially shows the excellent performance. Date environment analysis is a good learning method to optimize the parameters in the emotional algorithm by simulation results.",
        "primary_area": "",
        "author": "H. Ishihara;T. Fukuda;H. Ishihara;T. Fukuda",
        "authorids": "/37339209600;/37279174500;/37339209600;/37279174500",
        "aff": "Department of Intelligent Mechanical System Engineering, Kagawa University, Kagawa, Japan; Center for Cooperative Research in Advanced Science and Technology, University of Nagoya, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895307/",
        "gs_citation": 9,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9785727725906125372&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;1",
        "aff_unique_norm": "Kagawa University;University of Nagoya",
        "aff_unique_dep": "Department of Intelligent Mechanical System Engineering;Center for Cooperative Research in Advanced Science and Technology",
        "aff_unique_url": "https://www.kagawa-u.ac.jp;https://www.nagoya-u.ac.jp",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Kagawa;",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895317",
        "title": "Trajectory planning for cooperative multiple manipulators with passive joints",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper proposes an algorithm to determine suboptimal paths and trajectories for cooperative multiple manipulators with passive joints. The problem of operating and transferring the object from a given start point to a given goal point is considered. In this case, in general, degrees of freedom of the manipulators are larger than that of the object, and thus this manipulator system involves redundancy. Several joints can be changed to passive ones. We use remaining redundant degrees of freedom to refine trajectories. We apply this algorithm to a two-manipulators system. Simulation results show the effectiveness of the algorithm.",
        "primary_area": "",
        "author": "G. Hirano;M. Yamamoto;A. Mohri;G. Hirano;M. Yamamoto;A. Mohri",
        "authorids": "/37330601500;/37279875200;/37275989300;/37330601500;/37279875200;/37275989300",
        "aff": "Department of Intelligent Machinery and Systems, Faculty of Engineering, Kyushu University, Fukuoka, Japan; Department of Intelligent Machinery and Systems, Faculty of Engineering, Kyushu University, Fukuoka, Japan; Department of Intelligent Machinery and Systems, Faculty of Engineering, Kyushu University, Fukuoka, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895317/",
        "gs_citation": 7,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18174599628075322506&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Kyushu University",
        "aff_unique_dep": "Department of Intelligent Machinery and Systems",
        "aff_unique_url": "https://www.kyushu-u.ac.jp",
        "aff_unique_abbr": "Kyushu U",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Fukuoka",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895243",
        "title": "Uncalibrated hybrid force-vision manipulation",
        "track": "main",
        "status": "Poster",
        "abstract": "We present a method employing hybrid force and vision based control to effect a sequence of contact manipulations. Instead of requiring a-priori object and environment models, force sensing is used to simultaneously update a surface model while controlling the manipulator. This is incorporated into an uncalibrated visual servoing system, which also estimates the visual-motor coordinate transform. The result is a hybrid force-vision controller which does not need any a-priori robot, camera, object or environment models. The approach is validated experimentally using an IMI Zebra robot arm.",
        "primary_area": "",
        "author": "A. Pichler;M. Jagersand;A. Pichler;M. Jagersand",
        "authorids": "/37087333308;/37269568300;/37087333308;/37269568300",
        "aff": "CS Department, Johns Hopkins University, Baltimore, MD, USA; CS Department, Johns Hopkins University, Baltimore, MD, USA",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895243/",
        "gs_citation": 39,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15870036497889952293&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 4,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Johns Hopkins University",
        "aff_unique_dep": "CS Department",
        "aff_unique_url": "https://www.jhu.edu",
        "aff_unique_abbr": "JHU",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Baltimore",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "895214",
        "title": "Underactuated crawling robot",
        "track": "main",
        "status": "Poster",
        "abstract": "Underactuated systems are those processing fewer actuators than degrees of freedom. Decrease of the number of actuators is a merit from the point of view of size and weight of the system. But generally it is difficult to control the underactuated system. In this paper we realize crawling motion by an underactuated robot. Control law based on partial feedback linearization is proposed and stability of the closed-loop system is discussed on the basis of zero dynamics. To demonstrate the effectiveness of the proposed controller experiments have been carried out.",
        "primary_area": "",
        "author": "K. Ito;F. Matsuno;R. Takahashi;K. Ito;F. Matsuno;R. Takahashi",
        "authorids": "/37278680300;/37277023100;/37731343200;/37278680300;/37277023100;/37731343200",
        "aff": "Department of Computational Intelligence and Systems Science, Tokyo Institute of Technology, Yokohama, Japan; Department of Computational Intelligence and Systems Science, Tokyo Institute of Technology, Yokohama, Japan; Department of Computational Intelligence and Systems Science, Tokyo Institute of Technology, Yokohama, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895214/",
        "gs_citation": 22,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8900203177317980549&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Department of Computational Intelligence and Systems Science",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Yokohama",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895286",
        "title": "Understanding and learning of gestures through human-robot interaction",
        "track": "main",
        "status": "Poster",
        "abstract": "Humans can communicate with each other by gestures. This paper presents a robot system with such capability. The robot detects its user by recognizing his/her face. It can accept his/her commands given by gestures. The user may use unknown gestures to the robot. If the robot does not respond to his/her gesture, the user usually iterates the same gesture. The robot detects this repetitive pattern as an intentional gesture by which the user wants to give it some order. Then it shows a little action according to the meaning of the gesture that the robot guesses. It observes the user's reaction to its action. If he/she continues the same pattern gesture, the robot considers that its understanding is right, completing the action. It also registers the pattern as a gesture of the guessed meaning. Otherwise, it iterates the same procedure by taking another action as a candidate of the meaning. We have implemented such interactive capability on our intelligent wheelchair.",
        "primary_area": "",
        "author": "Y. Kuno;T. Murashima;N. Shimada;Y. Shirai;Y. Kuno;T. Murashima;N. Shimada;Y. Shirai",
        "authorids": "/37274198500;/37433317600;/37269959300;/37269955100;/37274198500;/37433317600;/37269959300;/37269955100",
        "aff": "Department of Information and Computer Sciences, Saitama University, Saitama, Japan; Department of Computer-Controlled Mechanical Systems, Osaka University, Suita, Osaka, Japan; Department of Computer-Controlled Mechanical Systems, Osaka University, Suita, Osaka, Japan; Department of Computer-Controlled Mechanical Systems, Osaka University, Suita, Osaka, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895286/",
        "gs_citation": 10,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=89665112633280331&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 0,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;1;1;1",
        "aff_unique_norm": "Saitama University;Osaka University",
        "aff_unique_dep": "Department of Information and Computer Sciences;Department of Computer-Controlled Mechanical Systems",
        "aff_unique_url": "https://www.saitama-u.ac.jp;https://www.osaka-u.ac.jp",
        "aff_unique_abbr": "Saitama U;Osaka U",
        "aff_campus_unique_index": "0;1;1;1",
        "aff_campus_unique": "Saitama;Suita",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895287",
        "title": "User adaptation of human-robot interaction model based on Bayesian network and introspection of interaction experience",
        "track": "main",
        "status": "Poster",
        "abstract": "We propose a behavior learning method based on Bayesian networks and experience of interaction between human and robots, which does not need a priori knowledge and can be applied to human-robot interaction models. In this method, the behavior learning based on interaction experience was established. However, developers must adjust initial sensor state of the Bayesian network according to the user preference. In this paper, we propose a new method of state space construction for user adaptation based on introspection of interaction experience using genetic algorithms. We also give two examples: 1) obstacle avoidance tasks for mobile robots; and 2) symbol grounding for natural language instruction, for realization of user's adaptation of human-robot interaction.",
        "primary_area": "",
        "author": "T. Inamura;M. Inabe;H. Inoue;T. Inamura;M. Inabe;H. Inoue",
        "authorids": "/37294612600;/37086984469;/37280631000;/37294612600;/37086984469;/37280631000",
        "aff": "Tokyo Daigaku, Bunkyo-ku, Tokyo, JP; Tokyo Daigaku, Bunkyo-ku, Tokyo, JP; H. Inoue",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895287/",
        "gs_citation": 40,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=345107699136115210&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Tokyo;",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.u-tokyo.ac.jp;",
        "aff_unique_abbr": "UTokyo;",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tokyo;",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan;"
    },
    {
        "id": "895256",
        "title": "Versatile water hydraulic motor driven by tap water",
        "track": "main",
        "status": "Poster",
        "abstract": "This paper proposes new types of a water hydraulic motor and a valve to control its speed which will be applied to the robots soaked in water. The big advantage of this motor is that it can be driven by such low pressure as tap water with high performance. The key of their mechanism is that the working fluid is completely wrapped by the soft tube and their machine moving parts contact the fluid indirectly. In other words, the deformation of the tube drives the motor, and reversely the valve makes the tube deformed to control the motor, which removes the risk of leakage without also requiring a seal. In addition, the valve to control the rotational speed is designed which can be driven by fluid power signal without using electricity. The motors can be used in places where electricity cannot be used safely, such as bathroom, sink, workshop over water, under water, etc. The basic driving principle and characteristics of the theoretical torque, the rotational speed, and the efficiency are described here with the results of the experiment.",
        "primary_area": "",
        "author": "H. Tsukagoshi;S. Nozaki;A. Kitagawa;H. Tsukagoshi;S. Nozaki;A. Kitagawa",
        "authorids": "/37274012400;/38024012500;/37274011300;/37274012400;/38024012500;/37274011300",
        "aff": "Department of Control and Systems Engineering, Tokyo Institute of Technology, Tokyo, Japan; Department of Control and Systems Engineering, Tokyo Institute of Technology, Tokyo, Japan; Department of Control and Systems Engineering, Tokyo Institute of Technology, Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895256/",
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7653358220081018355&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 6,
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Tokyo Institute of Technology",
        "aff_unique_dep": "Department of Control and Systems Engineering",
        "aff_unique_url": "https://www.titech.ac.jp",
        "aff_unique_abbr": "Titech",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Tokyo",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895217",
        "title": "View-based approach to robot navigation",
        "track": "main",
        "status": "Poster",
        "abstract": "Recently, view-based or appearance-based approaches have been attracting the interests of computer vision research. Based on a similar idea, we have proposed a view-based navigation method using a model of the route called the \"view sequence.\" It contains a sequence of frontal views along a route memorized in the teaching run, and the recognition of the environment is realized based on the matching of the current view and memorized view sequence. In this paper, we discuss the required characteristics of the view for the view sequence, and evaluate our former method of generating views. Then we confirm that the stereo disparity satisfies the requirement of the view sequence through an experiment, and the disparity view sequence is applied for outdoor navigation. The experimental results indicate such views other than normal camera images can be utilized for our view-based navigation method.",
        "primary_area": "",
        "author": "Y. Matsumoto;K. Sakai;M. Inaba;H. Inoue;Y. Matsumoto;K. Sakai;M. Inaba;H. Inoue",
        "authorids": "/37272999900;/37615809500;/37286658200;/37280631000;/37272999900;/37615809500;/37286658200;/37280631000",
        "aff": "Graduate School of Information Science, Nara Institute of Science and Technology, Ikoma, Nara, Japan; Graduate School of Information Science, Nara Institute of Science and Technology, Ikoma, Nara, Japan; University of Tokyo, Japan; University of Tokyo, Japan",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895217/",
        "gs_citation": 159,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14292681148547812608&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;1;1",
        "aff_unique_norm": "Nara Institute of Science and Technology;University of Tokyo",
        "aff_unique_dep": "Graduate School of Information Science;",
        "aff_unique_url": "https://www.nist.go.jp;https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "NIST;UTokyo",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Ikoma;",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "895290",
        "title": "Visual sensing and recognition of welding environment for intelligent shipyard welding robots",
        "track": "main",
        "status": "Poster",
        "abstract": "Automation of welding process in shipyard is ultimately necessary, since welding site is spatially enclosed by floors and girders, and therefore welding operators are exposed to hostile working conditions. To solve this problem, recently a robotic welding system for closed block assembly has been developed. For complete autonomy, this system needs a sensor system for the weld seam tracking and the recognition of the working environments. In this paper, a three-dimensional laser vision system is developed based on the optical triangulation technology in order to provide robots with work environmental map. This sensor system composed of three laser stripes and two visions is used to detect the welding positions and to recognize the 3D shape of the welding environments. The algorithm architecture for the welding environment recognition is divided into two parts. The first is the conventional 3D scanning module, and the second the plane generation module utilizing a Hough transform. The design of the sensor system and the algorithm for sensing the structured environment are described and discussed in detail.",
        "primary_area": "",
        "author": "Min Young Kim;Kuk-Won Ko;Hyung Suck Cho;Jae-Hoon Kim;Min Young Kim;Kuk-Won Ko;Hyung Suck Cho;Jae-Hoon Kim",
        "authorids": "/37087489667;/37087164674;/37087165930;/37087216376;/37087489667;/37087164674;/37087165930;/37087216376",
        "aff": "Department of Mechanical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, South Korea; Department of Mechanical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, South Korea; Department of Mechanical Engineering, Korea Advanced Institute of Science and Technology, Daejeon, South Korea; Automation Research Department, Samsung Heavy Industries Company Limited, Koje, South Korea",
        "bibtex": "",
        "pdf": "",
        "site": "https://ieeexplore.ieee.org/document/895290/",
        "gs_citation": 45,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9491183704281385959&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "email": "",
        "github": "",
        "project": "",
        "author_num": 8,
        "aff_unique_index": "0;0;0;1",
        "aff_unique_norm": "Korea Advanced Institute of Science and Technology;Samsung Heavy Industries Company Limited",
        "aff_unique_dep": "Department of Mechanical Engineering;Automation Research Department",
        "aff_unique_url": "https://www.kaist.ac.kr;https://www.samsunghi.com",
        "aff_unique_abbr": "KAIST;SHI",
        "aff_campus_unique_index": "0;0;0;1",
        "aff_campus_unique": "Daejeon;Koje",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "South Korea"
    }
]