[
    {
        "id": "d5b327bfbb",
        "title": "A Framework for Push-Grasping in Clutter",
        "site": "https://www.roboticsproceedings.org/rss07/p09.html",
        "author": "Mehmet Dogar; Siddhartha Srinivasa",
        "abstract": "Humans use a remarkable set of strategies to manipulate objects in clutter. We pick up, push, slide, and sweep with our hands and arms to rearrange clutter surrounding our primary task. But our robots treat the world like the Tower of Hanoi - moving with pick-and-place actions and fearful to interact with it with anything but rigid grasps. This produces inefficient plans and is often inapplicable with heavy, large, or otherwise ungraspable objects. We introduce a framework for planning in clutter that uses a library of actions inspired by human strategies. The action library is derived analytically from the mechanics of pushing and is provably conservative. The framework reduces the problem to one of combinatorial search, and demonstrates planning times on the order of seconds. With the extra functionality, our planner succeeds where traditional grasp planners fail, and works under high uncertainty by utilizing the funneling effect of pushing. We demonstrate our results with experiments in simulation and on HERB, a robotic platform developed at the Personal Robotics Lab at  Carnegie Mellon University.",
        "bibtex": "@INPROCEEDINGS{Dogar-RSS-11, \r\n    AUTHOR    = {Mehmet Dogar AND Siddhartha Srinivasa}, \r\n    TITLE     = {A Framework for Push-Grasping in Clutter}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.009} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p09.pdf",
        "supp": "",
        "pdf_size": 2382286,
        "gs_citation": 304,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4221568802108072405&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 21,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University",
        "aff_domain": "cs.cmu.edu;cs.cmu.edu",
        "email": "cs.cmu.edu;cs.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "8cbac342eb",
        "title": "A Linear Approximation for Graph-based Simultaneous Localization and Mapping",
        "site": "https://www.roboticsproceedings.org/rss07/p06.html",
        "author": "Luca Carlone; Rosario Aragues; Jose Castellanos; Basilio Bona",
        "abstract": "This article investigates the problem of Simultaneous  Localization and Mapping (SLAM) from the perspective of linear  estimation theory. The problem is first formulated in terms of  graph embedding: a graph describing robot poses at subsequent  instants of time needs be embedded in a three-dimensional space,  assuring  that  the  estimated  configuration  maximizes  measurement likelihood. Combining tools belonging to linear estimation  and  graph  theory,  a  closed-form  approximation  to  the  full  SLAM  problem  is  proposed,  under  the  assumption  that  the  relative position and the relative orientation measurements are  independent. The approach needs no initial guess for optimization  and is formally proven to admit solution under the SLAM setup.  The resulting estimate can be used as an approximation of the  actual nonlinear solution or can be further refined by using it  as an initial guess for nonlinear optimization techniques. Finally,  the experimental analysis demonstrates that such refinement is  often unnecessary, since the linear estimate is already accurate.",
        "bibtex": "@INPROCEEDINGS{Carlone-RSS-11, \r\n    AUTHOR    = {Luca Carlone AND Rosario Aragues AND Jose Castellanos AND Basilio Bona}, \r\n    TITLE     = {A Linear Approximation for Graph-based Simultaneous Localization and Mapping}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.006} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p06.pdf",
        "supp": "",
        "pdf_size": 256897,
        "gs_citation": 139,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11096880222980674542&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 16,
        "aff": "CSPP, Laboratorio di Meccatronica, Politecnico di Torino, Torino, Italy; Departamento de Informática e Ingeniería de Sistemas, Instituto de Investigación en Ingeniería de Aragón, Universidad de Zaragoza, Zaragoza, Spain; Departamento de Informática e Ingeniería de Sistemas, Instituto de Investigación en Ingeniería de Aragón, Universidad de Zaragoza, Zaragoza, Spain; Dipartimento di Automatica e Informatica, Politecnico di Torino, Torino, Italy",
        "aff_domain": "polito.it;unizar.es;unizar.es;polito.it",
        "email": "polito.it;unizar.es;unizar.es;polito.it",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;0",
        "aff_unique_norm": "Politecnico di Torino;Universidad de Zaragoza",
        "aff_unique_dep": "Laboratorio di Meccatronica;Departamento de Informática e Ingeniería de Sistemas",
        "aff_unique_url": "https://www.polito.it;https://www.unizar.es",
        "aff_unique_abbr": "Polito;UniZar",
        "aff_campus_unique_index": "0;1;1;0",
        "aff_campus_unique": "Torino;Zaragoza",
        "aff_country_unique_index": "0;1;1;0",
        "aff_country_unique": "Italy;Spain"
    },
    {
        "id": "9606f89338",
        "title": "A Serial Approach to Handling High-Dimensional Measurements in the Sigma-Point Kalman Filter",
        "site": "https://www.roboticsproceedings.org/rss07/p29.html",
        "author": "Colin McManus; Timothy Barfoot",
        "abstract": "Pose estimation is a critical skill in mobile robotics and is often accomplished using onboard sensors and a Kalman filter estimation technique. For systems to run online, computational efficiency of the filter design is crucial, especially when faced with limited computing resources. In this paper, we present a novel approach to serially process high-dimensional measurements in the Sigma-Point Kalman Filter (SPKF), in order to achieve a low computational cost that is linear is the measurement dimension. Although the concept of serially processing measurements has been around for quite some time in the context of the Extended Kalman Filter (EKF), few have considered this approach with the SPKF. At first glance, it may be tempting to apply the SPKF update step serially. However, we prove that without re-drawing sigma points, this `naive' approach cannot guarantee the positive-definiteness of the state covariance matrix (not the case for the EKF). We then introduce a novel method for the Sigma-Point Kalman Filter to process high-dimensional, uncorrelated measurements serially that is algebraically equivalent to processing the measurements in parallel, but still achieves a computational cost linear in the measurement dimension.",
        "bibtex": "@INPROCEEDINGS{McManus-RSS-11, \r\n    AUTHOR    = {Colin McManus AND Timothy Barfoot}, \r\n    TITLE     = {A Serial Approach to Handling High-Dimensional Measurements in the Sigma-Point Kalman Filter}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.029} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p29.pdf",
        "supp": "",
        "pdf_size": 468497,
        "gs_citation": 10,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3133370530389505324&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Institute for Aerospace Studies, University of Toronto, Toronto, Canada; Institute for Aerospace Studies, University of Toronto, Toronto, Canada",
        "aff_domain": "utoronto.ca;utoronto.ca",
        "email": "utoronto.ca;utoronto.ca",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Toronto",
        "aff_unique_dep": "Institute for Aerospace Studies",
        "aff_unique_url": "https://www.utoronto.ca",
        "aff_unique_abbr": "U of T",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Toronto",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Canada"
    },
    {
        "id": "de496fa9c7",
        "title": "An Analytic Motion Planning Solution for the Snakeboard",
        "site": "https://www.roboticsproceedings.org/rss07/p38.html",
        "author": "Elie Shammas; Mauricio de Oliveira",
        "abstract": "This paper provides a closed-form analytical solution to the motion planning problem for the Snakeboard. Given a desired planar trajectory in the fiber space, an explicit solution is computed for the gaits in the base space that locomote the Snakeboard along the desired trajectory. This is achieved by introducing a new momentum-like variable that simplifies the Snakeboard's equations of motion to allow for such an explicit gait generation technique.",
        "bibtex": "@INPROCEEDINGS{Shammas-A-RSS-11, \r\n    AUTHOR    = {Elie Shammas AND Mauricio de Oliveira}, \r\n    TITLE     = {An Analytic Motion Planning Solution for the Snakeboard}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.038} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p38.pdf",
        "supp": "",
        "pdf_size": 334544,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7959859600506921489&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "Department of Mechanical Engineering, American University of Beirut; Department of Mechanical and Aerospace Engineering, University of California San Diego",
        "aff_domain": "aub.edu.lb;ucsd.edu",
        "email": "aub.edu.lb;ucsd.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1",
        "aff_unique_norm": "Department of Mechanical Engineering, American University of Beirut;Department of Mechanical and Aerospace Engineering, University of California San Diego",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "66dc816233",
        "title": "An Art Gallery Approach to Ensuring that Landmarks are Distinguishable",
        "site": "https://www.roboticsproceedings.org/rss07/p11.html",
        "author": "Lawrence Erickson; Steven LaValle",
        "abstract": "How many different classes of partially distinguishable landmarks are needed to ensure that a robot can always see a landmark without simultaneously seeing two of the same class? To study this, we introduce the chromatic art gallery problem. A guardset $S \\subset P$ is a set of points in a polygon $P$ such that for all $p \\in P$, there exists an $s \\in S$ such that $s$ and $p$ are mutually visible. Suppose that two members of a finite guard set $S \\subset P$ must be given different colors if their visible regions overlap. What is the minimum number of colors required to color any guard set (not necessarily a minimal guard set) of a polygon $P$? We call this number, $\\chi_G(P)$, the chromatic guard number of $P$. We believe this problem has never been examined before, and it has potential applications to robotics, surveillance, sensor networks, and other areas. We show that for any spiral polygon $P_{spi}, \\chi_G(P_{spi}) \\leq 2$, and for any staircase polygon (strictly monotone orthogonal polygon) $P_{sta}, \\chi_G(P_{sta}) \\leq 3$. For lower bounds, we construct a polygon with $ 4k $ vertices that requires $k$ colors. We also show that for any positive integer $k$, there exists a monotone polygon $M_k$ with $ 3k^ 2$ vertices such that $\\chi_G(M_k) \\geq k$, and for any odd integer $k$, there exists an orthogonal polygon $ R _ k $ with $ 4k ^ 2 + 10k + 10$ vertices such that $ \\ chi _ G(R _ k) \\geq k$.",
        "bibtex": "@INPROCEEDINGS{Erickson-RSS-11, \r\n    AUTHOR    = {Lawrence Erickson AND Steven LaValle}, \r\n    TITLE     = {An Art Gallery Approach to Ensuring that Landmarks are Distinguishable}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.011} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p11.pdf",
        "supp": "",
        "pdf_size": 177401,
        "gs_citation": 39,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10188331156879117150&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 22,
        "aff": "Department of Computer Science, University of Illinois at Urbana-Champaign; Department of Computer Science, University of Illinois at Urbana-Champaign",
        "aff_domain": "uiuc.edu;uiuc.edu",
        "email": "uiuc.edu;uiuc.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Illinois at Urbana-Champaign",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://illinois.edu",
        "aff_unique_abbr": "UIUC",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Urbana-Champaign",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "2980e4cbaa",
        "title": "An Interaction Design Framework for Social Robots",
        "site": "https://www.roboticsproceedings.org/rss07/p14.html",
        "author": "Dylan Glas; Satoru Satake; Takayuki Kanda; Norihiro Hagita",
        "abstract": "We present a novel design framework enabling the development of social robotics applications by cross-disciplinary teams of programmers and interaction designers. By combining a modular back-end software architecture with an easy-to-use graphical interface for developing interaction sequences, this system enables programmers and designers to work in parallel to develop robot applications and tune the subtle details of social behaviors. In this paper, we describe the structure of our design framework, and we present an experimental evaluation of our system showing that it increases the effectiveness of programmer-designer teams developing social robot applications.",
        "bibtex": "@INPROCEEDINGS{Glas-RSS-11, \r\n    AUTHOR    = {Dylan Glas AND Satoru Satake AND Takayuki Kanda AND Norihiro Hagita}, \r\n    TITLE     = {An Interaction Design Framework for Social Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.014} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p14.pdf",
        "supp": "",
        "pdf_size": 845591,
        "gs_citation": 96,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15103695160766099051&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 15,
        "aff": "Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan",
        "aff_domain": "atr.jp;atr.jp;atr.jp;atr.jp",
        "email": "atr.jp;atr.jp;atr.jp;atr.jp",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "ATR",
        "aff_unique_dep": "Intelligent Robotics and Communication Laboratories",
        "aff_unique_url": "https://www.atr.jp",
        "aff_unique_abbr": "ATR",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Kyoto",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "892ecde245",
        "title": "Assisted Teleoperation Strategies for Aggressively Controlling a Robot Arm with 2D Input",
        "site": "https://www.roboticsproceedings.org/rss07/p45.html",
        "author": "Erkang You; Kris Hauser",
        "abstract": "This paper studies assisted teleoperation techniques for controlling a 6DOF robot arm using click-and-drag input from a computer mouse. Experiments were conducted to investigate how task performance and user preferences are affected by low-level motion control strategies, which must deal with collision avoidance, dynamics constraints, and erroneous input. Five strategies were implemented and compared. As baseline strategies we study direct joint control and Cartesian positioning via inverse kinematics. We also implemented three obstacle avoidance strategies, including a predictive safety filter, a reactive potential field, and a real-time sample-based motion planner. Blind experimental trials assigned 22 novice subjects to five subgroups corresponding to each strategy and asked them to control the arm in simulation on a variety of reaching tasks in cluttered environments. Unsurprisingly, the obstacle avoidance strategies achieve major safety improvements, although subjects felt noticeably less in control of the robot than those using the baseline methods. The motion planning strategy shows the most promise; it completed tasks twice as fast as any other method and received high ratings for perceived safety, cooperativeness, and overall satisfaction.",
        "bibtex": "@INPROCEEDINGS{You-RSS-11, \r\n    AUTHOR    = {Erkang You AND Kris Hauser}, \r\n    TITLE     = {Assisted Teleoperation Strategies for Aggressively Controlling a Robot Arm with 2D Input}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.045} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p45.pdf",
        "supp": "",
        "pdf_size": 1889072,
        "gs_citation": 89,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4539467107058360478&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 16,
        "aff": "School of Informatics and Computing, Indiana University at Bloomington; School of Informatics and Computing, Indiana University at Bloomington",
        "aff_domain": "indiana.edu;indiana.edu",
        "email": "indiana.edu;indiana.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "School of Informatics and Computing, Indiana University at Bloomington",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "dbcff05d0c",
        "title": "Automatic Calibration of Multiple Coplanar Sensors",
        "site": "https://www.roboticsproceedings.org/rss07/p05.html",
        "author": "Jonathan Brookshire; Seth Teller",
        "abstract": "This paper describes an algorithm for recovering the rigid  3-DOF transformation (offset and rotation) between  pairs of sensors mounted rigidly in a common plane on a mobile  robot.  The algorithm requires only a set of sensor observations  made as the robot moves along a suitable path. Our method does  not require synchronized sensors; nor does it require complete  metrical reconstruction of the environment or the sensor path.  We show that incremental pose measurements alone are  sufficient to recover sensor calibration through nonlinear least  squares estimation. We use the Fisher Information Matrix to  compute a Cramer-Rao lower bound (CRLB) for the resulting  calibration.    Applying the algorithm in practice requires a non-degenerate motion  path, a principled procedure for estimating per-sensor pose displacements  and their covariances, a way to temporally resample  asynchronous sensor data, and a way to assess the quality of  the recovered calibration. We give constructive methods  for each step.  We demonstrate and validate the end-to-end  calibration procedure for both simulated and real LIDAR and  inertial data, achieving CRLBs, and corresponding calibrations,  accurate to millimeters and milliradians.  Source code is   available from http://rvsn.csail.mit.edu/calibration.",
        "bibtex": "@INPROCEEDINGS{Brookshire-RSS-11, \r\n    AUTHOR    = {Jonathan Brookshire AND Seth Teller}, \r\n    TITLE     = {Automatic Calibration of Multiple Coplanar Sensors}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.005} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p05.pdf",
        "supp": "",
        "pdf_size": 446321,
        "gs_citation": 42,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17854840757257614742&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 17,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "http://rvsn.csail.mit.edu/calibration",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "093a06d211",
        "title": "Bilateral Teleoperation of Groups of UAVs with Decentralized Connectivity Maintenance",
        "site": "https://www.roboticsproceedings.org/rss07/p13.html",
        "author": "Paolo Robuffo Giordano; Antonio Franchi;  Cristian Secchi;  Heinrich B&uumllthoff",
        "abstract": "In this paper, we present a decentralized passivity-based control strategy for the bilateral teleoperation of a group of Unmanned Aerial Vehicles (UAVs). The human operator at the master side can command the group motion and receive suitable force cues informative about the remote environment. By properly controlling the energy exchanged within the slave side (the UAV group), we guarantee that the connectivity of the group is preserved and we prevent inter-agent and obstacle collisions. At the same time, we allow the behavior of the UAVs to be as flexible as possible with arbitrary split and join maneuvers. The results of the paper are validated by means of human/hardware-in-the-loop (HHIL) simulations.",
        "bibtex": "@INPROCEEDINGS{Giordano-RSS-11, \r\n    AUTHOR    = {Paolo Robuffo Giordano AND Antonio Franchi AND  Cristian Secchi AND  Heinrich B&uumllthoff}, \r\n    TITLE     = {Bilateral Teleoperation of Groups of UAVs with Decentralized Connectivity Maintenance}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.013} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p13.pdf",
        "supp": "",
        "pdf_size": 2004963,
        "gs_citation": 32,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5602033343733321730&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 22,
        "aff": "Max Planck Institute for Biological Cybernetics, Tübingen, Germany; Max Planck Institute for Biological Cybernetics, Tübingen, Germany; Department of Science and Methods of Engineering, University of Modena and Reggio Emilia, Italy; Max Planck Institute for Biological Cybernetics, Tübingen, Germany + Department of Brain and Cognitive Engineering, Korea University",
        "aff_domain": "tuebingen.mpg.de;tuebingen.mpg.de;unimore.it;tuebingen.mpg.de",
        "email": "tuebingen.mpg.de;tuebingen.mpg.de;unimore.it;tuebingen.mpg.de",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;0+2",
        "aff_unique_norm": "Max Planck Institute for Biological Cybernetics;University of Modena and Reggio Emilia;Department of Brain and Cognitive Engineering, Korea University",
        "aff_unique_dep": ";Department of Science and Methods of Engineering;",
        "aff_unique_url": "https://www.biocybernetics.mpg.de;https://www.unimore.it;",
        "aff_unique_abbr": "MPIBC;;",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Tübingen;",
        "aff_country_unique_index": "0;0;1;0",
        "aff_country_unique": "Germany;Italy;"
    },
    {
        "id": "fb68c745d4",
        "title": "Collision-Free and Curvature-Continuous Path Smoothing In Cluttered Environments",
        "site": "https://www.roboticsproceedings.org/rss07/p32.html",
        "author": "Jia Pan; Liangjun Zhang; Dinesh Manocha",
        "abstract": "We present a novel trajectory computation algorithm  to smoothen jerky collision-free paths computed by samplebased  motion planners. Our approach uses cubic B-splines to  generate G2 or curvature continuous trajectories. The algorithm  performs local spline refinement to compute collision-free trajectories  in narrow passages and satisfies velocity and acceleration  constraints. We also present a fast and reliable algorithm for  collision checking between robot and the environment along  the B-spline trajectories. We highlight the performance of our  algorithm on complex benchmarks, including path computation  for rigid and articulated models in tight spaces and narrow  passages.",
        "bibtex": "@INPROCEEDINGS{Pan-RSS-11, \r\n    AUTHOR    = {Jia Pan AND Liangjun Zhang AND Dinesh Manocha}, \r\n    TITLE     = {Collision-Free and Curvature-Continuous Path Smoothing In Cluttered Environments}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.032} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p32.pdf",
        "supp": "",
        "pdf_size": 2238142,
        "gs_citation": 27,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5841362801820444192&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 19,
        "aff": "Dept. of Computer Science, University of North Carolina at Chapel Hill; Dept. of Computer Science, Stanford University; Dept. of Computer Science, University of North Carolina at Chapel Hill",
        "aff_domain": "cs.unc.edu;stanford.edu;cs.unc.edu",
        "email": "cs.unc.edu;stanford.edu;cs.unc.edu",
        "github": "",
        "project": "http://gamma.cs.unc.edu/SPATH",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "Dept. of Computer Science, University of North Carolina at Chapel Hill;Stanford University",
        "aff_unique_dep": ";Department of Computer Science",
        "aff_unique_url": ";https://www.stanford.edu",
        "aff_unique_abbr": ";Stanford",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Stanford",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "aa1be720fe",
        "title": "Comparing Heads-up, Hands-free Operation of Ground Robots to Teleoperation",
        "site": "https://www.roboticsproceedings.org/rss07/p27.html",
        "author": "Matthew Marge; Aaron Powers;  Jonathan Brookshire; Trevor Jay; Odest Jenkins; Christopher Geyer",
        "abstract": "Today, most commercially available UGVs use teleoperation for control. Under teleoperation, users' hands are occupied holding a handheld controller to operate the UGV, and their attention is focused on what the robot is doing. In this paper, we propose an alternative called Heads-up, Hands-free Operation, which allows an operator to control a UGV using operator following behaviors and a gesture interface. We explore whether Heads-up, Hands-free Operation is an improvement over teleoperation. In a study of 30 participants, we found that when operators used these modes of interaction, they performed missions faster, they could recall their surroundings better, and they had a lower cognitive load than they did when they teleoperated the robot.",
        "bibtex": "@INPROCEEDINGS{Marge-A-RSS-11, \r\n    AUTHOR    = {Matthew Marge AND Aaron Powers AND  Jonathan Brookshire AND Trevor Jay AND Odest Jenkins AND Christopher Geyer}, \r\n    TITLE     = {Comparing Heads-up, Hands-free Operation of Ground Robots to Teleoperation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.027} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p27.pdf",
        "supp": "",
        "pdf_size": 780338,
        "gs_citation": 19,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17459328227676591168&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "Language Technologies Institute, Carnegie Mellon University; iRobot Research, iRobot Corporation; iRobot Research, iRobot Corporation; Department of Computer Science, Brown University; Department of Computer Science, Brown University; iRobot Research, iRobot Corporation",
        "aff_domain": "cs.cmu.edu;gmail.com;irobot.com;gmail.com;cs.brown.edu;irobot.com",
        "email": "cs.cmu.edu;gmail.com;irobot.com;gmail.com;cs.brown.edu;irobot.com",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;2;2;1",
        "aff_unique_norm": "Carnegie Mellon University;iRobot Research, iRobot Corporation;Brown University",
        "aff_unique_dep": "Language Technologies Institute;;Department of Computer Science",
        "aff_unique_url": "https://www.cmu.edu;;https://www.brown.edu",
        "aff_unique_abbr": "CMU;;Brown",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Pittsburgh;",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "5fd3371c57",
        "title": "Construction of Cubic Structures with Quadrotor Teams",
        "site": "https://www.roboticsproceedings.org/rss07/p25.html",
        "author": "Quentin Lindsey; Daniel Mellinger; Vijay Kumar",
        "abstract": "We propose and investigate a system in which teams of quadrotor helicopters assemble 2.5-D structures from simple structural nodes and members equipped with magnets. The structures, called Special Cubic Structures (SCS), are a class of 2.5-D tower-like structures free of overhangs and holes. Grippers attached to the bottom of each quadrotor enable them to pick up, transport, and assemble the structural elements.  The design of the nodes and members imposes constraints on assembly which are incorporated into the design of the algorithms used for assembly. We show that any SCS can be built using only the feasible assembly modes for individual structural elements and present simulation and experimental results with a team of quadrotors performing automated assembly.  The paper includes a theoretical analysis of the SCS construction algorithm, the rationale for the design of the structural nodes, members and quadrotor gripper, a description of the quadrotor control methods for part pickup, transport and assembly, and an empirical analysis of system performance.",
        "bibtex": "@INPROCEEDINGS{Lindsey-RSS-11, \r\n    AUTHOR    = {Quentin Lindsey AND Daniel Mellinger AND Vijay Kumar}, \r\n    TITLE     = {Construction of Cubic Structures with Quadrotor Teams}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.025} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p25.pdf",
        "supp": "",
        "pdf_size": 3041293,
        "gs_citation": 395,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11042278853147232890&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": "University of Pennsylvania; University of Pennsylvania; University of Pennsylvania",
        "aff_domain": "seas.upenn.edu;seas.upenn.edu;seas.upenn.edu",
        "email": "seas.upenn.edu;seas.upenn.edu;seas.upenn.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Pennsylvania",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.upenn.edu",
        "aff_unique_abbr": "UPenn",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "f12c24be5e",
        "title": "Controlling Wild Bodies Using Linear Temporal Logic",
        "site": "https://www.roboticsproceedings.org/rss07/p03.html",
        "author": "Leonardo Bobadilla; Oscar Sanchez; Justin Czarnowski; Katrina Gossman; Steven LaValle",
        "abstract": "There is substantial interest controlling a group of bodies from specifications of tasks given in a high-level, humanlike language. This paper proposes a methodology that creates low-level hybrid controllers that guarantee that a group of bodies execute a high-level specified task without dynamical system modeling, precise state estimation or state feedback. We do this by exploiting the wild motions of very simple bodies in an environment connected by gates which serve as the system inputs, as opposed motors on the bodies. We present experiments using inexpensive hardware demonstrating the practical feasibility of our approach to solving tasks such as navigation, patrolling, and coverage.",
        "bibtex": "@INPROCEEDINGS{Bobadilla-RSS-11, \r\n    AUTHOR    = {Leonardo Bobadilla AND Oscar Sanchez AND Justin Czarnowski AND Katrina Gossman AND Steven LaValle}, \r\n    TITLE     = {Controlling Wild Bodies Using Linear Temporal Logic}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.003} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p03.pdf",
        "supp": "",
        "pdf_size": 3283513,
        "gs_citation": 54,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11956097481204185467&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 23,
        "aff": "Department of Computer Science, University of Illinois, Urbana, IL 61801 USA; Department of Computer Science, University of Illinois, Urbana, IL 61801 USA; Department of Computer Science, University of Illinois, Urbana, IL 61801 USA; Department of Computer Science, University of Illinois, Urbana, IL 61801 USA; Department of Computer Science, University of Illinois, Urbana, IL 61801 USA",
        "aff_domain": "uiuc.edu;uiuc.edu;uiuc.edu;uiuc.edu;uiuc.edu",
        "email": "uiuc.edu;uiuc.edu;uiuc.edu;uiuc.edu;uiuc.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Department of Computer Science, University of Illinois, Urbana, IL 61801 USA",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "48ee74418c",
        "title": "Coupled Dynamical System Based Hand-Arm Grasp Planning under Real-Time Perturbations",
        "site": "https://www.roboticsproceedings.org/rss07/p40.html",
        "author": "Ashwini Shukla;Aude Billard",
        "abstract": "Robustness to perturbation has been advocated as a key element to robot control and efforts in that direction are numerous. While in essence these approaches aim at \"endowing robots with a flexibility similar to that displayed by humans\" few have actually looked at how humans react in the face of fast perturbations. We recorded the kinematic data from human subjects during grasping motions under very fast perturbations. Results show a strong coupling between the reach and grasp components of the task that enables rapid adaptation of the fingers in coordination with the hand posture when the target object is perturbed. We develop a robot controller based on Coupled Dynamical Systems that exploits coupling between two dynamical systems driving the hand and finger motions. This offers a compact encoding for a variety of reach and grasp motions that adapts on-the-fly to perturbations without the need for any re-planning. To validate the model we control the motion of the iCub robot when reaching for different objects.",
        "bibtex": "@INPROCEEDINGS{Shukla-RSS-11, \r\n    AUTHOR    = {Ashwini Shukla ANDAude Billard}, \r\n    TITLE     = {Coupled Dynamical System Based Hand-Arm Grasp Planning under Real-Time Perturbations}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.040} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p40.pdf",
        "supp": "",
        "pdf_size": 1287013,
        "gs_citation": 5,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14938119921514031252&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": "Learning Algorithms and Systems Laboratory (LASA), Ecole Polytechnique Federale de Lausanne (EPFL), Lausanne, Switzerland - 1015; Learning Algorithms and Systems Laboratory (LASA), Ecole Polytechnique Federale de Lausanne (EPFL), Lausanne, Switzerland - 1015",
        "aff_domain": "epfl.ch;epfl.ch",
        "email": "epfl.ch;epfl.ch",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Learning Algorithms and Systems Laboratory (LASA), Ecole Polytechnique Federale de Lausanne (EPFL), Lausanne, Switzerland - 1015",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "b5831a37ab",
        "title": "Cross-Entropy Randomized Motion Planning",
        "site": "https://www.roboticsproceedings.org/rss07/p22.html",
        "author": "Marin Kobilarov",
        "abstract": "This paper is concerned with motion planning for nonlinear robotic systems operating in constrained environments. Motivated by recent developments in sampling-based motion planning and Monte Carlo optimization we propose a general randomized path planning method based on sampling in the space of trajectories. The idea is to construct a probability distribution over the set of feasible paths and to perform the search for an optimal trajectory through importance sampling. At the core of the approach lies the cross-entropy method for estimation of rare-event probabilities. The algorithm recursively approximates the optimal sampling distribution which guides the set of sampled trajectories towards regions of progressively lower cost until converging to a delta distribution at the optimum. Our main goal is to provide a framework for consistent adaptive sampling correlating the spatial structure of trajectories and their computed costs. The approach is illustrated with two simple examples--a point mass vehicle and the Dubins car, and is then applied to a simulated helicopter flying optimally in a 3-D terrain.",
        "bibtex": "@INPROCEEDINGS{Kobilarov-RSS-11, \r\n    AUTHOR    = {Marin Kobilarov}, \r\n    TITLE     = {Cross-Entropy Randomized Motion Planning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.022} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p22.pdf",
        "supp": "",
        "pdf_size": 1574869,
        "gs_citation": 70,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10123529174961735172&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 16,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "8dddb7b5ee",
        "title": "Designing Petri Net Supervisors from LTL Specifications",
        "site": "https://www.roboticsproceedings.org/rss07/p24.html",
        "author": "Bruno Lacerda; Pedro Lima",
        "abstract": "We present a methodology to build a Petri net realization of a supervisor that, given a Petri net model of a (multi-)robot system and a linear temporal logic (LTL) specification, forces the system to fulfil the specification. The methodology includes composing the Petri net model with the B&uumlchi automaton representing the LTL formula and trimming the result using a known method to reduce the size of the supervisor. Furthermore, we guarantee that the obtained supervisors are admissible by construction by restricting the LTL formulas that can be written to an appropriate subset. To illustrate the method, we provide an example on how to specify coordination rules for a team of simulated soccer robots.",
        "bibtex": "@INPROCEEDINGS{Lacerda-RSS-11, \r\n    AUTHOR    = {Bruno Lacerda AND Pedro Lima}, \r\n    TITLE     = {Designing Petri Net Supervisors from LTL Specifications}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.024} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p24.pdf",
        "supp": "",
        "pdf_size": 696379,
        "gs_citation": 24,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5228854197917399309&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Institute for Systems and Robotics – Instituto Superior Técnico, Lisbon, Portugal; Institute for Systems and Robotics – Instituto Superior Técnico, Lisbon, Portugal",
        "aff_domain": "isr.ist.utl.pt;isr.ist.utl.pt",
        "email": "isr.ist.utl.pt;isr.ist.utl.pt",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Institute for Systems and Robotics – Instituto Superior Técnico, Lisbon, Portugal",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "f9ec332df0",
        "title": "Distributed Robot Ensemble Control for Deployment to Multiple Sites",
        "site": "https://www.roboticsproceedings.org/rss07/p28.html",
        "author": "T. William Mather; M. Ani Hsieh",
        "abstract": "We address the ensemble synthesis of distributed control policies to allocate a team of homogenous robots to a collection of spatially distributed tasks.  We assume individual robot controllers are derived via the sequential composition of individual task controllers and develop an appropriate macroscopic description of the team dynamics.  A feedback control strategy is synthesized using the macroscopic model to enable the team to maintain a desired distribution of robots across the various tasks while minimizing the variance of the robot population at each task.  We present a distributed implementation of the proposed ensemble feedback strategy that can be implemented with minimal communication requirements.  We establish stability properties of our ensemble controller and verify the feasibility of the distributed ensemble controller through high-fidelity simulations.",
        "bibtex": "@INPROCEEDINGS{Mather-RSS-11, \r\n    AUTHOR    = {T. William Mather AND M. Ani Hsieh}, \r\n    TITLE     = {Distributed Robot Ensemble Control for Deployment to Multiple Sites}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.028} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p28.pdf",
        "supp": "",
        "pdf_size": 614103,
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15431459725984674396&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "f4efd3be3e",
        "title": "Exploiting Variable Stiffness in Explosive Movement Tasks",
        "site": "https://www.roboticsproceedings.org/rss07/p04.html",
        "author": "David Braun; Matthew Howard; Sethu Vijayakumar",
        "abstract": "It is widely recognised that compliant actuation is  advantageous to robot control once high-performance, explosive  tasks, such as throwing, hitting or jumping are considered.  However, the benefit of intrinsic compliance comes with high  control complexity. Specifically, coordinating the motion of the  system through a compliant actuator and finding a task-specific  impedance profile that leads to better performance is non-trivial.  Here, we utilise optimal control to devise time-varying torque and  stiffness profiles for highly dynamic movements in compliantly  actuated robots. The proposed methodology is applied to a ball-throwing  task where we demonstrate that: (i) the method is  able to tailor impedance strategies to specific task objectives  and system dynamics, (ii) the ability to vary stiffness leads to  better performance in this class of movements, (iii) in systems  with variable physical compliance, our methodology is able to  exploit the energy storage capabilities of the actuators. We  illustrate these in several numerical simulations, and in hardware experiments on a device with variable physical stiffness.",
        "bibtex": "@INPROCEEDINGS{Braun-RSS-11, \r\n    AUTHOR    = {David Braun AND Matthew Howard AND Sethu Vijayakumar}, \r\n    TITLE     = {Exploiting Variable Stiffness in Explosive Movement Tasks}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.004} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p04.pdf",
        "supp": "",
        "pdf_size": 5591306,
        "gs_citation": 97,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2535977561168371456&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": "University of Edinburgh, School of Informatics, IPAB, Scotland, UK; University of Edinburgh, School of Informatics, IPAB, Scotland, UK; University of Edinburgh, School of Informatics, IPAB, Scotland, UK",
        "aff_domain": "ed.ac.uk;ed.ac.uk;ed.ac.uk",
        "email": "ed.ac.uk;ed.ac.uk;ed.ac.uk",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Edinburgh, School of Informatics, IPAB, Scotland, UK",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "8cd4bbb559",
        "title": "Fast Trajectory Correction for Nonholonomic Mobile Robots using Affine Transformations",
        "site": "https://www.roboticsproceedings.org/rss07/p36.html",
        "author": "Quang-Cuong Pham",
        "abstract": "Planning trajectories for nonholonomic systems is difficult and computationally expensive. When facing unexpected events, it may therefore be preferable to deform in some way the initially planned trajectory rather than to re-plan entirely a new one. We suggest here a method based on affine transformations to make such deformations. This method is exact and fast: the deformations and the resulting trajectories can be computed algebraically, in one step, and without any trajectory re-integration. To demonstrate the possibilities offered by this new method, we use it to derive position correction, orientation correction and obstacle avoidance algorithms for three classical nonholonomic systems: the unicycle, the bicycle, and an underwater vehicle.",
        "bibtex": "@INPROCEEDINGS{Pham-RSS-11, \r\n    AUTHOR    = {Quang-Cuong Pham }, \r\n    TITLE     = {Fast Trajectory Correction for Nonholonomic Mobile Robots using Affine Transformations}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.036} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p36.pdf",
        "supp": "",
        "pdf_size": 202562,
        "gs_citation": 19,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9538929511328981374&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 15,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "92122ab3e6",
        "title": "Finite-Time Regional Verification of Stochastic Nonlinear Systems",
        "site": "https://www.roboticsproceedings.org/rss07/p41.html",
        "author": "Jacob Steinhardt; Russ Tedrake",
        "abstract": "Recent trends pushing robots into unstructured environments with limited sensors have motivated considerable work on planning under uncertainty and stochastic optimal control, but these methods typically do not provide guaranteed performance.  Here we consider the problem of bounding the probability of failure (defined as leaving a finite region of state space) over a finite time for stochastic nonlinear systems with continuous state.  Our approach searches for exponential barrier functions that provide bounds using a variant of the classical supermartingale result. We provide a relaxation of this search to a semidefinite program, yielding an efficient algorithm that provides rigorous upper bounds on the probability of failure for the original nonlinear system. We give a number of numerical examples in both discrete and continuous time that demonstrate the effectiveness of the approach.",
        "bibtex": "@INPROCEEDINGS{Steinhardt-RSS-11, \r\n    AUTHOR    = {Jacob Steinhardt AND Russ Tedrake}, \r\n    TITLE     = {Finite-Time Regional Verification of Stochastic Nonlinear Systems}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.041} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p41.pdf",
        "supp": "",
        "pdf_size": 419964,
        "gs_citation": 126,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5807028217455527422&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 20,
        "aff": "Department of Mathematics, Massachusetts Institute of Technology; Department of Computer Science, Massachusetts Institute of Technology",
        "aff_domain": "mit.edu;mit.edu",
        "email": "mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "Department of Mathematics",
        "aff_unique_url": "https://web.mit.edu",
        "aff_unique_abbr": "MIT",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Cambridge",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "e950395155",
        "title": "Friendly Patrolling: A Model of Natural Encounters",
        "site": "https://www.roboticsproceedings.org/rss07/p18.html",
        "author": "Kotaro Hayashi; Masahiro Shiomi; Takayuki Kanda; Norihiro Hagita",
        "abstract": "This study addresses encounter interactions in public environments where people and robots walk around. In daily life, security guards, police officers, and sales clerks roam around environments and nonverbally present friendly behavior so that people feel comfortable talking to them. We modeled the behavior of human experts during friendly patrolling, which we defined as a roaming behavior that nonverbally presents a friendly attitude, to encourage people to talk to such professionals. The model was implemented in a humanoid robot, Robovie, and tested in a shopping mall. The experimental results with 39 participants demonstrated that the model worked as intended.",
        "bibtex": "@INPROCEEDINGS{Hayashi-RSS-11, \r\n    AUTHOR    = {Kotaro Hayashi AND Masahiro Shiomi AND Takayuki Kanda AND Norihiro Hagita}, \r\n    TITLE     = {Friendly Patrolling: A Model of Natural Encounters}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.018} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p18.pdf",
        "supp": "",
        "pdf_size": 732239,
        "gs_citation": 55,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5104323143495620427&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 14,
        "aff": "ATR Intelligent Robotics and Communication Labs. + Japan Science and Technology Agency, CREST; ATR Intelligent Robotics and Communication Labs. + Japan Science and Technology Agency, CREST; ATR Intelligent Robotics and Communication Labs. + Japan Science and Technology Agency, CREST; ATR Intelligent Robotics and Communication Labs. + The Department of Information Science, NAIST + Japan Science and Technology Agency, CREST",
        "aff_domain": "atr.jp;atr.jp;atr.jp;atr.jp",
        "email": "atr.jp;atr.jp;atr.jp;atr.jp",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0+1;0+1;0+2+1",
        "aff_unique_norm": "ATR Intelligent Robotics and Communication Labs.;Japan Science and Technology Agency, CREST;The Department of Information Science, NAIST",
        "aff_unique_dep": ";;",
        "aff_unique_url": ";;",
        "aff_unique_abbr": ";;",
        "aff_campus_unique_index": ";;;",
        "aff_campus_unique": "",
        "aff_country_unique_index": ";;;",
        "aff_country_unique": ""
    },
    {
        "id": "60a534c9b7",
        "title": "From Caging to Grasping",
        "site": "https://www.roboticsproceedings.org/rss07/p37.html",
        "author": "Alberto Rodriguez; Matt Mason; Steve Ferry",
        "abstract": "This paper digs into the relationship between grasps and cages of a rigid body, in particular into the use of cages as waypoints to grasp an object.  We introduce the concept of pregrasping cages, caging configurations from which the object can be reached while maintaining the cage on it.  In the well understood case of two-fingered manipulators, the squeezing/stretching caging characterization implies that all cages are indeed pregrasping cages and, as a consequence, are useful waypoints to grasp an object.  We show in this paper that the same does not hold for more than two fingers.  There are caging configurations from which a grasp of the object cannot be reached without breaking the cage on it.  We explore the natural generalization of the squeezing/stretching characterization to the case of n fingers and exploit it to give sufficient conditions for a cage to be a pregrasping cage.",
        "bibtex": "@INPROCEEDINGS{Rodriguez-RSS-11, \r\n    AUTHOR    = {Alberto Rodriguez AND Matt Mason AND Steve Ferry}, \r\n    TITLE     = {From Caging to Grasping}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.037} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p37.pdf",
        "supp": "",
        "pdf_size": 3185163,
        "gs_citation": 319,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8767768036469778335&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 26,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University; Department of Mathematics, Rutgers University",
        "aff_domain": "cmu.edu;cs.cmu.edu;math.rutgers.edu",
        "email": "cmu.edu;cs.cmu.edu;math.rutgers.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Carnegie Mellon University;Department of Mathematics, Rutgers University",
        "aff_unique_dep": "The Robotics Institute;",
        "aff_unique_url": "https://www.cmu.edu;",
        "aff_unique_abbr": "CMU;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "020f04d82c",
        "title": "Global Motion Planning under Uncertain Motion, Sensing, and Environment Map",
        "site": "https://www.roboticsproceedings.org/rss07/p23.html",
        "author": "Hanna  Kurniawati; Tirthankar Bandyopadhyay; Nicholas Patrikalakis",
        "abstract": "Motion planning that takes into account uncertainty in motion, sensing, and environment map, is critical for autonomous robots to operate reliably in our living spaces. Partially Observable Markov Decision Processes (POMDPs) is a principled and general framework for planning under uncertainty. Although recent development of point-based POMDPs have drastically increased the speed of POMDP planning, even the best POMDP planner today, fails to generate reasonable motion strategies when the environment map is not known exactly. This paper presents Guided Cluster Sampling (GCS), a new point-based POMDP planner for motion planning with uncertain motion, sensing, and environment map, when the robot has active sensing capability. It uses our observations that in this problem, the belief space B can be partitioned into a collection of much smaller sub-spaces, and an optimal policy can often be generated by sufficient sampling of a small subset of the collection. GCS samples B using two-stage cluster sampling, a subspace is sampled from the collection and then a belief is sampled from the subspace. It uses information from the set of sampled sub-spaces and sampled beliefs to guide subsequent sampling. Preliminary results suggest that GCS generates reasonable policies for motion planning problems with uncertain motion, sensing, and environment map, that are unsolvable by the best point-based POMDP planner today, within reasonable time. Furthermore, GCS handles POMDPs with continuous state, action, and observation spaces. We show that for a class of POMDPs that often occur in robot motion planning, GCS converges to the optimal policy, given enough time. To the best of our knowledge, this is the first convergence result for point-based POMDPs with continuous action space.",
        "bibtex": "@INPROCEEDINGS{Kurniawati-RSS-11, \r\n    AUTHOR    = {Hanna  Kurniawati AND Tirthankar Bandyopadhyay AND Nicholas Patrikalakis}, \r\n    TITLE     = {Global Motion Planning under Uncertain Motion, Sensing, and Environment Map}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.023} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p23.pdf",
        "supp": "",
        "pdf_size": 444892,
        "gs_citation": 106,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7958919829216667751&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 25,
        "aff": "Singapore–MIT Alliance for Research and Technology; Singapore–MIT Alliance for Research and Technology; Massachusetts Institute of Technology",
        "aff_domain": "smart.mit.edu;smart.mit.edu;mit.edu",
        "email": "smart.mit.edu;smart.mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Singapore–MIT Alliance for Research and Technology;Massachusetts Institute of Technology",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://web.mit.edu",
        "aff_unique_abbr": ";MIT",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "feb49bd43f",
        "title": "Global Optimization of Robotic Grasps",
        "site": "https://www.roboticsproceedings.org/rss07/p12.html",
        "author": "Carlos Rosales Gallegos; Josep Porta; Lluis Ros",
        "abstract": "This paper presents a procedure to optimize the quality of robotic grasps for objects that need to be held and manipulated in a specific way, characterized by a number of tight contact constraints. The main difficulties of the problem include that the set of feasible grasps is a manifold implicitly defined by a system of non-linear equations, the high dimension of this manifold, and the multi-modal nature of typical grasp quality indices, which make local optimization methods get trapped into local extrema. The proposed procedure finds a way around these difficulties by focussing the exploration on a relevant subset of grasps of lower dimension, which is traced out exhaustively using higher-dimensional continuation techniques. Using these techniques, a detailed atlas of the subset is obtained, on which the highest quality grasp according to any desired criterion can be readily identified. Experiments on a 3-finger planar hand and on the Schunk anthropomorphic hand validate the approach.",
        "bibtex": "@INPROCEEDINGS{Gallegos-RSS-11, \r\n    AUTHOR    = {Carlos Rosales Gallegos AND Josep Porta AND Lluis Ros}, \r\n    TITLE     = {Global Optimization of Robotic Grasps}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.012} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p12.pdf",
        "supp": "",
        "pdf_size": 4951729,
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16145029144877856156&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 22,
        "aff": "Institut de Rob`otica i Inform`atica Industrial, CSIC-UPC + Institut d’Organizaci´o i Control de Sistemes Industrials, UPC; Institut de Rob`otica i Inform`atica Industrial, CSIC-UPC; Institut de Rob`otica i Inform`atica Industrial, CSIC-UPC",
        "aff_domain": "iri.upc.edu;iri.upc.edu;iri.upc.edu",
        "email": "iri.upc.edu;iri.upc.edu;iri.upc.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0;0",
        "aff_unique_norm": "Institut de Rob`otica i Inform`atica Industrial, CSIC-UPC;Institut d’Organizaci´o i Control de Sistemes Industrials, UPC",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "2b890b5ae4",
        "title": "Identification and Representation of Homotopy Classes of Trajectories for Search-based Path Planning in 3D",
        "site": "https://www.roboticsproceedings.org/rss07/p02.html",
        "author": "Subhrajit Bhattacharya; Maxim Likhachev; Vijay Kumar",
        "abstract": "There are many applications in motion planning where it is important to consider and distinguish between different homotopy classes of trajectories. Two trajectories are homotopic if one trajectory can be continuously deformed into another without passing through an obstacle, and a homotopy class is a collection of homotopic trajectories. In this paper we consider the problem of robot exploration and planning in three-dimensional configuration spaces to (a) identify and classify different homotopy classes; and (b) plan trajectories constrained to certain homotopy classes or avoiding specified homotopy classes. In previous work we have solved this problem for two-dimensional, static environments using the Cauchy Integral Theorem in concert with graph search techniques. The robot workspace is mapped to the complex plane and obstacles are poles in this plane. The Residue Theorem allows the use of integration along the path to distinguish between trajectories in different homotopy classes. However, this idea is fundamentally limited to two dimensions. In this work we develop new techniques to solve the same problem, but in three dimensions, using theorems from electromagnetism. The Biot-Savart law lets us design an appropriate vector field, the line integral of which, using the integral form of Ampere's Law, encodes information about homotopy classes in three dimensions. Skeletons of obstacles in the robot world are extracted and are modeled by current-carrying conductors. We describe the development of a practical graph-search based planning tool with theoretical guarantees by combining integration theory with search techniques, and illustrate it with examples in three-dimensional spaces such as two-dimensional, dynamic environments and three-dimensional static environments.",
        "bibtex": "@INPROCEEDINGS{Bhattacharya-RSS-11, \r\n    AUTHOR    = {Subhrajit Bhattacharya AND Maxim Likhachev AND Vijay Kumar}, \r\n    TITLE     = {Identification and Representation of Homotopy Classes of Trajectories for Search-based Path Planning in 3D}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.002} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p02.pdf",
        "supp": "",
        "pdf_size": 1851318,
        "gs_citation": 75,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1986981013039350343&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 18,
        "aff": "Department of Mechanical Engineering and Applied Mechanics, University of Pennsylvania; Department of Computer and Information Science, University of Pennsylvania; Department of Mechanical Engineering and Applied Mechanics, University of Pennsylvania",
        "aff_domain": "seas.upenn.edu;seas.upenn.edu;seas.upenn.edu",
        "email": "seas.upenn.edu;seas.upenn.edu;seas.upenn.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Pennsylvania",
        "aff_unique_dep": "Department of Mechanical Engineering and Applied Mechanics",
        "aff_unique_url": "https://www.upenn.edu",
        "aff_unique_abbr": "UPenn",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "0460f4e323",
        "title": "Infinite-Horizon Model Predictive Control for Periodic Tasks with Contacts",
        "site": "https://www.roboticsproceedings.org/rss07/p10.html",
        "author": "Tom Erez; Yuval Tassa;  Emanuel Todorov",
        "abstract": "We present a method that combines offline trajectory optimization and online Model Predictive Control (MPC), generating robust controllers for complex periodic behavior in domains with unilateral constraints (e.g., contact with the environment).  MPC offers robust and adaptive control even in high-dimensional domains; however, the online optimization gets stuck in local minima when the domains has discontinuous dynamics.  Some methods of trajectory optimization that are immune to such problems, but these are often too slow to be applied online.    In this paper, we use offline optimization to find the limit-cycle solution of an infinite-horizon average-cost optimal-control task.  We then compute a local quadratic approximation of the Value function around this limit cycle. Finally, we use this quadratic approximation as the terminal cost of  online MPC.    This combination of an offline solution of the infinite-horizon problem with an online MPC controller is known as Infinite Horizon Model Predictive Control (IHMPC), and has previously been applied only to simple stabilization objectives.  Here we extend IHMPC to tackle periodic tasks, and demonstrate the power of our approach by synthesizing hopping behavior in a simulated robot. IHMPC involves a limited computational load, and can be executed online on a standard laptop computer.  The resulting behavior is extremely robust, allowing the hopper to recover from virtually any perturbation.    In real robotic domains, modeling errors are inevitable.  We show how IHMPC is robust to modeling errors by altering the morphology of the robot; the same controller remains effective, even when the underlying infinite-horizon solution is no longer accurate.",
        "bibtex": "@INPROCEEDINGS{Erez-RSS-11, \r\n    AUTHOR    = {Tom Erez AND Yuval Tassa AND  Emanuel Todorov}, \r\n    TITLE     = {Infinite-Horizon Model Predictive Control for Periodic Tasks with Contacts}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.010} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p10.pdf",
        "supp": "",
        "pdf_size": 409762,
        "gs_citation": 119,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6587141716998566158&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": "Computer Science and Engineering, Washington University in St. Louis, Missouri; Interdisciplinary Center for Neural Computation, Hebrew University, Jerusalem, Israel; Applied Mathematics and Computer Science & Engineering, University of Washington, Seattle, USA",
        "aff_domain": "cse.wustl.edu;alice.nc.huji.ac.il;cs.washington.edu",
        "email": "cse.wustl.edu;alice.nc.huji.ac.il;cs.washington.edu",
        "github": "",
        "project": "goo.gl/ymzUY",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2",
        "aff_unique_norm": "Computer Science and Engineering, Washington University in St. Louis, Missouri;Interdisciplinary Center for Neural Computation, Hebrew University, Jerusalem, Israel;Applied Mathematics and Computer Science & Engineering, University of Washington, Seattle, USA",
        "aff_unique_dep": ";;",
        "aff_unique_url": ";;",
        "aff_unique_abbr": ";;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "a546f2bde7",
        "title": "Kinematic Cartography for Locomotion at Low Reynolds Numbers",
        "site": "https://www.roboticsproceedings.org/rss07/p17.html",
        "author": "Ross Hatton; Howie Choset",
        "abstract": "Kinematic motion planning often requires a notion of distance between configurations. Euclidean distances on a parameter space are easy to compute, but can drastically distort the effort required to change configuration. Here, we present a framework for characterizing this distortion, based on principles adopted from the cartographic community, and a method for transforming configuration coordinates to better represent actuation costs. As a demonstration of this approach, we derive a true configuration distance metric for an important class of locomoting systems: low Reynolds number swimmers. Applying our cartographic coordinate transformation to these systems both provides intuition for previous numerical results, and allows direct geometric comparison between systems with heterogeneous morphology.",
        "bibtex": "@INPROCEEDINGS{Hatton-RSS-11, \r\n    AUTHOR    = {Ross Hatton AND Howie Choset}, \r\n    TITLE     = {Kinematic Cartography for Locomotion at Low Reynolds Numbers}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.017} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p17.pdf",
        "supp": "",
        "pdf_size": 817239,
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15226584595984417066&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "Carnegie Mellon University; Carnegie Mellon University",
        "aff_domain": "cmu.edu;cmu.edu",
        "email": "cmu.edu;cmu.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "a312d89f89",
        "title": "Learning to Control a Low-Cost Manipulator using Data-Efficient Reinforcement Learning",
        "site": "https://www.roboticsproceedings.org/rss07/p08.html",
        "author": "Marc Deisenroth; Carl Rasmussen; Dieter Fox",
        "abstract": "Over the last years, there has been substantial  progress in robust manipulation in unstructured environments.  The long-term goal of our work is to get away from precise,  but very expensive robotic systems and to develop affordable,  potentially imprecise, self-adaptive manipulator systems that can  interactively perform tasks such as playing with children. In  this paper, we demonstrate how a low-cost off-the-shelf robotic  system can learn closed-loop policies for a stacking task in only  a handful of trials-from scratch. Our manipulator is inaccurate  and provides no pose feedback. For learning a controller in the  work space of a Kinect-style depth camera, we use a model-based  reinforcement learning technique. Our learning method is data  efficient, reduces model bias, and deals with several noise sources  in a principled way during long-term planning. We present a  way of incorporating state-space constraints into the learning  process and analyze the learning gain by exploiting the sequential  structure of the stacking task.",
        "bibtex": "@INPROCEEDINGS{Deisenroth-RSS-11, \r\n    AUTHOR    = {Marc Deisenroth AND Carl Rasmussen AND Dieter Fox}, \r\n    TITLE     = {Learning to Control a Low-Cost Manipulator using Data-Efficient Reinforcement Learning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.008} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p08.pdf",
        "supp": "",
        "pdf_size": 2855028,
        "gs_citation": 332,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4008952458274385880&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 27,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "b3b4306d01",
        "title": "Load Balancing for Mobility-on-Demand Systems",
        "site": "https://www.roboticsproceedings.org/rss07/p34.html",
        "author": "Marco Pavone; Stephen Smith; Emilio Frazzoli; Daniela Rus",
        "abstract": "In this paper we develop methods for maximizing the throughput of a mobility-on-demand urban transportation system.  We consider a finite group of shared vehicles, located at a set of stations.  Users arrive at the stations, pick-up vehicles, and drive (or are driven) to their destination station where they drop-off the vehicle.  When some origins and destinations are more popular than others, the system will inevitably become out of balance: Vehicles will build up at some stations, and become depleted at others.  We propose a robotic solution to this rebalancing problem that involves empty robotic vehicles autonomously driving between stations.     We develop a rebalancing policy that minimizes the number of vehicles performing rebalancing trips.  To do this, we utilize a fluid model for the customers and vehicles in the system.  The model takes the form of a set of nonlinear time-delay differential equations.  We then show that the optimal rebalancing policy can be found as the solution to a linear program.  By analyzing the dynamical system model, we show that every station reaches an equilibrium in which there are excess vehicles and no waiting customers.  We use this solution to develop a real-time rebalancing policy which can operate in highly variable environments.  We verify policy performance in a simulated mobility-on-demand environment with stochastic features found in real-world urban transportation networks.",
        "bibtex": "@INPROCEEDINGS{Pavone-RSS-11, \r\n    AUTHOR    = {Marco Pavone AND Stephen Smith AND Emilio Frazzoli AND Daniela Rus}, \r\n    TITLE     = {Load Balancing for Mobility-on-Demand Systems}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.034} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p34.pdf",
        "supp": "",
        "pdf_size": 637810,
        "gs_citation": 63,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18312444438071291733&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": "Jet Propulsion Laboratory, Caltech; University of Waterloo; Massachusetts Institute of Technology; Massachusetts Institute of Technology",
        "aff_domain": "jpl.nasa.gov;uwaterloo.ca;mit.edu;csail.mit.edu",
        "email": "jpl.nasa.gov;uwaterloo.ca;mit.edu;csail.mit.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2;2",
        "aff_unique_norm": "Jet Propulsion Laboratory, Caltech;University of Waterloo;Massachusetts Institute of Technology",
        "aff_unique_dep": ";;",
        "aff_unique_url": ";https://uwaterloo.ca;https://web.mit.edu",
        "aff_unique_abbr": ";UW;MIT",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;2;2",
        "aff_country_unique": ";Canada;United States"
    },
    {
        "id": "3bb4888986",
        "title": "Lying Pose Recognition for Elderly Fall Detection",
        "site": "https://www.roboticsproceedings.org/rss07/p44.html",
        "author": "Simin Wang; Salim Zabir; Bastian Leibe",
        "abstract": "This paper proposes a pipeline for lying pose recognition from single images, which is designed for health-care robots to find fallen people. We firstly detect object bounding boxes by a mixture of viewpoint-specific part based model detectors and later estimate a detailed configuration of body parts on the detected regions by a finer tree-structured model. Moreover, we exploit the information provided by detection to infer a reasonable limb prior for the pose estimation stage.  Additional robustness is achieved by integrating a viewpoint-specific foreground segmentation into the detection and body pose estimation stages. This step yields a refinement of detection scores and a better color model to initialize pose estimation.  We apply our proposed approach to challenging data sets of fallen people in different scenarios. Our quantitative and qualitative results demonstrate that the part-based model significantly outperforms a holistic model based on same feature type for lying pose detection. Moreover, our system offers a reasonable estimation for the body configuration of varying lying poses.",
        "bibtex": "@INPROCEEDINGS{Wang-RSS-11, \r\n    AUTHOR    = {Simin Wang AND Salim Zabir AND Bastian Leibe}, \r\n    TITLE     = {Lying Pose Recognition for Elderly Fall Detection}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.044} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p44.pdf",
        "supp": "",
        "pdf_size": 9056593,
        "gs_citation": 58,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11090106609258164888&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "NIMTE institute of Chinese Academy of Science; France Telecom, Japan + Orange Labs, Tokyo; UMIC Research Centre, RWTH Aachen University",
        "aff_domain": "nimte.ac.cn; ; ",
        "email": "nimte.ac.cn; ; ",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1+2;3",
        "aff_unique_norm": "NIMTE institute of Chinese Academy of Science;France Telecom, Japan;Orange Labs, Tokyo;RWTH Aachen University",
        "aff_unique_dep": ";;;UMIC Research Centre",
        "aff_unique_url": ";;;https://www.rwth-aachen.de",
        "aff_unique_abbr": ";;;RWTH",
        "aff_campus_unique_index": ";1",
        "aff_campus_unique": ";Aachen",
        "aff_country_unique_index": ";1",
        "aff_country_unique": ";Germany"
    },
    {
        "id": "911d620e59",
        "title": "Model-Based Proprioceptive State Estimation for Spring-Mass Running",
        "site": "https://www.roboticsproceedings.org/rss07/p16.html",
        "author": "Ozlem Gur; Uluc Saranli",
        "abstract": "Autonomous applications of legged platforms will inevitably require accurate state estimation both for feedback control as well as mapping and planning. Even though kinematic models and low-bandwidth visual localization may be sufficient for fully-actuated, statically stable legged robots, they are inadequate for dynamically dexterous,  underactuated platforms where second order dynamics are dominant,  noise levels are high and sensory limitations are more severe. In this paper, we introduce a model based state estimation method for dynamic running behaviors with a simple spring-mass runner. By using an approximate analytic solution to the dynamics of the model within an Extended Kalman filter framework, the estimation accuracy of our model remains accurate even at low sampling frequencies. We also propose two new event-based sensory modalities that further improve estimation performance in cases where even the internal kinematics of a robot cannot be fully observed, such as when flexible materials are used for limb designs. We present comparative simulation results to establish that our method outperforms traditional approaches which rely on constant acceleration motion models and that it eliminates the need for an extensive and unrealistic sensor suite.",
        "bibtex": "@INPROCEEDINGS{Gur-RSS-11, \r\n    AUTHOR    = {Ozlem Gur AND Uluc Saranli}, \r\n    TITLE     = {Model-Based Proprioceptive State Estimation for Spring-Mass Running}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.016} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p16.pdf",
        "supp": "",
        "pdf_size": 298550,
        "gs_citation": 19,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4688423550463116597&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "dac98ddee2",
        "title": "Monte Carlo Pose Estimation with Quaternion Kernels and the Bingham Distribution",
        "site": "https://www.roboticsproceedings.org/rss07/p15.html",
        "author": "Jared Glover; Radu Rusu; Gary Bradski",
        "abstract": "The success of personal service robotics hinges upon  reliable manipulation of everyday household objects, such as  dishes, bottles, containers, and furniture. In order to accurately  manipulate such objects, robots need to know objects full 6-DOF  pose, which is made difficult by clutter and occlusions. Many  household objects have regular structure that can be used to  effectively guess object pose given an observation of just a small  patch on the object. In this paper, we present a new method  to model the spatial distribution of oriented local features on  an object, which we use to infer object pose given small sets  of observed local features. The orientation distribution for local  features is given by a mixture of Binghams on the hypersphere of  unit quaternions, while the local feature distribution for position  given orientation is given by a locally-weighted (Quaternion  kernel) likelihood. Experiments on 3D point cloud data of  cluttered and uncluttered scenes generated from a structured  light stereo image sensor validate our approach.",
        "bibtex": "@INPROCEEDINGS{Glover-RSS-11, \r\n    AUTHOR    = {Jared Glover AND Radu Rusu AND Gary Bradski}, \r\n    TITLE     = {Monte Carlo Pose Estimation with Quaternion Kernels and the Bingham Distribution}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.015} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p15.pdf",
        "supp": "",
        "pdf_size": 3843968,
        "gs_citation": 110,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3596270788502619159&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology; Willow Garage; Willow Garage",
        "aff_domain": "mit.edu;willowgarage.com;willowgarage.com",
        "email": "mit.edu;willowgarage.com;willowgarage.com",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1",
        "aff_unique_norm": "Massachusetts Institute of Technology;Willow Garage",
        "aff_unique_dep": "Computer Science and Artificial Intelligence Laboratory;",
        "aff_unique_url": "https://www.csail.mit.edu;http://willowgarage.com/",
        "aff_unique_abbr": "MIT;",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Cambridge;",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "91c941c294",
        "title": "Motion Planning Under Uncertainty In Highly Deformable Environments",
        "site": "https://www.roboticsproceedings.org/rss07/p33.html",
        "author": "Sachin Patil; Jur van den Berg; Ron Alterovitz",
        "abstract": "Many tasks in robot-assisted surgery, food handling, manufacturing, and other applications require planning and controlling the motions of manipulators or other devices that must interact with highly deformable objects. We present a unified approach for motion planning under uncertainty in deformable environments that maximizes probability of success by accounting for uncertainty in deformation models, noisy sensing, and unpredictable actuation. Unlike prior planners that assume deterministic deformations or treat deformations as a type of small perturbation, our method explicitly considers the uncertainty in large, time-dependent deformations. Our method requires a simulator of deformable objects but places no significant restrictions on the simulator used. We use a sampling-based motion planner in conjunction with the simulator to generate a set of candidate plans based on expected deformations. Our method then uses the simulator and optimal control to numerically estimate time-dependent state distributions based on uncertain parameters (e.g. deformable material properties or actuation errors). We then select the plan with the highest estimated probability of successfully avoiding obstacles and reaching the goal region. Using FEM-based simulation of deformable tissues, we demonstrate the ability of our method to generate high quality plans in two medical-inspired scenarios: (1) guiding bevel-tip steerable needles through slices of deformable tissue around obstacles for minimally invasive biopsies and drug-delivery, and (2) manipulating planar tissues to align interior points at desired coordinates for precision treatment.",
        "bibtex": "@INPROCEEDINGS{Patil-RSS-11, \r\n    AUTHOR    = {Sachin Patil AND Jur van den Berg AND Ron Alterovitz}, \r\n    TITLE     = {Motion Planning Under Uncertainty In Highly Deformable Environments}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.033} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p33.pdf",
        "supp": "",
        "pdf_size": 1177411,
        "gs_citation": 64,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4871300834007901365&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "6901d2e2d2",
        "title": "Multi-Level Partitioning and Distribution of the Assignment Problem for Large-Scale Multi-Robot Task Allocation",
        "site": "https://www.roboticsproceedings.org/rss07/p26.html",
        "author": "Lantao Liu; Dylan Shell",
        "abstract": "A team of robots can handle failures and dynamic tasks by repeatedly assigning functioning robots to tasks. This paper introduces an algorithm that scales to large numbers of robots and tasks by exploiting both task locality and sparsity. The algorithm mixes both centralized and decentralized approaches at different scales to produce a fast, robust method that is accurate and scalable, and reduces both the global communication and unnecessary repeated computation. We depart from optimization and bipartite matching formulations of the problem, observing instead that an assignment can be computed through coarsening and partitioning operations on the utility matrix. First, a coarse assignment is calculated by evaluating the global utility information and partitioning it into clusters in a problem-domain independent way. Next, the assignment solutions in each partition are refined (either recursively, or via an existing algorithm).  This multilevel framework allows the repeated reassignment to execute among interrelated partitions. The results suggest that only a minor sacrifice in solution quality is required for gains in efficiency. The proposed algorithm is validated using extensive simulation experiments and the results show advantages over the traditional optimal assignment algorithms.",
        "bibtex": "@INPROCEEDINGS{Liu-RSS-11, \r\n    AUTHOR    = {Lantao Liu AND Dylan Shell}, \r\n    TITLE     = {Multi-Level Partitioning and Distribution of the Assignment Problem for Large-Scale Multi-Robot Task Allocation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.026} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p26.pdf",
        "supp": "",
        "pdf_size": 783270,
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11123118261561423912&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "Dept. of Computer Science and Engineering, Texas A&M University, College Station, USA; Dept. of Computer Science and Engineering, Texas A&M University, College Station, USA",
        "aff_domain": "cse.tamu.edu;cse.tamu.edu",
        "email": "cse.tamu.edu;cse.tamu.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Dept. of Computer Science and Engineering, Texas A&M University, College Station, USA",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "94df5a5cb5",
        "title": "Operational Space Control of Constrained and Underactuated Systems",
        "site": "https://www.roboticsproceedings.org/rss07/p31.html",
        "author": "Michael Mistry; Ludovic Righetti",
        "abstract": "The operational space formulation (Khatib, 1987), applied to rigid-body manipulators, describes how to decouple task-space and null-space dynamics, and write control equations that correspond only to forces at the end-effector or, alternatively, only to motion within the null-space.   We would like to apply this useful theory to modern humanoids and other legged systems, for manipulation or similar tasks, however these systems present additional challenges due to their underactuated floating bases and contact states that can dynamically change.   In recent work, Sentis et al. derived controllers for such systems by implementing a task Jacobian projected into a space consistent with the supporting constraints and underactuation (the so called \"support consistent reduced Jacobian\").  Here, we take a new approach to derive operational space controllers for constrained underactuated systems, by first considering the operational space dynamics within \"projected inverse-dynamics\" (Aghili, 2005), and subsequently resolving underactuation through the addition of dynamically consistent control torques.  Doing so results in a simplified control solution compared with previous results, and importantly yields several new insights into the underlying problem of operational space control in constrained environments:  1) Underactuated systems, such as humanoid robots, cannot in general completely decouple task and null-space dynamics.   However, 2) there may exist an infinite number of control solutions to realize desired task-space dynamics, and 3) these solutions involve the addition of dynamically consistent null-space motion or constraint forces (or combinations of both).  In light of these findings, we present several possible control solutions, with varying optimization criteria, and highlight some of their practical consequences.",
        "bibtex": "@INPROCEEDINGS{Mistry-RSS-11, \r\n    AUTHOR    = {Michael Mistry AND Ludovic Righetti}, \r\n    TITLE     = {Operational Space Control of Constrained and Underactuated Systems}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.031} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p31.pdf",
        "supp": "",
        "pdf_size": 981260,
        "gs_citation": 109,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4901958893845180364&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 21,
        "aff": "Disney Research Pittsburgh; University of Southern California",
        "aff_domain": "disneyresearch.com;a3.epfl.ch",
        "email": "disneyresearch.com;a3.epfl.ch",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1",
        "aff_unique_norm": "Disney Research;University of Southern California",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.disneyresearch.com/pittsburgh;https://www.usc.edu",
        "aff_unique_abbr": "Disney Research;USC",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Pittsburgh;Los Angeles",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "1b8e2be4f1",
        "title": "Probabilistic Analysis of Correctness of High-Level Robot Behavior with Sensor Error",
        "site": "https://www.roboticsproceedings.org/rss07/p20.html",
        "author": "Benjamin Johnson; Hadas Kress-Gazit",
        "abstract": "This paper presents a method for reasoning about the effects of sensor error on high-level robot behavior. We consider robot controllers that are synthesized from a set of highlevel, temporal logic task specifications, such that the resulting robot behavior is guaranteed to satisfy these specifications when assuming perfect sensors and actuators. We relax the assumption of perfect sensing, and calculate the probability with which the controller satisfies a set of temporal logic specifications.  We consider parametric representations, where the satisfaction probability is found as a function of the model parameters, and numerical representations, allowing for the analysis of large examples. We illustrate our approach with three examples of varying size that provide insight into unintuitive effects of sensor error that can inform the specification design process.",
        "bibtex": "@INPROCEEDINGS{Johnson-RSS-11, \r\n    AUTHOR    = {Benjamin Johnson AND Hadas Kress-Gazit}, \r\n    TITLE     = {Probabilistic Analysis of Correctness of High-Level Robot Behavior with Sensor Error}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.020} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p20.pdf",
        "supp": "",
        "pdf_size": 480032,
        "gs_citation": 43,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11354682360473902177&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Sibley School of Mechanical and Aerospace Engineering, Cornell University; Sibley School of Mechanical and Aerospace Engineering, Cornell University",
        "aff_domain": "cornell.edu;cornell.edu",
        "email": "cornell.edu;cornell.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Cornell University",
        "aff_unique_dep": "Sibley School of Mechanical and Aerospace Engineering",
        "aff_unique_url": "https://www.cornell.edu",
        "aff_unique_abbr": "Cornell",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Ithaca",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "e65fc2a8ff",
        "title": "Real-time prioritized kinematic control under inequality constraints for redundant manipulators",
        "site": "https://www.roboticsproceedings.org/rss07/p21.html",
        "author": "Oussama Kanoun",
        "abstract": "This paper describes a fast algorithm for the prioritized kinematic control of redundant manipulators. Building on the classical prioritized task framework, the focus is set on efficient computation and handling of inequality constraints throughout priority levels. Classical approaches that tend to account for inequality constraints through potential fields are computationally competitive but have quality issues. Formulating the same control problems with a Quadratic Program (QP) removes these issues but is known to be costly. The following work revisits the formulation of a hierarchy of QPs for the prioritized control of redundant manipulators and proposes an algorithm that can meet real time requirements for current humanoid robots. Because lower control objectives often become infeasible, a particular point of focus is the numerical stability, hereby addressed with Tikhonov regularization. The method was tested in simulation for the control of the humanoid robot HRP-2.",
        "bibtex": "@INPROCEEDINGS{Kanoun-RSS-11, \r\n    AUTHOR    = {Oussama Kanoun}, \r\n    TITLE     = {Real-time prioritized kinematic control under inequality constraints for redundant manipulators}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.021} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p21.pdf",
        "supp": "",
        "pdf_size": 1133960,
        "gs_citation": 48,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=296434643653937746&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Department of Mechano-Informatics, The University of Tokyo",
        "aff_domain": "ynl.t.u-tokyo.ac.jp",
        "email": "ynl.t.u-tokyo.ac.jp",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "The University of Tokyo",
        "aff_unique_dep": "Department of Mechano-Informatics",
        "aff_unique_url": "https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "UTokyo",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "e57894bd30",
        "title": "Sliding Manipulation of Rigid Bodies on a Controlled 6-DoF Plate",
        "site": "https://www.roboticsproceedings.org/rss07/p43.html",
        "author": "Tom Vose; Paul Umbanhowar; Kevin Lynch",
        "abstract": "We model the full dynamics of a rigid part in three-point frictional sliding contact with a flat rigid 6-degree-of-freedom plate.  Given a periodic plate motion and the geometric, inertial, and frictional properties of the part, we define an asymptotic twist field mapping each part configuration to a unique part twist (linear and angular velocity).  Asymptotic twist vectors in the field approximate the part's cycle-averaged twist at each configuration and are independent of time or the system's initial state.  Simulations and experiments show that the trajectory of the part's configuration as it slides on the plate is well described by the field.  With the ability to program arbitrary plate motions, part manipulation reduces to finding plate motions that generate asymptotic twist fields to accomplish desired tasks.  Several simple fields useful for manipulation tasks (e.g., sensorless part alignment) are verified in simulation and experiment.  For the special case of a rigid part with infinitesimal thickness, we show that the part's cycle-averaged twist for any configuration asymptotically converges to a unique asymptotic twist vector.",
        "bibtex": "@INPROCEEDINGS{Vose-RSS-11, \r\n    AUTHOR    = {Tom Vose AND Paul Umbanhowar AND Kevin Lynch }, \r\n    TITLE     = {Sliding Manipulation of Rigid Bodies on a Controlled 6-DoF Plate}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.043} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p43.pdf",
        "supp": "",
        "pdf_size": 2787924,
        "gs_citation": 59,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2564161786504268742&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 18,
        "aff": "Department of Mechanical Engineering, Northwestern University; Department of Mechanical Engineering, Northwestern University; Department of Mechanical Engineering, Northwestern University + Northwestern Institute on Complex Systems",
        "aff_domain": "northwestern.edu;northwestern.edu;northwestern.edu",
        "email": "northwestern.edu;northwestern.edu;northwestern.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0+1",
        "aff_unique_norm": "Northwestern University;Northwestern Institute on Complex Systems",
        "aff_unique_dep": "Department of Mechanical Engineering;",
        "aff_unique_url": "https://www.northwestern.edu;",
        "aff_unique_abbr": "NU;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "e41ea2b948",
        "title": "Spatial Formation Model for Initiating Conversation",
        "site": "https://www.roboticsproceedings.org/rss07/p39.html",
        "author": "Chao Shi; Michihiro Shimada; Takayuki Kanda;  Hiroshi Ishiguro; Norihiro Hagita",
        "abstract": "In a situation where a robot initiates conversation with a person, when is the appropriate timing and where is an appropriate position from which to say the first greeting word? In this study, we analyze human interaction and establish a model for a natural way of initiating conversation. The model mainly concerns the participation state and spatial formation. When a person is going to participate in a conversation, at a moment when a particular spatial formation occurs, she would feel that she is participating in the conversation; once she perceived her participation she would try to maintain particular spatial formations. There are theories in human communication for these concepts, but they only cover the situation after people have started to talk. We build a model that precisely describes the constraints and expected behaviors for the phase of initiating conversation. The proposed model is implemented in a humanoid robot, and it is confirmed as effective in an evaluation experiment based on a shopkeeper scenario.",
        "bibtex": "@INPROCEEDINGS{Shi-RSS-11, \r\n    AUTHOR    = {Chao Shi AND Michihiro Shimada AND Takayuki Kanda AND  Hiroshi Ishiguro AND Norihiro Hagita}, \r\n    TITLE     = {Spatial Formation Model for Initiating Conversation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.039} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p39.pdf",
        "supp": "",
        "pdf_size": 770047,
        "gs_citation": 98,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9304601313305394535&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "ATR IRC Laboratories; ATR IRC Laboratories; ATR IRC Laboratories; ATR IRC Laboratories + Osaka University; ATR IRC Laboratories",
        "aff_domain": "irl.sys.es.osaka-u.ac.jp;atr.jp;atr.jp;atr.jp;atr.jp",
        "email": "irl.sys.es.osaka-u.ac.jp;atr.jp;atr.jp;atr.jp;atr.jp",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0+1;0",
        "aff_unique_norm": "ATR IRC Laboratories;Osaka University",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://www.osaka-u.ac.jp",
        "aff_unique_abbr": ";Osaka U",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";Japan"
    },
    {
        "id": "c71aaf5174",
        "title": "TERMES: An Autonomous Robotic System for Three-Dimensional Collective Construction",
        "site": "https://www.roboticsproceedings.org/rss07/p35.html",
        "author": "Kirstin Petersen; Radhika Nagpal;  Justin Werfel",
        "abstract": "Collective construction is the research area in which autonomous multi-robot systems build structures according to user specifications.  Here we present a hardware system and high-level control scheme for autonomous construction of 3D structures under conditions of gravity.  The hardware comprises a mobile robot and specialized passive blocks; the robot is able to manipulate blocks to build desired structures, and can maneuver on these structures as well as in unstructured environments.  We describe and evaluate the robot's key capabilities of climbing, navigation, and manipulation, and demonstrate its ability to perform complex tasks that combine these capabilities by having it autonomously build a ten-block staircase taller than itself.  In addition, we outline a simple decentralized control algorithm by which multiple simultaneously active robots could autonomously build user-specified structures, working from a high-level description as input.",
        "bibtex": "@INPROCEEDINGS{Petersen-RSS-11, \r\n    AUTHOR    = {Kirstin Petersen AND Radhika Nagpal AND  Justin Werfel}, \r\n    TITLE     = {TERMES: An Autonomous Robotic System for Three-Dimensional Collective Construction}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.035} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p35.pdf",
        "supp": "",
        "pdf_size": 6963581,
        "gs_citation": 249,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9327783789647764162&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": "SEAS/Wyss Institute, Harvard University, Cambridge, MA 02138; SEAS/Wyss Institute, Harvard University, Cambridge, MA 02138; Wyss Institute, Harvard University, Cambridge, MA 02138",
        "aff_domain": "eecs.harvard.edu;eecs.harvard.edu;wyss.harvard.edu",
        "email": "eecs.harvard.edu;eecs.harvard.edu;wyss.harvard.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "SEAS/Wyss Institute, Harvard University, Cambridge, MA 02138;Wyss Institute, Harvard University, Cambridge, MA 02138",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "d62150fb3e",
        "title": "The Motion Grammar: Linguistic Perception, Planning, and Control",
        "site": "https://www.roboticsproceedings.org/rss07/p07.html",
        "author": "Neil Dantam; Mike Stilman",
        "abstract": "We present and analyze the Motion Grammar: a novel unified   representation for task decomposition, perception, planning, and   control that provides both fast online control of robots in   uncertain environments and the ability to guarantee completeness and   correctness.  The grammar represents a policy for the task which is   parsed in real-time based on perceptual input.  Branches of the   syntax tree form the levels of a hierarchical decomposition, and the   individual robot sensor readings are given by tokens.  We implement   this approach in the interactive game of Yamakuzushi on a physical   robot resulting in a system that repeatably competes with a human   opponent in sustained game-play for the roughly six minute duration   of each match.",
        "bibtex": "@INPROCEEDINGS{Dantam-RSS-11, \r\n    AUTHOR    = {Neil Dantam AND Mike Stilman}, \r\n    TITLE     = {The Motion Grammar: Linguistic Perception, Planning, and Control}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.007} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p07.pdf",
        "supp": "",
        "pdf_size": 3507382,
        "gs_citation": 36,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9648276305077644296&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": "School of Interactive Computing, Center for Robotics and Intelligent Machines, Georgia Institute of Technology; School of Interactive Computing, Center for Robotics and Intelligent Machines, Georgia Institute of Technology",
        "aff_domain": "gatech.edu;cc.gatech.edu",
        "email": "gatech.edu;cc.gatech.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "School of Interactive Computing, Center for Robotics and Intelligent Machines, Georgia Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "92f8beced1",
        "title": "Tracking-Based Semi-Supervised Learning",
        "site": "https://www.roboticsproceedings.org/rss07/p42.html",
        "author": "Alex Teichman; Sebastian Thrun",
        "abstract": "In this paper, we consider a semi-supervised approach to the problem of track classification in dense 3D range data.  This problem involves the classification of objects that have been segmented and tracked without the use of a class model.    We propose a method based on the EM algorithm: iteratively 1) train a classifier, and 2) extract useful training examples from unlabeled data by exploiting tracking information.  We evaluate our method on a large multiclass problem in dense LIDAR data collected from natural suburban street scenes.  When given only three hand-labeled training tracks of each object class, semi-supervised performance is comparable to that of the fully-supervised equivalent which uses thousands of hand-labeled training tracks.  Further, when given additional unlabeled data, the semi-supervised method outperforms the supervised method.    Finally, we show that a simple algorithmic speedup based on incrementally updating a boosting classifier can reduce learning time by a factor of three.",
        "bibtex": "@INPROCEEDINGS{Teichman-RSS-11, \r\n    AUTHOR    = {Alex Teichman AND Sebastian Thrun}, \r\n    TITLE     = {Tracking-Based Semi-Supervised Learning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.042} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p42.pdf",
        "supp": "",
        "pdf_size": 2838063,
        "gs_citation": 104,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7989006576036128347&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 16,
        "aff": "Stanford University; Stanford University",
        "aff_domain": "stanford.edu;stanford.edu",
        "email": "stanford.edu;stanford.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Stanford University",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.stanford.edu",
        "aff_unique_abbr": "Stanford",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Stanford",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "178c3412d8",
        "title": "Understanding Slip Perception of Soft Fingertips by Modeling and Simulating Stick-Slip Phenomenon",
        "site": "https://www.roboticsproceedings.org/rss07/p19.html",
        "author": "Van Ho; Shinichi  Hirai",
        "abstract": "Slip, especially incipient slip, is a complicated process for soft_fingertips; and detection of this slip is important for stable manipulations by both human and robotic fingertips. Experimental_research has attempted to explain this phenomenon, but  dynamic_changes during this process could not be fully delineated. We_propose here a dynamic model to investigate the sliding motion of_soft fingertips on a plane with friction. The fingertip is comprised_of a finite number of elastic, compressible and bendable cantilevers whose free ends act as infinitesimal contact points. The contact surface is afterward meshed using a finite element method based on the coordinates of the contact points. By introducing Coulomb's law_and contact compliance into each contact point, we were able to assess the frictional characteristics of the sliding motions of the fingertips. We also could successfully describe the dynamically localized displacements on the contact surface during stick-slip transition, displacements that represent the sliding motion of a_soft fingertip. This model can be applied to different shapes of_robotic fingertip, including the cylindrical and hemispherical_models tested here. We also performed experiments to validate the proposed simulation, including force/moment and vision setups.",
        "bibtex": "@INPROCEEDINGS{Ho-RSS-11, \r\n    AUTHOR    = {Van Ho AND Shinichi  Hirai}, \r\n    TITLE     = {Understanding Slip Perception of Soft Fingertips by Modeling and Simulating Stick-Slip Phenomenon}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.019} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p19.pdf",
        "supp": "",
        "pdf_size": 4045215,
        "gs_citation": 27,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12411310763927656633&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "4ece00e53d",
        "title": "Unmanned Aircraft Collision Avoidance using Continuous-State POMDPs",
        "site": "https://www.roboticsproceedings.org/rss07/p01.html",
        "author": "Haoyu Bai; David Hsu;  Mykel Kochenderfer; Wee Sun Lee",
        "abstract": "An effective collision avoidance system for unmanned aircraft will enable them to fly in civil airspace and greatly expand their applications. One promising approach is to model the system as a partially observable Markov decision process (POMDP) and generate the threat resolution logic automatically by solving the model. However, existing discrete-state POMDP algorithms cannot cope with the high-dimensional state space in collision avoidance POMDPs. Using a recently-developed algorithm called Monte Carlo Value Iteration (MCVI), we constructed several continuous-state POMDP models and solved them directly without discretizing the state space. Simulation results show that our 3-D continuous-state models reduce the collision risk by up to 70 times, compared with earlier 2-D discrete-state POMDP models. The success demonstrates both the benefits of continuous-state POMDP models for collision avoidance systems and the latest algorithmic progress in solving these complex models.",
        "bibtex": "@INPROCEEDINGS{Bai-RSS-11, \r\n    AUTHOR    = {Haoyu Bai AND David Hsu AND  Mykel Kochenderfer AND Wee Sun Lee}, \r\n    TITLE     = {Unmanned Aircraft Collision Avoidance using Continuous-State POMDPs}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.001} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p01.pdf",
        "supp": "",
        "pdf_size": 402331,
        "gs_citation": 122,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=795147888099992044&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "ab451b2d9b",
        "title": "Visual Segmentation of Simple Objects for Robots",
        "site": "https://www.roboticsproceedings.org/rss07/p30.html",
        "author": "Ajay Mishra; Yiannis Aloimonos",
        "abstract": "The ability to automatically segment a simple  object of any size from its background is important for an  active agent (e.g. a robot) to interact effectively in the real world.  Recently, we proposed an algorithm [12] to segment a simple  object in a scale invariant manner, given a point anywhere  inside that object. However, in [12], a strategy to select the  point inside a simple object was not provided. In this paper,  we propose a new system that automatically selects the points inside different simple objects in the scene, carries out the  segmentation process for the selected points, and outputs only  the regions corresponding to the simple objects in the scene.  The proposed attention mechanism for the segmentation problem  utilizes, for the first time, the concept of border ownership [17].",
        "bibtex": "@INPROCEEDINGS{Mishra-RSS-11, \r\n    AUTHOR    = {Ajay Mishra AND Yiannis Aloimonos}, \r\n    TITLE     = {Visual Segmentation of Simple Objects for Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2011}, \r\n    ADDRESS   = {Los Angeles, CA, USA}, \r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2011.VII.030} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss07/p30.pdf",
        "supp": "",
        "pdf_size": 6806074,
        "gs_citation": 44,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16034965293667755484&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    }
]