[
    {
        "id": "95d047797e",
        "title": "3D laser scan classification using web data and domain adaptation",
        "site": "https://www.roboticsproceedings.org/rss05/p22.html",
        "author": "K. Lai and D. Fox",
        "abstract": "Over the last years, object recognition has become\r\na more and more active field of research in robotics. An\r\nimportant problem in object recognition is the need for sufficient\r\nlabeled training data to learn good classifiers. In this paper\r\nwe show how to significantly reduce the need for manually\r\nlabeled training data by leveraging data sets available on the\r\nWorld Wide Web. Specifically, we show how to use objects from\r\nGoogleâ\u0080\u0099s 3D Warehouse to train classifiers for 3D laser scans\r\ncollected by a robot navigating through urban environments.\r\nIn order to deal with the different characteristics of the web\r\ndata and the real robot data, we additionally use a small set\r\nof labeled 3D laser scans and perform domain adaptation. Our\r\nexperiments demonstrate that additional data taken from the 3D\r\nWarehouse along with our domain adaptation greatly improves\r\nthe classification accuracy on real laser scans.",
        "bibtex": "@INPROCEEDINGS{ Lai-RSS-09,\r\n    AUTHOR    = {K. Lai AND D. Fox},\r\n    TITLE     = {3{D} laser scan classification using web data and domain adaptation},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.022} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p22.pdf",
        "supp": "",
        "pdf_size": 1883939,
        "gs_citation": 89,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3008150433931125350&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "918343694b",
        "title": "3D relative pose estimation from six distances",
        "site": "https://www.roboticsproceedings.org/rss05/p30.html",
        "author": "N. Trawny; X. S. Zhou and S. I. Roumeliotis",
        "abstract": "In this paper, we present three fast, hybrid numericalgebraic\r\nmethods to solve polynomial systems in floating point\r\nrepresentation, based on the eigendecomposition of a so-called\r\nmultiplication matrix. In particular, these methods run using\r\nstandard double precision, use only linear algebra packages,\r\nand are easy to implement. We provide the proof that these\r\nmethods do indeed produce valid multiplication matrices, and\r\nshow their relationship. As a specific application, we use our\r\nalgorithms to compute the 3D relative translation and orientation\r\nbetween two robots, based on known egomotion and six robotto-\r\nrobot distance measurements. Equivalently, the same system\r\nof equations arises when solving the forward kinematics of the\r\ngeneral Stewart-Gough mechanism. Our methods can find all\r\n40 solutions, trading off speed (0.08s to 1.5s, depending on the\r\nchoice of method) for accuracy.",
        "bibtex": "@INPROCEEDINGS{ Trawny-RSS-09,\r\n    AUTHOR    = {N. Trawny AND X. S. Zhou AND S. I. Roumeliotis},\r\n    TITLE     = {3{D} relative pose estimation from six distances},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.030} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p30.pdf",
        "supp": "",
        "pdf_size": 256364,
        "gs_citation": 24,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11932667867083540471&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "9d46568c9f",
        "title": "Accurate rough terrain estimation with space-carving kernels",
        "site": "https://www.roboticsproceedings.org/rss05/p19.html",
        "author": "R. Hadsell; J. A. Bagnell; D. Huber and M. Hebert",
        "abstract": "Accurate terrain estimation is critical for autonomous\r\noffroad navigation. Reconstruction of a 3D surface\r\nallows rough and hilly ground to be represented, yielding faster\r\ndriving and better planning and control. However, data from\r\na 3D sensor samples the terrain unevenly, quickly becoming\r\nsparse at longer ranges and containing large voids because\r\nof occlusions and inclines. The proposed approach uses online\r\nkernel-based learning to estimate a continuous surface over the\r\narea of interest while providing upper and lower bounds on\r\nthat surface. Unlike other approaches, visibility information is\r\nexploited to constrain the terrain surface and increase precision,\r\nand an efficient gradient-based optimization allows for realtime\r\nimplementation.",
        "bibtex": "@INPROCEEDINGS{ Hadsell-RSS-09,\r\n    AUTHOR    = {R. Hadsell AND J. A. Bagnell AND D. Huber AND M. Hebert},\r\n    TITLE     = {Accurate rough terrain estimation with space-carving kernels},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.019} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p19.pdf",
        "supp": "",
        "pdf_size": 3765596,
        "gs_citation": 56,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11450142017656079650&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "73bf230c3a",
        "title": "Adaptive relative bundle adjustment",
        "site": "https://www.roboticsproceedings.org/rss05/p23.html",
        "author": "G. Sibley; C. Mei; I. Reid and P. Newman",
        "abstract": "It is well known that bundle adjustment is the\r\noptimal non-linear least-squares formulation of the simultaneous\r\nlocalization and mapping problem, in that its maximum\r\nlikelihood form matches the definition of the Cramer Rao\r\nLower Bound. Unfortunately, computing the ML solution is\r\noften prohibitively expensive â\u0080\u0093 this is especially true during loop\r\nclosures, which often necessitate adjusting all parameters in a\r\nloop. In this paper we note that it is precisely the choice of a single\r\nprivileged coordinate frame that makes bundle adjustment costly,\r\nand that this expense can be avoided by adopting a completely\r\nrelative approach. We derive a new relative bundle adjustment,\r\nwhich instead of optimizing in a single Euclidean space, works\r\nin a metric-space defined by a connected Riemannian manifold.\r\nUsing an adaptive optimization strategy, we show experimentally\r\nthat it is possible to solve for the full ML solution incrementally\r\nin constant time â\u0080\u0093 even at loop closure. Our system also operates\r\nonline in real-time using stereo data, with fast appearance-based\r\nloop closure detection. We show results for sequences of 23k\r\nframes over 1.08km that indicate the accuracy of the approach.",
        "bibtex": "@INPROCEEDINGS{ Sibley-RSS-09,\r\n    AUTHOR    = {G. Sibley AND C. Mei AND I. Reid AND P. Newman},\r\n    TITLE     = {Adaptive relative bundle adjustment},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.023} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p23.pdf",
        "supp": "",
        "pdf_size": 561933,
        "gs_citation": 222,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8902678152058947610&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "55a111fb11",
        "title": "An Ab-initio tree-based exploration to enhance sampling of low-energy protein conformations",
        "site": "https://www.roboticsproceedings.org/rss05/p31.html",
        "author": "A. Shehu",
        "abstract": "This paper proposes a robotics-inspired method\r\nto enhance sampling of native-like protein conformations when\r\nemploying only amino-acid sequence. Computing such conformations,\r\nessential to associate structural and functional information\r\nwith gene sequences, is challenging due to the high-dimensionality\r\nand the rugged energy surface of the protein conformational\r\nspace. The contribution of this work is a novel two-layered\r\nmethod to enhance the sampling of geometrically-distinct lowenergy\r\nconformations at a coarse-grained level of detail. The\r\nmethod grows a tree in conformational space reconciling two\r\ngoals: (i) guiding the tree towards lower energies and (ii) not oversampling\r\ngeometrically-similar conformations. Discretizations of\r\nthe energy surface and a low-dimensional projection space are\r\nemployed to select more often for expansion low-energy conformations\r\nin under-explored regions of the conformational space.\r\nThe tree is expanded with low-energy conformations through\r\na Metropolis Monte Carlo framework that uses a move set of\r\nphysical fragment configurations. Testing on sequences of seven\r\nsmall-to-medium structurally-diverse proteins shows that the\r\nmethod rapidly samples native-like conformations in a few hours\r\non a single CPU. Analysis shows that computed conformations\r\nare good candidates for further detailed energetic refinements by\r\nlarger studies in protein engineering and design.",
        "bibtex": "@INPROCEEDINGS{ Shehu-RSS-09,\r\n    AUTHOR    = {A. Shehu},\r\n    TITLE     = {An Ab-initio tree-based exploration to enhance sampling of low-energy protein conformations},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.031} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p31.pdf",
        "supp": "",
        "pdf_size": 1981814,
        "gs_citation": 37,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17597076950473876889&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Department of Computer Science, George Mason University, Fairfax, Virginia 22030",
        "aff_domain": "cs.gmu.edu",
        "email": "cs.gmu.edu",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Department of Computer Science, George Mason University, Fairfax, Virginia 22030",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": ""
    },
    {
        "id": "2503697f75",
        "title": "Approximating displacement with the body velocity integral",
        "site": "https://www.roboticsproceedings.org/rss05/p6.html",
        "author": "R. L. Hatton and H. Choset",
        "abstract": "In this paper, we present a technique for approximating\r\nthe net displacement of a locomoting system over a\r\ngait without directly integrating its equations of motion. The\r\napproximation is based on a volume integral, which, among\r\nother benefits, is more open to optimization by algorithm or\r\ninspection than is the full displacement integral. Specifically, we\r\ndevelop the concept of a body velocity integral (BVI), which\r\nis computable over a gait as a volume integral via Stokesâ\u0080\u0099s\r\ntheorem. We then demonstrate that, given an appropriate choice\r\nof coordinates, the BVI for a gait approximates the displacement\r\nof the system over that gait. This consideration of coordinate\r\nchoice is a new approach to locomotion problems, and provides\r\nsignificantly improved results over past attempts to apply Stokesâ\u0080\u0099s\r\ntheorem to gait analysis.",
        "bibtex": "@INPROCEEDINGS{ Hatton-RSS-09,\r\n    AUTHOR    = {R. L. Hatton AND H. Choset},\r\n    TITLE     = {Approximating displacement with the body velocity integral},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.006} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p6.pdf",
        "supp": "",
        "pdf_size": 1339580,
        "gs_citation": 38,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2097693478925378326&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "6ae09e6872",
        "title": "Bridging the gap between passivity and transparency",
        "site": "https://www.roboticsproceedings.org/rss05/p36.html",
        "author": "M. Franken; S. Stramigioli; R. Reilink; C. Secchi and A. Macchelli",
        "abstract": "In this paper a structure will be given which in a\r\nremarkably simple way offers a solution to the implementation\r\nof different telemanipulation schemes for discrete time varying\r\ndelays by preserving passivity and allowing the highest transparency\r\npossible. This is achieved by splitting the communication\r\nchannel in two separate ones, one for the energy balance which\r\nwill ensure passivity and one for the haptic information between\r\nmaster and slave and which will address transparency. The\r\nauthors believe that this structure is the most general up to\r\ndate which preserves passivity under discrete time varying delays\r\nallowing different control schemes to address transparency.",
        "bibtex": "@INPROCEEDINGS{ Franken-RSS-09,\r\n    AUTHOR    = {M. Franken AND S. Stramigioli AND R. Reilink AND C. Secchi AND A. Macchelli},\r\n    TITLE     = {Bridging the gap between passivity and transparency},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.036} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p36.pdf",
        "supp": "",
        "pdf_size": 312944,
        "gs_citation": 60,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11246337910708510825&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0f82954458",
        "title": "Cellular muscle actuators with variable resonant frequencies",
        "site": "https://www.roboticsproceedings.org/rss05/p32.html",
        "author": "T. W. Secord and H. H. Asada",
        "abstract": "This paper presents the design and analysis of a\r\nnovel variable stiffness and variable resonance actuator based\r\non a cellular arrangement of piezoelectric devices. The cellular\r\nmuscle actuator design concept is presented followed by a\r\ngeneral dynamic model for establishing the theoretical bounds\r\non achievable resonant frequencies. A model that is specific to\r\nthe proposed design is then formulated to include the effects of\r\nparasitic dynamics. The resonance characteristics of a three cell\r\nprototype system are identified experimentally. The theoretical\r\nmodel and experimental results agree over a large frequency\r\nrange and illustrate the variable resonance concept.",
        "bibtex": "@INPROCEEDINGS{ Secord-RSS-09,\r\n    AUTHOR    = {T. W. Secord AND H. H. Asada},\r\n    TITLE     = {Cellular muscle actuators with variable resonant frequencies},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.032} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p32.pdf",
        "supp": "",
        "pdf_size": 739341,
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3906182092958053850&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "647f5b6bb4",
        "title": "Centralized path planning for multiple robots: Optimal decoupling into sequential plans",
        "site": "https://www.roboticsproceedings.org/rss05/p18.html",
        "author": "J. van den Berg; J. Snoeyink; M. Lin and D. Manocha",
        "abstract": "We develop an algorithm to decouple a multi-robot\r\npath planning problem into subproblems whose solutions can\r\nbe executed sequentially. Given an external path planner for\r\ngeneral configuration spaces, our algorithm finds an execution\r\nsequence that minimizes the dimension of the highest-dimensional\r\nsubproblem over all possible execution sequences. If the external\r\nplanner is complete (at least up to this minimum dimension),\r\nthen our algorithm is complete because it invokes the external\r\nplanner only for spaces of dimension at most this minimum. Our\r\nalgorithm can decouple and solve path planning problems with\r\nmany robots, even with incomplete external planners. We show\r\nscenarios involving 16 to 65 robots, where our algorithm solves\r\nplanning problems of dimension 32 to 130 using a PRM planner\r\nfor at most eight dimensions.",
        "bibtex": "@INPROCEEDINGS{ Berg-RSS-09,\r\n    AUTHOR    = {J. van den Berg AND J. Snoeyink AND M. Lin AND D. Manocha},\r\n    TITLE     = {Centralized path planning for multiple robots: Optimal decoupling into sequential plans},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.018} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p18.pdf",
        "supp": "",
        "pdf_size": 1852443,
        "gs_citation": 220,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16131584342542439900&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "5e426c05da",
        "title": "Cooperative manipulation and transportation with aerial robots",
        "site": "https://www.roboticsproceedings.org/rss05/p1.html",
        "author": "N. Michael; J. Fink and V. Kumar",
        "abstract": "In this paper we consider the problem of controlling\r\nmultiple robots manipulating and transporting a payload in\r\nthree dimensions via cables. We develop robot configurations\r\nthat ensure static equilibrium of the payload at a desired pose\r\nwhile respecting constraints on the tension and provide analysis\r\nof payload stability for these configurations. We demonstrate\r\nour methods on a team of aerial robots via simulation and\r\nexperimentation.",
        "bibtex": "@INPROCEEDINGS{ Michael-RSS-09,\r\n    AUTHOR    = {N. Michael AND J. Fink AND V. Kumar},\r\n    TITLE     = {Cooperative manipulation and transportation with aerial robots},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.001} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p1.pdf",
        "supp": "",
        "pdf_size": 6305554,
        "gs_citation": 951,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18272049672119784238&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 20,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "fb66880e56",
        "title": "Efficient, guaranteed search with multi-agent teams",
        "site": "https://www.roboticsproceedings.org/rss05/p34.html",
        "author": "G. Hollinger; S. Singh and A. Kehagias",
        "abstract": "Here we present an anytime algorithm for clearing\r\nan environment using multiple searchers. Prior methods in\r\nthe literature treat multi-agent search as either a worst-case\r\nproblem (i.e., clear an environment of an adversarial evader\r\nwith potentially infinite speed), or an average-case problem (i.e.,\r\nminimize average capture time given a model of the targetâ\u0080\u0099s\r\nmotion). We introduce an algorithm that combines finite-horizon\r\nplanning with spanning tree traversal methods to generate plans\r\nthat clear the environment of a worst-case adversarial target and\r\nhave good average-case performance considering a target motion\r\nmodel. Our algorithm is scalable to large teams of searchers\r\nand yields theoretically bounded average-case performance. We\r\nhave tested our proposed algorithm through a large number of\r\nexperiments in simulation and with a team of robot and human\r\nsearchers in an office building. Our combined search algorithm\r\nboth clears the environment and reduces average capture times\r\nby up to 75% when compared to a purely worst-case approach.",
        "bibtex": "@INPROCEEDINGS{ Hollinger-RSS-09,\r\n    AUTHOR    = {G. Hollinger AND S. Singh AND A. Kehagias},\r\n    TITLE     = {Efficient, guaranteed search with multi-agent teams},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.034} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p34.pdf",
        "supp": "",
        "pdf_size": 434510,
        "gs_citation": 21,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11415227829795878193&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 14,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "aa6fd6388a",
        "title": "Explicit parametrizations of the configuration spaces of anthropomorphic multi-linkage systems",
        "site": "https://www.roboticsproceedings.org/rss05/p5.html",
        "author": "L. Han and L. Rudolph",
        "abstract": "Multi-fingered manipulation systems are important\r\nin the study of robotics. These are also challenging systems, in\r\npart because of the loop closure constraints required of several\r\n(virtual) loops each formed by two fingers and the grasped object.\r\nMost existing work describes system configurations using joint\r\nparameters, in which loop closure constraints are expressed by\r\nhighly nonlinear equations. Such a formulation amounts to an\r\nimplicit parametrization of the configuration space (CSpace)\r\nas a lower-dimensional semi-algebraic subset embedded in a\r\nhigher-dimensional ambient joint parameter space. The non-zero\r\ndifference between the two dimensions is the codimension of\r\nCSpace as seen in the given parametrization.\r\nIn this paper, we point out that, quite generally, parametrizations\r\nleading to lower codimensional configuration spaces provide\r\nmulti-faceted advantages over those producing higher codimensions.\r\nFor two example manipulation systemâ\u0080\u0094a 3-fingered hand\r\nand a planar star-manipulator with any number of fingersâ\u0080\u0094\r\nwe present explicit parameterizations, which are effectively of\r\ncodimension 0. We base these parametrizations on our recently\r\ndeveloped construction trees of simplices (such as triangles and\r\ntetrahedra) for multi-object systems; such a tree gives simplexbased\r\nparametrers on CSpace, in which loop closure constraints\r\nbecome simplex formation constraints (such as triangle\r\ninequalities and Cayleyâ\u0080\u0093Menger determinant constraints). Both\r\nexample systems are very difficult to deal with using joint angle\r\nparameters. Our results here further demonstrate the generality\r\nand effectiveness of the simplex-based approach.",
        "bibtex": "@INPROCEEDINGS{ Han-RSS-09,\r\n    AUTHOR    = {L. Han AND L. Rudolph},\r\n    TITLE     = {Explicit parametrizations of the configuration spaces of anthropomorphic multi-linkage systems},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.005} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p5.pdf",
        "supp": "",
        "pdf_size": 362540,
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16142444043179848495&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 9,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "7b5e3664d6",
        "title": "Feedback control for steering needles through 3D deformable tissue using helical paths",
        "site": "https://www.roboticsproceedings.org/rss05/p37.html",
        "author": "K. Hauser; R. Alterovitz; N. Chentanez; A. Okamura and K. Goldberg",
        "abstract": "Bevel-tip steerable needles are a promising new\r\ntechnology for improving accuracy and accessibility in minimally\r\ninvasive medical procedures. As yet, 3D needle steering has not\r\nbeen demonstrated in the presence of tissue deformation and\r\nuncertainty, despite the application of progressively more sophisticated\r\nplanning algorithms. This paper presents a feedback\r\ncontroller that steers a needle along 3D helical paths, and varies\r\nthe helix radius to correct for perturbations. It achieves high\r\naccuracy for targets sufficiently far from the needle insertion\r\npoint; this is counterintuitive because the system is highly underactuated\r\nand not locally controllable. The controller uses a model\r\npredictive control framework that chooses a needle twist rate such\r\nthat the predicted helical trajectory minimizes the distance to the\r\ntarget. Fast branch and bound techniques enable execution at\r\nkilohertz rates on a 2GHz PC. We evaluate the controller under\r\na variety of simulated perturbations, including imaging noise,\r\nneedle deflections, and curvature estimation errors. We also test\r\nthe controller in a 3D finite element simulator that incorporates\r\ndeformation in the tissue as well as the needle. In deformable\r\ntissue examples, the controller reduced targeting error by up to\r\n88% compared to open-loop execution.",
        "bibtex": "@INPROCEEDINGS{ Hauser-RSS-09,\r\n    AUTHOR    = {K. Hauser AND R. Alterovitz AND N. Chentanez AND A. Okamura AND K. Goldberg},\r\n    TITLE     = {Feedback control for steering needles through 3{D} deformable tissue using helical paths},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.037} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p37.pdf",
        "supp": "",
        "pdf_size": 1490843,
        "gs_citation": 89,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4225559918609499354&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 24,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "http://automation.berkeley.edu/projects/needlesteering/",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "fd4130ebfc",
        "title": "Generalized-ICP",
        "site": "https://www.roboticsproceedings.org/rss05/p21.html",
        "author": "A. Segal; D. Haehnel and S. Thrun",
        "abstract": "In this paper we combine the Iterative Closest\r\nPoint (â\u0080\u0099ICPâ\u0080\u0099) and â\u0080\u0098point-to-plane ICPâ\u0080\u0098 algorithms into a single\r\nprobabilistic frame work. We then use this framework to model\r\nlocally planar surface structure from both scans instead of just\r\nthe â\u0080\u009dmodelâ\u0080\u009d scan as is typically done with point-to-plane. This\r\ncan be thought of as â\u0080\u0098plane-to-planeâ\u0080\u0099. The new approach is\r\ntested with both simulated and real-world data and is shown to\r\noutperform both standard ICP and point-to-plane. Furthermore,\r\nthe new approach is shown to be more robust to incorrect\r\ncorrespondences, and thus makes it easier to tune the maximum\r\nmatch distance parameter. In addition to the demonstrated\r\nperformance improvement, the proposed framework allows for\r\nmore expressive probabilistic models to be incorporated into the\r\nICP framework. While maintaining the speed and simplicity\r\nof ICP, Generalized-ICP allows the addition of outlier terms,\r\nmeasurement noise, and other probabilistic techniques to increase\r\nrobustness.",
        "bibtex": "@INPROCEEDINGS{ Segal-RSS-09,\r\n    AUTHOR    = {A. Segal AND D. Haehnel AND S. Thrun},\r\n    TITLE     = {Generalized-ICP},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.021} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p21.pdf",
        "supp": "",
        "pdf_size": 2632504,
        "gs_citation": 2624,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=340160251959314634&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "924d19c6d5",
        "title": "Highly scalable appearance-only SLAM - FAB-MAP 2.0",
        "site": "https://www.roboticsproceedings.org/rss05/p39.html",
        "author": "M. Cummins and P. Newman",
        "abstract": "We describe a new formulation of appearance-only\r\nSLAM suitable for very large scale navigation. The system navigates\r\nin the space of appearance, assigning each new observation\r\nto either a new or previously visited location, without reference to\r\nmetric position. The system is demonstrated performing reliable\r\nonline appearance mapping and loop closure detection over a\r\n1,000km trajectory, with mean filter update times of 14 ms. The\r\n1,000km experiment is more than an order of magnitude larger\r\nthan any previously reported result. The scalability of the system\r\nis achieved by defining a sparse approximation to the FAB-MAP\r\nmodel suitable for implementation using an inverted index. Our\r\nformulation of the problem is fully probabilistic and naturally\r\nincorporates robustness against perceptual aliasing. The 1,000km\r\ndata set comprising almost a terabyte of omni-directional and\r\nstereo imagery is available for use, and we hope that it will serve\r\nas a benchmark for future systems.",
        "bibtex": "@INPROCEEDINGS{ Cummins-RSS-09,\r\n    AUTHOR    = {M. Cummins AND P. Newman},\r\n    TITLE     = {Highly scalable appearance-only {SLAM} - {FAB-MAP} 2.0},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.039} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p39.pdf",
        "supp": "",
        "pdf_size": 768567,
        "gs_citation": 419,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2471807245255731721&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "6ed97f9722",
        "title": "Human motion database with a binary tree and node transition graphs",
        "site": "https://www.roboticsproceedings.org/rss05/p4.html",
        "author": "K. Yamane; Y. Yamaguchi and Y. Nakamura",
        "abstract": "Database of human motion has been widely used for\r\nrecognizing human motion and synthesizing humanoid motions.\r\nIn this paper, we propose a data structure for storing and\r\nextracting human motion data and demonstrate that the database\r\ncan be applied to the recognition and motion synthesis problems\r\nin robotics. We develop an efficient method for building a binary\r\ntree data structure from a set of continuous, multi-dimensional\r\nmotion clips. Each node of the tree represents a statistical\r\ndistribution of a set of human figure states extracted from\r\nthe motion clips. We also identify the valid transitions among\r\nthe nodes and construct node transition graphs. Similar states\r\nin different clips may be grouped into a single node, thereby\r\nallowing transitions between different behaviors. Using databases\r\nconstructed from real human motion data, we demonstrate that\r\nthe proposed data structure can be used for human motion\r\nrecognition, state estimation and prediction, and robot motion\r\nplanning.",
        "bibtex": "@INPROCEEDINGS{ Yamane-RSS-09,\r\n    AUTHOR    = {K. Yamane AND Y. Yamaguchi AND Y. Nakamura},\r\n    TITLE     = {Human motion database with a binary tree and node transition graphs},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.004} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p4.pdf",
        "supp": "",
        "pdf_size": 1472641,
        "gs_citation": 57,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3115317595640765314&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "66064ba326",
        "title": "Inner sphere trees for proximity and penetration queries",
        "site": "https://www.roboticsproceedings.org/rss05/p10.html",
        "author": "R. Weller and G. Zachmann",
        "abstract": "We present a novel geometric data structure for\r\napproximate collision detection at haptic rates between rigid\r\nobjects. Our data structure, which we call inner sphere trees,\r\nsupports different kinds of queries, namely, proximity queries\r\nand a new method for interpenetration computation, the penetration\r\nvolume, which is related to the water displacement of\r\nthe overlapping region and, thus, corresponds to a physically\r\nmotivated force.\r\nThe main idea is to bound objects from the inside with a\r\nset of non-overlapping spheres. Based on such sphere packings, a\r\nâ\u0080\u009cinner bounding volume hierarchyâ\u0080\u009d can be constructed. In order\r\nto do so, we propose to use an AI clustering algorithm, which\r\nwe extend and adapt here.\r\nThe results show performance at haptic rates both for proximity\r\nand penetration volume queries for models consisting of\r\nhundreds of thousands of polygons.",
        "bibtex": "@INPROCEEDINGS{ Weller-RSS-09,\r\n    AUTHOR    = {R. Weller AND G. Zachmann},\r\n    TITLE     = {Inner sphere trees for proximity and penetration queries},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.010} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p10.pdf",
        "supp": "",
        "pdf_size": 6919947,
        "gs_citation": 70,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11040284540277472257&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 26,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "440b0dfb0b",
        "title": "LQR-trees: Feedback motion planning on sparse randomized trees",
        "site": "https://www.roboticsproceedings.org/rss05/p3.html",
        "author": "R. Tedrake",
        "abstract": "Recent advances in the direct computation of Lyapunov\r\nfunctions using convex optimization make it possible to\r\nefficiently evaluate regions of stability for smooth nonlinear\r\nsystems. Here we present a feedback motion planning algorithm\r\nwhich uses these results to efficiently combine locally-valid linear\r\nquadratic regulator (LQR) controllers into a nonlinear feedback\r\npolicy which probabilistically covers the reachable area of a\r\n(bounded) state space with a region of stability, certifying that\r\nall initial conditions that are capable of reaching the goal\r\nwill stabilize to the goal. We demonstrate the performance of\r\nthis systematic nonlinear feedback control design algorithm on\r\nthe model underactuated systems and discuss the potential for\r\nthe control of more complicated control problems like bipedal\r\nwalking.",
        "bibtex": "@INPROCEEDINGS{ Tedrake-RSS-09,\r\n    AUTHOR    = {R. Tedrake},\r\n    TITLE     = {{LQR}-trees: Feedback motion planning on sparse randomized trees},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.003} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p3.pdf",
        "supp": "",
        "pdf_size": 501882,
        "gs_citation": 236,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12274661543612837418&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Computer Science and Artificial Intelligence Lab, Massachusetts Institute of Technology",
        "aff_domain": "mit.edu",
        "email": "mit.edu",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "Computer Science and Artificial Intelligence Lab",
        "aff_unique_url": "https://www.csail.mit.edu",
        "aff_unique_abbr": "MIT",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Cambridge",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "cd90a1830f",
        "title": "Large scale graph-based SLAM using aerial images as prior information",
        "site": "https://www.roboticsproceedings.org/rss05/p38.html",
        "author": "R. Kummerle; B. Steder; C. Dornhege; A. Kleiner; G. Grisetti and W. Burgard",
        "abstract": "To effectively navigate in their environments and\r\naccurately reach their target locations, mobile robots require\r\na globally consistent map of the environment. The problem of\r\nlearning a map with a mobile robot has been intensively studied in\r\nthe past and is usually referred to as the simultaneous localization\r\nand mapping (SLAM) problem. However, existing solutions to the\r\nSLAM problem typically rely on loop-closures to obtain global\r\nconsistency and do not exploit prior information even if it is\r\navailable. In this paper, we present a novel SLAM approach\r\nthat achieves global consistency by utilizing publicly accessible\r\naerial photographs as prior information. Our approach inserts\r\ncorrespondences found between three-dimensional laser range\r\nscans and the aerial image as constraints into a graph-based\r\nformulation of the SLAM problem. We evaluate our algorithm\r\nbased on large real-world datasets acquired in a mixed in- and\r\noutdoor environment by comparing the global accuracy with\r\nstate-of-the-art SLAM approaches and GPS. The experimental\r\nresults demonstrate that the maps acquired with our method\r\nshow increased global consistency.",
        "bibtex": "@INPROCEEDINGS{ Kummerle-RSS-09,\r\n    AUTHOR    = {R. Kummerle AND B. Steder AND C. Dornhege AND A. Kleiner AND G. Grisetti AND W. Burgard},\r\n    TITLE     = {Large scale graph-based {SLAM} using aerial images as prior information},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.038} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p38.pdf",
        "supp": "",
        "pdf_size": 1462452,
        "gs_citation": 198,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1210016703210726083&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 31,
        "aff": ";;;;",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "8905a2b915",
        "title": "Learning GP-BayesFilters via Gaussian process latent variable models",
        "site": "https://www.roboticsproceedings.org/rss05/p29.html",
        "author": "J. Ko and D. Fox",
        "abstract": "GP-BayesFilters are a general framework for integrating\r\nGaussian process prediction and observation models into\r\nBayesian filtering techniques, including particle filters and extended\r\nand unscented Kalman filters. GP-BayesFilters learn nonparametric\r\nfilter models from training data containing sequences\r\nof control inputs, observations, and ground truth states. The need\r\nfor ground truth states limits the applicability of GP-BayesFilters\r\nto systems for which the ground truth can be estimated without\r\nprohibitive overhead. In this paper we introduce GPBF-LEARN,\r\na framework for training GP-BayesFilters without any ground\r\ntruth states. Our approach extends Gaussian Process Latent\r\nVariable Models to the setting of dynamical robotics systems.\r\nWe show how weak labels for the ground truth states can be\r\nincorporated into the GPBF-LEARN framework. The approach\r\nis evaluated using a difficult tracking task, namely tracking a\r\nslotcar based on IMU measurements only.",
        "bibtex": "@INPROCEEDINGS{ Ko-RSS-09,\r\n    AUTHOR    = {J. Ko AND D. Fox},\r\n    TITLE     = {Learning {GP}-{B}ayes{F}ilters via {G}aussian process latent variable models},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.029} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p29.pdf",
        "supp": "",
        "pdf_size": 1432427,
        "gs_citation": 135,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18304371635159468589&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 28,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0bbffa203e",
        "title": "Learning of 2D grasping strategies from box-based 3D object approximations",
        "site": "https://www.roboticsproceedings.org/rss05/p2.html",
        "author": "S. Geidenstam; K. Huebner; D. Banksell and D. Kragic",
        "abstract": "In this paper, we bridge and extend the approaches\r\nof 3D shape approximation and 2D grasping strategies. We begin\r\nby applying a shape decomposition to an object, i.e. its extracted\r\n3D point data, using a flexible hierarchy of minimum volume\r\nbounding boxes. From this representation, we use the projections\r\nof points onto each of the valid faces as a basis for finding planar\r\ngrasps. These grasp hypotheses are evaluated using a set of 2D\r\nand 3D heuristic quality measures. Finally on this set of quality\r\nmeasures, we use a neural network to learn good grasps and the\r\nrelevance of each quality measure for a good grasp. We test and\r\nevaluate the algorithm in the GraspIt! simulator.",
        "bibtex": "@INPROCEEDINGS{ Geidenstam-RSS-09,\r\n    AUTHOR    = {S. Geidenstam AND K. Huebner AND D. Banksell AND D. Kragic},\r\n    TITLE     = {Learning of 2{D} grasping strategies from box-based 3{D} object approximations},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.002} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p2.pdf",
        "supp": "",
        "pdf_size": 2099762,
        "gs_citation": 31,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11474441343281987995&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0bdba64c26",
        "title": "Non-parametric learning to aid path planning over slopes",
        "site": "https://www.roboticsproceedings.org/rss05/p28.html",
        "author": "S. Karumanchi; T. Allen; T. Bailey and S. Scheding",
        "abstract": "This paper addresses the problem of closing the\r\nloop from perception to action selection for unmanned ground\r\nvehicles, with a focus on navigating slopes. A new non-parametric\r\nlearning technique is presented to generate a mobility representation\r\nwhere maximum feasible speed is used as a criterion\r\nto classify the world. The inputs to the algorithm are terrain\r\ngradients derived from an elevation map and past observations\r\nof wheel slip. It is argued that such a representation can aid in\r\npath planning with improved selection of vehicle heading and\r\noperating velocity in off-road slopes. Results of mobility map\r\ngeneration and its benefits to path planning are shown.",
        "bibtex": "@INPROCEEDINGS{ Karumanchi-RSS-09,\r\n    AUTHOR    = {S. Karumanchi AND T. Allen AND T. Bailey AND S. Scheding},\r\n    TITLE     = {Non-parametric learning to aid path planning over slopes},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.028} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p28.pdf",
        "supp": "",
        "pdf_size": 895206,
        "gs_citation": 34,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6875088023135418382&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 15,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "d5658d52b4",
        "title": "On the complexity of the set of three-finger caging grasps of convex polygons",
        "site": "https://www.roboticsproceedings.org/rss05/p8.html",
        "author": "M. Vahedi and A. F. van der Stappen",
        "abstract": "We study three-finger caging grasps of convex\r\npolygons. A part is caged with a number of fingers when it\r\nis impossible to rigidly move the part to an arbitrary placement\r\nfar from its initial placement without penetrating any finger. A\r\nconvex polygon with n vertices and a placement of two fingers\r\nâ\u0080\u0094referred to as the base fingersâ\u0080\u0094 are given. The caging region\r\nis the set of all placements of the third finger that together with\r\nthe base fingers cage the polygon. We derive a novel formulation\r\nof caging in terms of visibility in three-dimensional space. We\r\nuse this formulation to prove that the worst-case combinatorial\r\ncomplexity of the caging region is close to O(n3), which is a\r\nsignificant improvement of the previously known upper bound\r\nof O(n6). Moreover we provide an algorithm with a running\r\ntime close to O(n3 log n) that considerably improves the current\r\nbest known algorithm, which runs in O(n6) time.",
        "bibtex": "@INPROCEEDINGS{ Vahedi-RSS-09,\r\n    AUTHOR    = {M. Vahedi AND A. F. van der Stappen},\r\n    TITLE     = {On the complexity of the set of three-finger caging grasps of convex polygons},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.008} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p8.pdf",
        "supp": "",
        "pdf_size": 412862,
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7742169502074751780&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "7238346065",
        "title": "On the consistency of multi-robot cooperative localization",
        "site": "https://www.roboticsproceedings.org/rss05/p9.html",
        "author": "G. P. Huang; N. Trawny; A. I. Mourikis and S. I. Roumeliotis",
        "abstract": "In this paper, we investigate the consistency of\r\nextended Kalman filter (EKF)-based cooperative localization\r\n(CL) from the perspective of observability. To the best of our\r\nknowledge, this is the first work that analytically shows that the\r\nerror-state system model employed in the standard EKF-based\r\nCL always has an observable subspace of higher dimension than\r\nthat of the actual nonlinear CL system. This results in unjustified\r\nreduction of the EKF covariance estimates in directions of the\r\nstate space where no information is available, and thus leads to\r\ninconsistency. To address this problem, we adopt an observabilitybased\r\nmethodology for designing consistent estimators and propose\r\na novel Observability-Constrained (OC)-EKF. In contrast to\r\nthe standard EKF-CL, the linearization points of the OC-EKF\r\nare selected so as to ensure that the dimension of the observable\r\nsubspace remains the same as that of the original (nonlinear)\r\nsystem. The proposed OC-EKF has been tested in simulation\r\nand experimentally, and is shown to significantly outperform the\r\nstandard EKF in terms of both accuracy and consistency.",
        "bibtex": "@INPROCEEDINGS{ Huang-RSS-09,\r\n    AUTHOR    = {G. P. Huang AND N. Trawny AND A. I. Mourikis AND S. I. Roumeliotis},\r\n    TITLE     = {On the consistency of multi-robot cooperative localization},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.009} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p9.pdf",
        "supp": "",
        "pdf_size": 336188,
        "gs_citation": 50,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=225782863125046001&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 15,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "59aa5f810c",
        "title": "POMDPs for robotic tasks with mixed observability",
        "site": "https://www.roboticsproceedings.org/rss05/p26.html",
        "author": "S. C. W. Ong; S. W. Png; D. Hsu and W. S. Lee",
        "abstract": "Partially observable Markov decision processes\r\n(POMDPs) provide a principled mathematical framework for\r\nmotion planning of autonomous robots in uncertain and dynamic\r\nenvironments. They have been successfully applied to\r\nvarious robotic tasks, but a major challenge is to scale up\r\nPOMDP algorithms for more complex robotic systems. Robotic\r\nsystems often have mixed observability: even when a robotâ\u0080\u0099s\r\nstate is not fully observable, some components of the state\r\nmay still be fully observable. Exploiting this, we use a factored\r\nmodel to represent separately the fully and partially observable\r\ncomponents of a robotâ\u0080\u0099s state and derive a compact lowerdimensional\r\nrepresentation of its belief space. We then use this\r\nfactored representation in conjunction with a point-based algorithm\r\nto compute approximate POMDP solutions. Separating\r\nfully and partially observable state components using a factored\r\nmodel opens up several opportunities to improve the efficiency\r\nof point-based POMDP algorithms. Experiments show that on\r\nstandard test problems, our new algorithm is many times faster\r\nthan a leading point-based POMDP algorithm.",
        "bibtex": "@INPROCEEDINGS{ Ong-RSS-09,\r\n    AUTHOR    = {S. C. W. Ong AND S. W. Png AND D. Hsu AND W. S. Lee},\r\n    TITLE     = {{POMDP}s for robotic tasks with mixed observability},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.026} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p26.pdf",
        "supp": "",
        "pdf_size": 173691,
        "gs_citation": 155,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4757831029025318041&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "6c1a4360f7",
        "title": "Planning motion in environments with similar obstacles",
        "site": "https://www.roboticsproceedings.org/rss05/p12.html",
        "author": "J.-M. Lien and Y. Lu",
        "abstract": "In this work, we investigate solutions to the following\r\nquestion: Given two motion planning problems W1 and W2\r\nwith the same robot and similar obstacles, can we reuse the\r\ncomputation from W1 to solve W2 more efficiently? While the\r\nanswer to this question can find many practical applications,\r\nall current motion planners ignore the correspondences between\r\nsimilar environments. Our study shows that by carefully storing\r\nand reusing the computation we can gain significant efficiency.",
        "bibtex": "@INPROCEEDINGS{ Lien-RSS-09,\r\n    AUTHOR    = {J.-M. Lien AND Y. Lu},\r\n    TITLE     = {Planning motion in environments with similar obstacles},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.012} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p12.pdf",
        "supp": "",
        "pdf_size": 721479,
        "gs_citation": 41,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1585388559228280676&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "7e9e8aa337",
        "title": "Policy search via the signed derivative",
        "site": "https://www.roboticsproceedings.org/rss05/p27.html",
        "author": "J. Z. Kolter and A. Y. Ng",
        "abstract": "We consider policy search for reinforcement learning:\r\nlearning policy parameters, for some fixed policy class, that\r\noptimize performance of a system. In this paper, we propose\r\na novel policy gradient method based on an approximation we\r\ncall the Signed Derivative; the approximation is based on the\r\nintuition that it is often very easy to guess the direction in which\r\ncontrol inputs affect future state variables, even if we do not\r\nhave an accurate model of the system. The resulting algorithm\r\nis very simple, requires no model of the environment, and we\r\nshow that it can outperform standard stochastic estimators of\r\nthe gradient; indeed we show that Signed Derivative algorithm\r\ncan in fact perform as well as the true (model-based) policy\r\ngradient, but without knowledge of the model. We evaluate the\r\nalgorithmâ\u0080\u0099s performance on both a simulated task and two realworld\r\ntasks â\u0080\u0094 driving an RC car along a specified trajectory,\r\nand jumping onto obstacles with an quadruped robot â\u0080\u0094 and in\r\nall cases achieve good performance after very little training.",
        "bibtex": "@INPROCEEDINGS{ Kolter-RSS-09,\r\n    AUTHOR    = {J. Z. Kolter AND A. Y. Ng},\r\n    TITLE     = {Policy search via the signed derivative},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.027} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p27.pdf",
        "supp": "",
        "pdf_size": 481824,
        "gs_citation": 83,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7806604205514473290&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "42ea142058",
        "title": "Positioning unmanned aerial vehicles as communication relays for surveillance tasks",
        "site": "https://www.roboticsproceedings.org/rss05/p33.html",
        "author": "O. Burdakov; P. Doherty; K. Holmberg; J. Kvarnstrom and P.-R. Olsson",
        "abstract": "When unmanned aerial vehicles (UAVs) are used to\r\nsurvey distant targets, it is important to transmit sensor information\r\nback to a base station. As this communication often requires\r\nhigh uninterrupted bandwidth, the surveying UAV often needs a\r\nfree line-of-sight to the base station, which can be problematic in\r\nurban or mountainous areas. Communication ranges may also be\r\nlimited, especially for smaller UAVs. Though both problems can\r\nbe solved through the use of relay chains consisting of one or more\r\nintermediate relay UAVs, this leads to a new problem: Where\r\nshould relays be placed for optimum performance? We present\r\ntwo new algorithms capable of generating such relay chains, one\r\nbeing a dual ascent algorithm and the other a modification of the\r\nBellman-Ford algorithm. As the priorities between the number\r\nof steps in the relay chain and the cost of the chain may vary, we\r\ncalculate chains of different lengths and costs and let the ground\r\noperator choose between them. Several different formulations\r\nfor edge costs are presented. In our test cases, both algorithms\r\nare substantially faster than an optimized version of the original\r\nBellman-Ford algorithm, which is used for comparison.",
        "bibtex": "@INPROCEEDINGS{ Burdakov-RSS-09,\r\n    AUTHOR    = {O. Burdakov AND P. Doherty AND K. Holmberg AND J. Kvarnstrom AND P.-R. Olsson},\r\n    TITLE     = {Positioning unmanned aerial vehicles as communication relays for surveillance tasks},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.033} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p33.pdf",
        "supp": "",
        "pdf_size": 234628,
        "gs_citation": 71,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16132539028568170225&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0b0ce9daa8",
        "title": "Robust visual homing with landmark angles",
        "site": "https://www.roboticsproceedings.org/rss05/p13.html",
        "author": "J. Lim and N. Barnes",
        "abstract": "This paper presents a novel approach to visual\r\nhoming for robot navigation on the ground plane, using only\r\nthe angles of landmark points. We focus on a robust approach,\r\nleading to successful homing even in real, dynamic environments\r\nwhere significant numbers of landmark points are wrong or\r\nmissing. Three homing algorithms are presented, two are shown\r\nto be provably convergent, and the other shown to converge\r\nempirically. Results from simulations under noise and robot\r\nhoming in real environments are provided.",
        "bibtex": "@INPROCEEDINGS{ Lim-RSS-09,\r\n    AUTHOR    = {J. Lim AND N. Barnes},\r\n    TITLE     = {Robust visual homing with landmark angles},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.013} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p13.pdf",
        "supp": "",
        "pdf_size": 766552,
        "gs_citation": 23,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10669255095301727293&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "1aeb427894",
        "title": "Robustness of the Unscented Kalman filter for state and parameter estimation in an elastic transmission",
        "site": "https://www.roboticsproceedings.org/rss05/p25.html",
        "author": "E. Naerum; H. Hawkeye King and B. Hannaford",
        "abstract": "The Unscented Kalman Filter (UKF) was applied\r\nto state and parameter estimation of a one degree of freedom\r\nrobot link with an elastic, cable-driven transmission. Only motor\r\nencoder and command torque data was used as input to the filter.\r\nThe UKF was used offline for joint state and model-parameter\r\nestimation, and online for state estimation. This paper presents\r\nan analysis of the robustness of the UKF to unknown/unmodeled\r\nvariation in inertia, cable tension and contact forces, using\r\nexperimental data collected with the robot.\r\nUsing model parameters found offline the UKF successfully\r\nestimated motor and link angles and velocities online. Although\r\nthe transmission was very stiff, and hence the motor and link\r\nstates almost equal, information about the individual states was\r\nobtained. Irrespective of variation from nominal conditions the\r\nUKF link angle estimate was better than using motor position\r\nas an approximation (i.e. inelastic transmission assumption). The\r\nangle estimates were particularly robust to variation in operating\r\nconditions, velocity estimates less so. A near-linear relationship\r\nbetween contact forces and estimation errors suggested that\r\ncontact forces might be estimated using this error information.",
        "bibtex": "@INPROCEEDINGS{ Naerum-RSS-09,\r\n    AUTHOR    = {E. Naerum AND H. Hawkeye King AND B. Hannaford},\r\n    TITLE     = {Robustness of the {U}nscented {K}alman filter for state and parameter estimation \r\nin an elastic transmission},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.025} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p25.pdf",
        "supp": "",
        "pdf_size": 228913,
        "gs_citation": 37,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17719252570315770084&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 4,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "21c765e1c4",
        "title": "Rut detection and following for autonomous ground vehicles",
        "site": "https://www.roboticsproceedings.org/rss05/p14.html",
        "author": "C. Ordonez; O. Y. Chuy Jr. and E. G. Collins Jr.",
        "abstract": "Expert off road drivers have found through experience\r\nthat ruts formed on soft terrains as a result of vehicular\r\ntransit can be used to improve vehicle safety and performance.\r\nRut following improves vehicle performance by reducing the\r\nenergy wasted on compacting the ground as the vehicle traverses\r\nover the terrain. Furthermore, proper rut following can improve\r\nvehicle safety on turns and slopes by utilizing the extra lateral\r\nforce provided by the ruts to reduce lateral slippage and guide\r\nthe vehicle through its path. This paper presents a set of\r\nfield experiments to show the relevance of rut following for\r\nautonomous ground vehicles and proposes a reactive based\r\napproach based on knowledge of the width of the tires and the\r\nvehicle body clearance to provide mobile robots with rut detection\r\nand following abilities. Experimental results on a Pioneer 3AT\r\nrobot show that the proposed system was able to detect and\r\nfollow S-shaped ruts, and ruts that are not directly in front or\r\nparallel to the robot.",
        "bibtex": "@INPROCEEDINGS{ Ordonez-RSS-09,\r\n    AUTHOR    = {C. Ordonez AND O. Y. Chuy Jr. AND E. G. Collins Jr.},\r\n    TITLE     = {Rut detection and following for autonomous ground vehicles},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.014} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p14.pdf",
        "supp": "",
        "pdf_size": 7319920,
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5410107966025520814&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "e025959eb9",
        "title": "Setpoint regulation for stochastically interacting robots",
        "site": "https://www.roboticsproceedings.org/rss05/p17.html",
        "author": "N. Napp; S. Burden and E. Klavins",
        "abstract": "We present an integral feedback controller that\r\nregulates the average copy number of a particular assembly in\r\na system of stochastically interacting robots. The mathematical\r\nmodel for the stochastic system is a tunable reaction network,\r\nwhich makes this approach applicable to a large class of other\r\nsystems, including ones that exhibit stochastic self assembly at\r\nvarious length scales. We prove that this controller works for a\r\nrange of set-points, and how to compute this range. Finally, we\r\ndemonstrate the approach on a physical testbed.",
        "bibtex": "@INPROCEEDINGS{ Napp-RSS-09,\r\n    AUTHOR    = {N. Napp AND S. Burden AND E. Klavins},\r\n    TITLE     = {Setpoint regulation for stochastically interacting robots},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.017} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p17.pdf",
        "supp": "",
        "pdf_size": 456232,
        "gs_citation": 48,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12728023068203299123&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 24,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "a177cd6dca",
        "title": "Tactile texture recognition with a 3-axial force MEMS integrated artificial finger",
        "site": "https://www.roboticsproceedings.org/rss05/p7.html",
        "author": "F. de Boissieu; C. Godin; B. Guilhamat; D. David; C. Serviere and D. Baudois",
        "abstract": "Recently, several three-axial MEMS-based force\r\nsensors have been developed. This kind of force micro sensor\r\nis also called tactile sensor in literature for its similarities in\r\nsize and sensitivity with human mechanoreceptors. Therefore,\r\nwe believe these three-axial force sensors being able to analyse\r\ntextures properties while sliding on a surface, as would do a\r\nperson with his finger. In this paper, we present one of these\r\nsensors packaged as an artificial finger, with a hard structure for\r\nthe bone and a soft rubber for the skin. Preliminary experiments\r\nshow a good sensitivity of the finger, as its ability to sense the\r\nperiodic structure of fabrics or to differentiate papers from\r\nfabrics calculating a friction coefficient. Its performance for\r\ndiscrimination of different surfaces is then estimated on fine\r\ntextures of 10 kinds of paper. Supervised classification methods\r\nare tested on the data. They lead to an automatic classifier of\r\nthe 10 papers showing good performances.",
        "bibtex": "@INPROCEEDINGS{ Boissieu-RSS-09,\r\n    AUTHOR    = {F. de Boissieu AND C. Godin AND B. Guilhamat AND D. David AND C. Serviere AND D. Baudois},\r\n    TITLE     = {Tactile texture recognition with a 3-axial force {MEMS} integrated artificial finger},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.007} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p7.pdf",
        "supp": "",
        "pdf_size": 2705220,
        "gs_citation": 97,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12733794255797990001&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": ";;;;",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "7b04244ac0",
        "title": "Time-extended multi-robot coordination for domains with intra-path constraints",
        "site": "https://www.roboticsproceedings.org/rss05/p35.html",
        "author": "E. G. Jones; M. B. Dias and A. Stentz",
        "abstract": "Many applications require teams of robots to cooperatively\r\nexecute complex tasks. Among these domains are\r\nthose where successful coordination solutions must respect constraints\r\nthat occur on the intra-path level. This work focuses on\r\nmulti-agent coordination for disaster response with intra-path\r\nconstraints, a compelling application that is not well addressed\r\nby current coordination methods. In this domain a group of\r\nfire trucks agents attempt to address a number of fires spread\r\nthroughout a city in the wake of a large-scale disaster. The\r\ndisaster has also caused many city roads to be blocked by\r\nimpassable debris, which can be cleared by bulldozer robots.\r\nA high-quality coordination solution must determine not only a\r\ntask allocation but also what routes the fire trucks should take\r\ngiven the intra-path precedence constraints and which bulldozers\r\nshould be assigned to clear debris along those routes.\r\nThis work presents two methods for generating time-extended\r\ncoordination solutions â\u0080\u0093 solutions where more than one task is\r\nassigned to each agent â\u0080\u0093 for domains with intra-path constraints.\r\nWhile a number of approaches have employed time-extended\r\ncoordination for domains with independent tasks, few approaches\r\nhave used time-extended coordination in domains where agentsâ\u0080\u0099\r\nschedules are interdependent at the path planning level. Our\r\nfirst approach uses tiered auctions and two heuristic techniques,\r\nclustering and opportunistic path planning, to perform a bounded\r\nsearch of possible time-extended schedules and allocations.\r\nOur second method uses a centralized, non-heuristic, genetic\r\nalgorithm-based approach that provides higher quality solutions\r\nbut at substantially greater computational cost. We compare our\r\ntime-extended approaches with a range of single task allocation\r\napproaches in a simulated disaster response domain.",
        "bibtex": "@INPROCEEDINGS{ Jones-RSS-09,\r\n    AUTHOR    = {E. G. Jones AND M. B. Dias AND A. Stentz},\r\n    TITLE     = {Time-extended multi-robot coordination for domains with intra-path constraints},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.035} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p35.pdf",
        "supp": "",
        "pdf_size": 170195,
        "gs_citation": 154,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16106475969172029527&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 19,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "cb0657086c",
        "title": "Towards cyclic fabrication systems for modular robotics and rapid manufacturing",
        "site": "https://www.roboticsproceedings.org/rss05/p16.html",
        "author": "M. Moses; H. Yamaguchi and G. S. Chirikjian",
        "abstract": "A cyclic fabrication system (CFS) is a network of\r\nmaterials, tools, and manufacturing processes that can produce\r\nall or most of its constituent components. This paper proposes\r\nan architecture for a robotic CFS based on modular components.\r\nThe proposed system is intended to self-replicate via producing\r\nnecessary components for replica devices. Some design challenges\r\nunique to self-replicating machines are discussed. Results from\r\nseveral proof-of-principle experiments are presented, including\r\na manipulator designed to handle and assemble modules of the\r\nsame type it is constructed from, a DC brush motor fabricated\r\nlargely from raw materials, and basic manufacturing tools made\r\nwith a simple CFS.",
        "bibtex": "@INPROCEEDINGS{ Moses-RSS-09,\r\n    AUTHOR    = {M. Moses AND H. Yamaguchi AND G. S. Chirikjian},\r\n    TITLE     = {Towards cyclic fabrication systems for modular robotics and rapid manufacturing},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.016} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p16.pdf",
        "supp": "",
        "pdf_size": 2251587,
        "gs_citation": 30,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6483771862804756356&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "eeb34eb056",
        "title": "Underwater human-robot interaction via biological motion identification",
        "site": "https://www.roboticsproceedings.org/rss05/p24.html",
        "author": "J. Sattar and G. Dudek",
        "abstract": "We present an algorithm for underwater robots to\r\nvisually detect and track human motion. Our objective is to\r\nenable human-robot interaction by allowing a robot to follow\r\nbehind a human moving in (up to) six degrees of freedom.\r\nIn particular, we have developed a system to allow a robot\r\nto detect, track and follow a scuba diver by using frequencydomain\r\ndetection of biological motion patterns. The motion of\r\nbiological entities is characterized by combinations of periodic\r\nmotions which are inherently distinctive. This is especially true\r\nof human swimmers. By using the frequency-space response of\r\nspatial signals over a number of video frames, we attempt to\r\nidentify signatures pertaining to biological motion. This technique\r\nis applied to track scuba divers in underwater domains, typically\r\nwith the robot swimming behind the diver. The algorithm is able\r\nto detect a range of motions, which include motion directly away\r\nfrom or towards the camera. The motion of the diver relative\r\nto the vehicle is then tracked using an Unscented Kalman Filter\r\n(UKF), an approach for non-linear estimation. The efficiency of\r\nour approach makes it attractive for real-time application onboard\r\nour underwater vehicle, and in future applications we\r\nintend to track scuba divers real-time with the robot. The paper\r\npresents an algorithmic overview of our approach, together with\r\nexperimental evaluation based on underwater video footage.",
        "bibtex": "@INPROCEEDINGS{ Sattar-RSS-09,\r\n    AUTHOR    = {J. Sattar AND G. Dudek},\r\n    TITLE     = {Underwater human-robot interaction via biological motion identification},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.024} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p24.pdf",
        "supp": "",
        "pdf_size": 1863444,
        "gs_citation": 46,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17121987072489413100&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "ba10237f76",
        "title": "Unsupervised discovery of object classes from range data using latent Dirichlet allocation",
        "site": "https://www.roboticsproceedings.org/rss05/p15.html",
        "author": "F. Endres; C. Plagemann; C. Stachniss and W. Burgard",
        "abstract": "Truly versatile robots operating in the real world\r\nhave to be able to learn about objects and their properties\r\nautonomously, that is, without being provided with carefully\r\nengineered training data. This paper presents an approach that\r\nallows a robot to discover object classes in three-dimensional\r\nrange data in an unsupervised fashion and without a-priori\r\nknowledge about the observed objects. Our approach builds on\r\nLatent Dirichlet Allocation (LDA), a recently proposed probabilistic\r\nmethod for discovering topics in text documents. We\r\ndiscuss feature extraction, hypothesis generation, and statistical\r\nmodeling of objects in 3D range data as well as the novel\r\napplication of LDA to this domain. Our approach has been\r\nimplemented and evaluated on real data of complex objects.\r\nPractical experiments demonstrate, that our approach is able\r\nto learn object class models autonomously that are consistent\r\nwith the true classifications provided by a human. It furthermore\r\noutperforms unsupervised method such as hierarchical clustering\r\nthat operate on a distance metric.",
        "bibtex": "@INPROCEEDINGS{ Endres-RSS-09,\r\n    AUTHOR    = {F. Endres AND C. Plagemann AND C. Stachniss AND W. Burgard},\r\n    TITLE     = {Unsupervised discovery of object classes from range data using latent Dirichlet allocation},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.015} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p15.pdf",
        "supp": "",
        "pdf_size": 1134815,
        "gs_citation": 90,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2085402536133803643&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 23,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "10b3b2a7e0",
        "title": "Using the distribution theory to simultaneously calibrate the sensors of a mobile robot",
        "site": "https://www.roboticsproceedings.org/rss05/p11.html",
        "author": "A. Martinelli",
        "abstract": "This paper introduces a simple and very efficient\r\nstrategy to extrinsically calibrate a bearing sensor (e.g. a camera)\r\nmounted on a mobile robot and simultaneously estimate the\r\nparameters describing the systematic error of the robot odometry\r\nsystem. The paper provides two contributions. The first one is\r\nthe analytical computation to derive the part of the system which\r\nis observable when the robot accomplishes circular trejectories.\r\nThis computation consists in performing a local decomposition of\r\nthe system, based on the theory of distributions. In this respect,\r\nthis paper represents the first application of the distribution\r\ntheory in the frame-work of mobile robotics. Then, starting from\r\nthis decomposition, a method to efficiently estimate the parameters\r\ndescribing both the extrinsic bearing sensor calibration\r\nand the odometry calibration is derived (second contribution).\r\nSimulations and experiments with the robot e-Puck equipped\r\nwith encoder sensors and a camera validate the approach.",
        "bibtex": "@INPROCEEDINGS{ Martinelli-RSS-09,\r\n    AUTHOR    = {A. Martinelli},\r\n    TITLE     = {Using the distribution theory to simultaneously calibrate the sensors of a mobile robot},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.011} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p11.pdf",
        "supp": "",
        "pdf_size": 670480,
        "gs_citation": 4,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6791642481207057205&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 15,
        "aff": "INRIA Rhone Alpes, Grenoble, FRANCE",
        "aff_domain": "ieee.org",
        "email": "ieee.org",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "INRIA Rhone Alpes, Grenoble, FRANCE",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": ""
    },
    {
        "id": "fedf3ffb82",
        "title": "View-based maps",
        "site": "https://www.roboticsproceedings.org/rss05/p20.html",
        "author": "K. Konolige; J. Bowman; J. D. Chen; P. Mihelich; M. Calonder; V. Lepetit and P. Fua",
        "abstract": "Robotic systems that can create and use visual maps\r\nin realtime have obvious advantages in many applications, from\r\nautomatic driving to mobile manipulation in the home. In this\r\npaper we describe a mapping system based on retaining stereo\r\nviews of the environment that are collected as the robot moves.\r\nConnections among the views are formed by consistent geometric\r\nmatching of their features. Out-of-sequence matching is the key\r\nproblem: how to find connections from the current view to other\r\ncorresponding views in the map. Our approach uses a vocabulary\r\ntree to propose candidate views, and a strong geometric filter\r\nto eliminate false positives â\u0080\u0093 essentially, the robot continually\r\nre-recognizes where it is. We present experiments showing the\r\nutility of the approach on video data, including map building in\r\nlarge indoor and outdoor environments, map building without\r\nlocalization, and re-localization when lost.",
        "bibtex": "@INPROCEEDINGS{ Konolige-RSS-09,\r\n    AUTHOR    = {K. Konolige AND J. Bowman AND J. D. Chen AND P. Mihelich AND M. Calonder AND V. Lepetit AND P. Fua},\r\n    TITLE     = {View-based maps},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2009},\r\n    ADDRESS   = {Seattle, USA},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2009.V.020} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss05/p20.pdf",
        "supp": "",
        "pdf_size": 3760687,
        "gs_citation": 360,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=236817688544252102&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 23,
        "aff": ";;;;;",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster"
    }
]