[
    {
        "id": "74a6d6c802",
        "title": "A New Perspective and Extension of the Gaussian Filter",
        "site": "https://www.roboticsproceedings.org/rss11/p16.html",
        "author": "Manuel Wuthrich; Sebastian Trimpe; Daniel Kappler; Stefan Schaal",
        "abstract": "The Gaussian Filter (GF) is one of the most widely used filtering algorithms; instances are the Extended Kalman Filter, the Unscented Kalman Filter and the Divided Difference Filter. GFs represent the belief of the current state by a Gaussian with the mean being an affine function of the measurement. We show that this representation can be too restrictive to accurately capture the dependences in systems with nonlinear observation models, and we investigate how the GF can be generalized to alleviate this problem. To this end, we view the GF from a variational-inference perspective. We analyse how restrictions on the form of the belief can be relaxed while maintaining simplicity and efficiency. This analysis provides a basis for generalizations of the GF. We propose one such generalization which coincides with a GF using a virtual measurement, obtained by applying a nonlinear function to the actual measurement. Numerical experiments show that the proposed Feature Gaussian Filter (FGF) can have a substantial performance advantage over the standard GF for systems with nonlinear observation models.",
        "bibtex": "@INPROCEEDINGS{Wuthrich-RSS-15, \r\n    AUTHOR    = {Manuel Wuthrich AND Sebastian Trimpe AND Daniel Kappler AND Stefan Schaal}, \r\n    TITLE     = {A New Perspective and Extension of the Gaussian Filter}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.016} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p16.pdf",
        "supp": "",
        "pdf_size": 1260962,
        "gs_citation": 32,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17137931134324711185&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tubingen, Germany; Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tubingen, Germany; Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tubingen, Germany; Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tubingen, Germany + Computational Learning and Motor Control lab, University of Southern California, Los Angeles, CA, USA",
        "aff_domain": "tuebingen.mpg.de;tuebingen.mpg.de;tuebingen.mpg.de;tuebingen.mpg.de",
        "email": "tuebingen.mpg.de;tuebingen.mpg.de;tuebingen.mpg.de;tuebingen.mpg.de",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0+1",
        "aff_unique_norm": "Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tubingen, Germany;University of Southern California",
        "aff_unique_dep": ";Computational Learning and Motor Control lab",
        "aff_unique_url": ";https://www.usc.edu",
        "aff_unique_abbr": ";USC",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Los Angeles",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "cd9d181ad3",
        "title": "A Spatiotemporal Optimal Stopping Problem for Mission Monitoring with Stationary Viewpoints",
        "site": "https://www.roboticsproceedings.org/rss11/p38.html",
        "author": "Graeme Best; Wolfram Martens; Robert Fitch",
        "abstract": "We consider an optimal stopping formulation of the mission monitoring problem, where a monitor vehicle must remain in close proximity to an autonomous robot that stochastically follows a pre-planned trajectory. This problem arises when autonomous underwater vehicles are monitored by surface vessels, and in a diverse range of other scenarios. The key problem characteristics we consider are that the monitor must remain stationary while observing the robot, and that the robot motion is modelled in general as a stochastic process. We propose a resolution-complete algorithm for this problem that runs in polynomial time. The algorithm is based on a sweep-plane approach and generates a motion plan that maximises the expected observation time. A variety of stochastic models may be used to represent the expected robot trajectory. We present results drawn from real AUV trajectories and Monte Carlo simulations that validate the correctness of our algorithm and its feasibility in practice.",
        "bibtex": "@INPROCEEDINGS{Best-RSS-15, \r\n    AUTHOR    = {Graeme Best AND Wolfram Martens AND Robert Fitch}, \r\n    TITLE     = {A Spatiotemporal Optimal Stopping Problem for Mission Monitoring with Stationary Viewpoints}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.038} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p38.pdf",
        "supp": "",
        "pdf_size": 1333594,
        "gs_citation": 12,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5356143943539290583&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "Australian Centre for Field Robotics (ACFR); Australian Centre for Field Robotics (ACFR); Australian Centre for Field Robotics (ACFR)",
        "aff_domain": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au",
        "email": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Australian Centre for Field Robotics (ACFR)",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "b199143555",
        "title": "A Square Root Inverse Filter for Efficient Vision-aided Inertial Navigation on Mobile Devices",
        "site": "https://www.roboticsproceedings.org/rss11/p08.html",
        "author": "Kejian Wu; Ahmed Ahmed; Georgios Georgiou; Stergios Roumeliotis",
        "abstract": "In this paper, we present a square-root inverse sliding window filter (SR-ISWF) for vision-aided inertial navigation systems (VINS). While regular inverse filters suffer from numerical issues, employing their square-root equivalent enables the usage of single-precision number representations, thus achieving considerable speed ups as compared to double-precision alternatives on resource-constrained mobile platforms. Besides a detailed description of the SR-ISWF for VINS, which focuses on the numerical procedures that enable exploiting the problem's structure for gaining in efficiency, this paper presents a thorough validation of the algorithm's processing requirements and achieved accuracy. In particular, experiments are conducted using a commercial-grade cell phone, where the proposed algorithm is shown to achieve the same level of estimation accuracy, when compared to state-of-the-art VINS algorithms, with significantly higher speed.",
        "bibtex": "@INPROCEEDINGS{Wu-RSS-15, \r\n    AUTHOR    = {Kejian Wu AND Ahmed Ahmed AND Georgios Georgiou AND Stergios Roumeliotis}, \r\n    TITLE     = {A Square Root Inverse Filter for Efficient Vision-aided Inertial Navigation on Mobile Devices}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.008} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p08.pdf",
        "supp": "",
        "pdf_size": 1006833,
        "gs_citation": 156,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10525235045879871330&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Department of Electrical and Computer Engineering; Department of Computer Science and Engineering; Department of Computer Science and Engineering; Department of Computer Science and Engineering",
        "aff_domain": "cs.umn.edu;cs.umn.edu;cs.umn.edu;cs.umn.edu",
        "email": "cs.umn.edu;cs.umn.edu;cs.umn.edu;cs.umn.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;1",
        "aff_unique_norm": "Unknown Institution;University of California, San Diego",
        "aff_unique_dep": "Department of Electrical and Computer Engineering;Department of Computer Science and Engineering",
        "aff_unique_url": ";https://cse.ucsd.edu",
        "aff_unique_abbr": ";UCSD CSE",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;1;1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "832e0ce728",
        "title": "Adaptive Coordination Strategies for Human-Robot Handovers",
        "site": "https://www.roboticsproceedings.org/rss11/p31.html",
        "author": "Chien-Ming Huang; Maya Cakmak; Bilge Mutlu",
        "abstract": "Handovers of objects are critical interactions that frequently arise in physical collaborations. In such interactions, humans naturally monitor the pace and workload of their partners and adapt their handovers accordingly. In this paper, we investigate how robots designed to engage in physical collaborations may achieve similar adaptivity in performing handovers. To that end, we collected and analyzed data from human dyads performing a common household task unloading a dish rack where receivers had different levels of task demands. We identified two coordination strategies that enabled givers to adapt to receivers task demands. We then formulated and implemented these strategies on a robotic manipulator. The implemented autonomous system was evaluated in a human-robot interaction study against two baselines that use proactive and reactive coordination methods. The results show a tradeoff between team performance and user experience when human receivers had greater task demands. In particular, the proactive method provided the greatest levels of team performance but offered the poorest user experience compared to the reactive and adaptive methods. The reactive method, while improving user experience over the proactive method, resulted in the poorest team performance. Our adaptive method maintained this improved user experience while offering an improved team performance compared to the reactive method. Our findings offer insights into the tradeoffs involved in the use of these methods and inform the future design of handover interactions for robots.",
        "bibtex": "@INPROCEEDINGS{Huang-RSS-15, \r\n    AUTHOR    = {Chien-Ming Huang AND Maya Cakmak AND Bilge Mutlu}, \r\n    TITLE     = {Adaptive Coordination Strategies for Human-Robot Handovers}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.031} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p31.pdf",
        "supp": "",
        "pdf_size": 6737538,
        "gs_citation": 186,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13365855491076998579&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "Department of Computer Sciences, University of Wisconsin–Madison; Department of Computer Science & Engineering, University of Washington; Department of Computer Sciences, University of Wisconsin–Madison",
        "aff_domain": "cs.wisc.edu;cs.washington.edu;cs.wisc.edu",
        "email": "cs.wisc.edu;cs.washington.edu;cs.wisc.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "University of Wisconsin–Madison;University of Washington",
        "aff_unique_dep": "Department of Computer Sciences;Department of Computer Science & Engineering",
        "aff_unique_url": "https://www.wisc.edu;https://www.washington.edu",
        "aff_unique_abbr": "UW–Madison;UW",
        "aff_campus_unique_index": "0;1;0",
        "aff_campus_unique": "Madison;Seattle",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "d1218d18a8",
        "title": "Addressing Constraint Robustness to Torque Errors in Task-Space Inverse Dynamics",
        "site": "https://www.roboticsproceedings.org/rss11/p27.html",
        "author": "Andrea Del Prete; Nicolas Mansard",
        "abstract": "Task-Space Inverse Dynamics (TSID) is a well-known optimization-based technique for the control of highly-redundant mechanical systems, such as humanoid robots. One of its main flaws is that it does not take into account any of the uncertainties affecting these systems: poor torque tracking, sensor noises, delays and model uncertainties. As a consequence, the resulting control trajectories may be feasible for the ideal system, but not for the real one. We propose to improve the robustness of TSID by modeling uncertainties in the joint torques as additive white random noise (similarly to LQG). This results in a stochastic optimization problem, in which we can maximize the probability to satisfy the inequality constraints (i.e. to be feasible). Since computing this probability is computationally expensive, we propose three ways to approximate it that are much faster to compute and that we can then use for online control (resolution time below 1 ms). Simulation results show that taking robustness into account greatly increases the chances to have feasible control trajectories (even when the uncertainties affecting the system are not the one modeled in the controller).",
        "bibtex": "@INPROCEEDINGS{Prete-RSS-15, \r\n    AUTHOR    = {Andrea Del Prete AND Nicolas Mansard}, \r\n    TITLE     = {Addressing Constraint Robustness to Torque Errors in Task-Space Inverse Dynamics}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.027} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p27.pdf",
        "supp": "",
        "pdf_size": 1619303,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=669173616490049030&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "CNRS, LAAS, 7 avenue du colonel Roche, Univ de Toulouse, LAAS, F-31400 Toulouse, France; CNRS, LAAS, 7 avenue du colonel Roche, Univ de Toulouse, LAAS, F-31400 Toulouse, France",
        "aff_domain": "laas.fr;laas.fr",
        "email": "laas.fr;laas.fr",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "CNRS, LAAS, 7 avenue du colonel Roche, Univ de Toulouse, LAAS, F-31400 Toulouse, France",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "9b86b3ca60",
        "title": "Autonomy Infused Teleoperation with Application to BCI Manipulation",
        "site": "https://www.roboticsproceedings.org/rss11/p39.html",
        "author": "Katharina Mulling; Arun Venkatraman; Jean-Sebastien Valois; John Downey; Jeffrey Weiss; Shervin Javdani; Martial Hebert; Andrew Schwartz; Jennifer Collinger; Andrew Bagnell",
        "abstract": "Robot teleoperation systems face a common set of challenges including latency, low-dimensional user commands, and asymmetric control inputs. User control with Brain-Computer Interfaces (BCIs) exacerbates these problems through especially noisy and erratic low-dimensional motion commands due to the difficulty in decoding neural activity. We introduce a general framework to address these challenges through a combination of computer vision, user intent inference, and arbitration between the human input and autonomous control schemes. Adjustable levels of assistance allow the system to balance the operator's capabilities and feelings of comfort and control while compensating for a task's difficulty. We present experimental results demonstrating significant performance improvement using the shared-control assistance framework on adapted rehabilitation benchmarks with two subjects implanted with intracortical brain-computer interfaces controlling a seven degree-of-freedom robotic manipulator as a prosthetic. Our results further indicate that shared assistance mitigates perceived user difficulty and even enables successful performance on previously infeasible tasks. We showcase the extensibility of our architecture with applications to quality-of-life tasks such as opening a door, pouring liquids from containers, and manipulation with novel objects in densely cluttered environments.",
        "bibtex": "@INPROCEEDINGS{Mulling-RSS-15, \r\n    AUTHOR    = {Katharina Mulling AND Arun Venkatraman AND Jean-Sebastien Valois AND John Downey AND Jeffrey Weiss AND Shervin Javdani AND Martial Hebert AND Andrew Schwartz AND Jennifer Collinger AND Andrew Bagnell}, \r\n    TITLE     = {Autonomy Infused Teleoperation with Application to BCI Manipulation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.039} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p39.pdf",
        "supp": "",
        "pdf_size": 3720908,
        "gs_citation": 81,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15167242600192086911&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 14,
        "aff": ";;;;;;;;;",
        "aff_domain": ";;;;;;;;;",
        "email": ";;;;;;;;;",
        "github": "",
        "project": "",
        "author_num": 10,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0847a18d30",
        "title": "Chisel: Real Time Large Scale 3D Reconstruction Onboard a Mobile Device using Spatially Hashed Signed Distance Fields",
        "site": "https://www.roboticsproceedings.org/rss11/p40.html",
        "author": "Matthew Klingensmith; Ivan Dryanovski; Siddhartha Srinivasa; Jizhong Xiao",
        "abstract": "We describe Chisel : a system for real-time house-scale (300 square meter or more) dense 3D reconstruction onboard a Google Tango mobile device by using a dynamic spatially-hashed truncated signed distance field for mapping, and visual-inertial odometry for localization. By aggressively culling parts of the scene that do not contain surfaces, we avoid needless computation and wasted memory. Even under very noisy conditions, we produce high-quality reconstructions through the use of space carving. We are able to reconstruct and render very large scenes at a resolution of 2-3 cm in real time on a mobile device without the use of GPU computing. The user is able to view and interact with the reconstruction in real-time through an intuitive interface. We provide both qualitative and quantitative results on publicly available RGB-D datasets, and on datasets collected in real-time from two devices.",
        "bibtex": "@INPROCEEDINGS{Klingensmith-RSS-15, \r\n    AUTHOR    = {Matthew Klingensmith AND Ivan Dryanovski AND Siddhartha Srinivasa AND Jizhong Xiao}, \r\n    TITLE     = {Chisel: Real Time Large Scale 3D Reconstruction Onboard a Mobile Device using Spatially Hashed Signed Distance Fields}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.040} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p40.pdf",
        "supp": "",
        "pdf_size": 9862448,
        "gs_citation": 232,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1257579078769321062&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "aff": "Carnegie Mellon Robotics Institute; The Graduate Center, City University of New York; Carnegie Mellon Robotics Institute; The City College of New York",
        "aff_domain": "andrew.cmu.edu;gc.cuny.edu;cs.cmu.edu;ccny.cuny.edu",
        "email": "andrew.cmu.edu;gc.cuny.edu;cs.cmu.edu;ccny.cuny.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;2",
        "aff_unique_norm": "Carnegie Mellon University;City University of New York;City College of New York",
        "aff_unique_dep": "Robotics Institute;The Graduate Center;",
        "aff_unique_url": "https://www.cmu.edu;https://www.gc.cuny.edu;https://www.ccny.cuny.edu",
        "aff_unique_abbr": "CMU;CUNY;CCNY",
        "aff_campus_unique_index": "1;1",
        "aff_campus_unique": ";New York",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "d410e0c74e",
        "title": "Continuous-Time Trajectory Estimation for Event-based Vision Sensors",
        "site": "https://www.roboticsproceedings.org/rss11/p36.html",
        "author": "Elias Mueggler; Guillermo Gallego; Davide Scaramuzza",
        "abstract": "Event-based vision sensors, such as the Dynamic Vision Sensor (DVS), do not output a sequence of video frames like standard cameras, but a stream of asynchronous events. An event is triggered when a pixel detects a change of brightness in the scene. An event contains the location, sign, and precise timestamp of the change. The high dynamic range and temporal resolution of the DVS, which is in the order of micro-seconds, make this a very promising sensor for high-speed applications, such as robotics and wearable computing. However, due to the fundamentally different structure of the sensor's output, new algorithms that exploit the high temporal resolution and the asynchronous nature of the sensor are required. In this paper, we address ego-motion estimation for an event-based vision sensor using a continuous-time framework to directly integrate the information conveyed by the sensor. The DVS pose trajectory is approximated by a smooth curve in the space of rigid-body motions using cubic splines and it is optimized according to the observed events. We evaluate our method using datasets acquired from sensor-in-the-loop simulations and onboard a quadrotor performing flips. The results are compared to the ground truth, showing the good performance of the proposed technique.",
        "bibtex": "@INPROCEEDINGS{Mueggler-RSS-15, \r\n    AUTHOR    = {Elias Mueggler AND Guillermo Gallego AND Davide Scaramuzza}, \r\n    TITLE     = {Continuous-Time Trajectory Estimation for Event-based Vision Sensors}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.036} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p36.pdf",
        "supp": "",
        "pdf_size": 1850166,
        "gs_citation": 78,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17807772967422631301&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 19,
        "aff": "Robotics and Perception Group, University of Zurich; Robotics and Perception Group, University of Zurich; Robotics and Perception Group, University of Zurich",
        "aff_domain": "ifi.uzh.ch;ifi.uzh.ch;ifi.uzh.ch",
        "email": "ifi.uzh.ch;ifi.uzh.ch;ifi.uzh.ch",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Zurich",
        "aff_unique_dep": "Robotics and Perception Group",
        "aff_unique_url": "https://www.unizh.ch",
        "aff_unique_abbr": "UZH",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Switzerland"
    },
    {
        "id": "3d96821d2f",
        "title": "Data-Driven Online Decision Making for Autonomous Manipulation",
        "site": "https://www.roboticsproceedings.org/rss11/p44.html",
        "author": "Daniel Kappler; Peter Pastor; Mrinal Kalakrishnan; Manuel Wuthrich; Stefan Schaal",
        "abstract": "One of the main challenges in autonomous manipulation is to generate appropriate multi-modal reference trajectories that enable feedback controllers to compute control commands that compensate for unmodeled perturbations and therefore to achieve the task at hand. We propose a data-driven approach to incrementally acquire reference signals from experience and decide online when and to which successive behavior to switch, ensuring successful task execution. We reformulate this online decision making problem as a pair of related classification problems. Both process the current sensor state, composed from multiple sensor modalities, in real-time (at 30 Hz). Our approach exploits that movement generation can dictate sensor feedback. Thus, enforcing stereotypical behavior will yield stereotypical sensory events which can be accumulated and stored along with the movement plan. Such movement primitives, augmented with sensor experience, are called Associative Skill Memories (ASMs). Sensor experience consists of (real) sensors, including haptic, auditory information and visual information, as well as additional (virtual) features. We show that our approach can be used to teach dexterous tasks, e.g. a bimanual manipulation task on a real platform that requires precise manipulation of relatively small objects. Task execution is robust against perturbation and sensor noise, because our method decides online whether or not to switch to alternative ASMs due to unexpected sensory signals.",
        "bibtex": "@INPROCEEDINGS{Kappler-RSS-15, \r\n    AUTHOR    = {Daniel Kappler AND Peter Pastor AND Mrinal Kalakrishnan AND Manuel Wuthrich AND Stefan Schaal}, \r\n    TITLE     = {Data-Driven Online Decision Making for Autonomous Manipulation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.044} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p44.pdf",
        "supp": "",
        "pdf_size": 2299415,
        "gs_citation": 79,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14163100832110903886&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tübingen, Germany+Computational Learning and Motor Control Lab, University of Southern California, Los Angeles, USA; Computational Learning and Motor Control Lab, University of Southern California, Los Angeles, USA; Computational Learning and Motor Control Lab, University of Southern California, Los Angeles, USA; Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tübingen, Germany+Computational Learning and Motor Control Lab, University of Southern California, Los Angeles, USA; Autonomous Motion Department, Max Planck Institute for Intelligent Systems, Tübingen, Germany+Computational Learning and Motor Control Lab, University of Southern California, Los Angeles, USA",
        "aff_domain": "tuebingen.mpg.de;usc.edu;usc.edu;tuebingen.mpg.de;usc.edu",
        "email": "tuebingen.mpg.de;usc.edu;usc.edu;tuebingen.mpg.de;usc.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;1;1;0+1;0+1",
        "aff_unique_norm": "Max Planck Institute for Intelligent Systems;Computational Learning and Motor Control Lab, University of Southern California, Los Angeles, USA",
        "aff_unique_dep": "Autonomous Motion Department;",
        "aff_unique_url": "https://www.mpi-is.mpg.de;",
        "aff_unique_abbr": "MPI-IS;",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Tübingen;",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Germany;"
    },
    {
        "id": "546d6d8598",
        "title": "Data-Driven Topological Motion Planning with Persistent Cohomology",
        "site": "https://www.roboticsproceedings.org/rss11/p49.html",
        "author": "Florian T. Pokorny; Danica Kragic",
        "abstract": "In this work, we present an approach to topological motion planning which is fully data-driven in nature and which relies solely on the knowledge of samples in the free configuration space. For this purpose, we discuss the use of persistent cohomology with coefficients in a finite field to compute a basis which allows us to efficiently solve the path planning problem. The proposed approach can be used both in the case where a part of a configuration space is well-approximated by samples and, more generally, with arbitrary filtrations arising from real-world data sets. Furthermore, our approach can generate motions in a subset of the configuration space specified by the sub- or superlevel set of a filtration function such as a cost function or probability distribution. Our experiments show that our approach is highly scalable in low dimensions and we present results on simulated PR2 arm motions as well as GPS trace and motion capture data.",
        "bibtex": "@INPROCEEDINGS{Pokorny-RSS-15, \r\n    AUTHOR    = {Florian T. Pokorny AND Danica Kragic}, \r\n    TITLE     = {Data-Driven Topological Motion Planning with Persistent Cohomology}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.049} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p49.pdf",
        "supp": "",
        "pdf_size": 6554232,
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11892149648649842268&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Centre for Autonomous Systems, KTH Royal Institute of Technology; Centre for Autonomous Systems, KTH Royal Institute of Technology",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Centre for Autonomous Systems, KTH Royal Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "5564783aed",
        "title": "Dealing with Difficult Instances of Object Rearrangement",
        "site": "https://www.roboticsproceedings.org/rss11/p45.html",
        "author": "Athanasios Krontiris; Kostas Bekris",
        "abstract": "Rearranging multiple objects is a critical skill for robots so that they can effectively deal with clutter in human spaces. This is a challenging problem as it involves combinatorially large, continuous C-spaces involving multiple movable bodies and complex kinematic constraints. This work initially revisits an existing search-based approach, which solves monotone challenges, i.e., when objects need to be grasped only once so as to be rearranged. The first contribution is the extension of this technique to a method that addresses many non-monotone challenges. The second contribution is the use of either the monotone or of the new non-monotone method as a local planner in the context of a higher-level task planner that searches the space of object placements and which provides stronger guarantees. The paper aims to emphasize the benefit of using more powerful motion primitives in the context of task planning for object rearrangement than an individual pick-and-place. Experiments in simulation using a model of a Baxter robot arm show the capability of solving difficult instances of rearrangement problems and evaluate the methods in terms of success ratio, running time, scalability and path quality.",
        "bibtex": "@INPROCEEDINGS{Krontiris-RSS-15, \r\n    AUTHOR    = {Athanasios Krontiris AND Kostas Bekris}, \r\n    TITLE     = {Dealing with Difficult Instances of Object Rearrangement}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.045} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p45.pdf",
        "supp": "",
        "pdf_size": 8510583,
        "gs_citation": 161,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16558402239120716879&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Department of Computer Science, Rutgers-the State University of New Jersey, Piscataway, NJ, USA; Department of Computer Science, Rutgers-the State University of New Jersey, Piscataway, NJ, USA",
        "aff_domain": "rutgers.edu;cs.rutgers.edu",
        "email": "rutgers.edu;cs.rutgers.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Department of Computer Science, Rutgers-the State University of New Jersey, Piscataway, NJ, USA",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "309dcfcb7e",
        "title": "Decoupled Representation of the Error and Trajectory Estimates for Ef_cient Pose Estimation",
        "site": "https://www.roboticsproceedings.org/rss11/p09.html",
        "author": "Xing Zheng; Mingyang Li; Anastasios Mourikis",
        "abstract": "In this paper we present a novel approach for the parameterization of the trajectory of a moving platform, which facilitates the development of real-time pose-estimation methods. The key idea of the proposed approach is the decoupling of the parameterization of the trajectory estimate from the parameterization of the error in this estimate. Specifically, we represent the trajectory estimate as usual, via a set of pose states, each associated with a sensor reading (e.g., a laser scan or an image). The novelty of our approach lies in the representation of the estimation errors, for which we employ B-splines. This decoupled formulation, which we term Decoupled Estimate-Error Parameterization (DEEP) offers two key advantages. First, the use of a pose-based representation of the trajectory allows us to represent arbitrarily complex trajectories. Second, the use of B-splines for error representation allows us to control the computational complexity of an estimator, by selecting the density of the knots of the B-spline. We empirically demonstrate that, in the problem of visual-inertial localization, the DEEP formulation leads to substantial computational gains, while incurring only a small loss of estimation performance.",
        "bibtex": "@INPROCEEDINGS{Zheng-RSS-15, \r\n    AUTHOR    = {Xing Zheng AND Mingyang Li AND Anastasios Mourikis}, \r\n    TITLE     = {Decoupled Representation of the Error and Trajectory Estimates for Ef_cient Pose Estimation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.009} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p09.pdf",
        "supp": "",
        "pdf_size": 1986238,
        "gs_citation": 5,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1339619284026319353&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "Dept. of Electrical and Computer Engineering, University of California, Riverside; Dept. of Electrical and Computer Engineering, University of California, Riverside; Dept. of Electrical and Computer Engineering, University of California, Riverside",
        "aff_domain": "ece.ucr.edu;ece.ucr.edu;ece.ucr.edu",
        "email": "ece.ucr.edu;ece.ucr.edu;ece.ucr.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of California, Riverside",
        "aff_unique_dep": "Dept. of Electrical and Computer Engineering",
        "aff_unique_url": "https://www.ucr.edu",
        "aff_unique_abbr": "UCR",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Riverside",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "5e61233836",
        "title": "DeepMPC: Learning Deep Latent Features for Model Predictive Control",
        "site": "https://www.roboticsproceedings.org/rss11/p12.html",
        "author": "Ian Lenz; Ross Knepper; Ashutosh Saxena",
        "abstract": "Designing robotic controllers for tasks with complex non-linear dynamics is extremely challenging, time-consuming, and in many cases, infeasible. This difficulty is exacerbated in tasks such as robotic food-cutting, in which dynamics might vary both with environmental properties, such as material and tool class, and with time while acting. In this work, we present DeepMPC, an online real-time model-predictive control approach designed to handle such difficult tasks. Rather than hand-design a dynamics model for the task, our approach uses a novel deep architecture and learning algorithm, learning controllers for complex tasks directly from data. We validate our method in experiments on a large-scale dataset of 1488 material cuts for 20 diverse classes, and in 450 real-world robotic experiments, demonstrating significant improvement over several other approaches.",
        "bibtex": "@INPROCEEDINGS{Lenz-RSS-15, \r\n    AUTHOR    = {Ian Lenz AND Ross Knepper AND Ashutosh Saxena}, \r\n    TITLE     = {DeepMPC: Learning Deep Latent Features for Model Predictive Control}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.012} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p12.pdf",
        "supp": "",
        "pdf_size": 818173,
        "gs_citation": 459,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13089568786398225462&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "Department of Computer Science, Cornell University; Department of Computer Science, Cornell University; Department of Computer Science, Cornell University",
        "aff_domain": "cs.cornell.edu;cs.cornell.edu;cs.cornell.edu",
        "email": "cs.cornell.edu;cs.cornell.edu;cs.cornell.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Cornell University",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.cornell.edu",
        "aff_unique_abbr": "Cornell",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "0b45249b33",
        "title": "Direct Loss Minimization Inverse Optimal Control",
        "site": "https://www.roboticsproceedings.org/rss11/p13.html",
        "author": "Andreas Doerr; Nathan Ratliff; Jeannette Bohg; Marc Toussaint; Stefan Schaal",
        "abstract": "Inverse Optimal Control (IOC) has strongly impacted the systems engineering process, enabling automated planner tuning through straightforward and intuitive demonstration. The most successful and established applications, though, have been in lower dimensional problems such as navigation planning where exact optimal planning or control is feasible. In higher dimensional systems, such as humanoid robots, research has made substantial progress toward generalizing the ideas to model free or locally optimal settings, but these systems are complicated to the point where demonstration itself can be difficult. Typically, real-world applications are restricted to at best noisy or even partial or incomplete demonstrations that prove cumbersome in existing frameworks. This work derives a very flexible method of IOC based on a form of Structured Prediction known as Direct Loss Minimization. The resulting algorithm is essentially Policy Search on a reward function that rewards similarity to demonstrated behavior (using Covariance Matrix Adaptation (CMA) in our experiments). Our framework blurs the distinction between IOC, other forms of Imitation Learning, and Reinforcement Learning, enabling us to derive simple, versatile, and practical algorithms that blend imitation and reinforcement signals into a unified framework. Our experiments analyze various aspects of its performance and demonstrate its efficacy on conveying preferences for motion shaping and combined reach and grasp quality optimization.",
        "bibtex": "@INPROCEEDINGS{Doerr-RSS-15, \r\n    AUTHOR    = {Andreas Doerr AND Nathan Ratliff AND Jeannette Bohg AND Marc Toussaint AND Stefan Schaal}, \r\n    TITLE     = {Direct Loss Minimization Inverse Optimal Control}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.013} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p13.pdf",
        "supp": "",
        "pdf_size": 5019566,
        "gs_citation": 57,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9430667258008689150&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 6,
        "aff": ";;;;",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "83147fd4e4",
        "title": "Efficient High-Dimensional Stochastic Optimal Motion Control using Tensor-Train Decomposition",
        "site": "https://www.roboticsproceedings.org/rss11/p15.html",
        "author": "Alex Gorodetsky; Sertac Karaman; Youssef Marzouk",
        "abstract": "Stochastic optimal control problems frequently arise as motion control problems in the context of robotics. Unfortunately, all existing approaches that guarantee arbitrary precision suffer from the curse of dimensionality: the computational effort invested by the algorithm grows exponentially fast with increasing dimensionality of the state space of the underlying dynamic system governing the robot. In this paper, we propose a novel algorithm that utilizes compressed representations to efficiently solve stochastic optimal control problems with arbitrary precision. The running time of the new algorithms scale linearly with increasing dimensionality of the state space! The running time also depends polynomially on the rank of the value function, a measure that quantifies the intrinsic geometric complexity of the value function, due to the geometry and physics embedded in the problem instance at hand. The new algorithms are based on the recent analysis and algorithms for tensor decomposition, generalizing matrix decomposition algorithms, e.g., the singular value decomposition, to three or more dimensions. In computational experiments, we show the computational effort of the new algorithm also scales linearly with the discretization resolution of the state space. We also demonstrate the new algorithm on a problem involving the perching of an aircraft, represented by a nonlinear non-holonomic longitudinal model with a seven-dimensional state space, the full numerical solution to which was not obtained before. In this example, we estimate that the proposed algorithm runs more than seven orders of magnitude faster, when compared to the naive value iteration.",
        "bibtex": "@INPROCEEDINGS{Gorodetsky-RSS-15, \r\n    AUTHOR    = {Alex Gorodetsky AND Sertac Karaman AND Youssef Marzouk}, \r\n    TITLE     = {Efficient High-Dimensional Stochastic Optimal Motion Control using Tensor-Train Decomposition}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.015} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p15.pdf",
        "supp": "",
        "pdf_size": 546880,
        "gs_citation": 50,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=719962088168790908&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "Massachusetts Institute of Technology; Massachusetts Institute of Technology; Massachusetts Institute of Technology",
        "aff_domain": "mit.edu;mit.edu;mit.edu",
        "email": "mit.edu;mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "https://web.mit.edu",
        "aff_unique_abbr": "MIT",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "e75626a62c",
        "title": "ElasticFusion: Dense SLAM Without A Pose Graph",
        "site": "https://www.roboticsproceedings.org/rss11/p01.html",
        "author": "Thomas Whelan; Stefan Leutenegger; Renato Salas Moreno; Ben Glocker; Andrew Davison",
        "abstract": "We present a novel approach to real-time dense visual SLAM. Our system is capable of capturing comprehensive dense globally consistent surfel-based maps of room scale environments explored using an RGB-D camera in an incremental online fashion, without pose graph optimisation or any post-processing steps. This is accomplished by using dense frame-to-model camera tracking and windowed surfel-based fusion coupled with frequent model refinement through non-rigid surface deformations. Our approach applies local model-to-model surface loop closure optimisations as often as possible to stay close to the mode of the map distribution, while utilising global loop closure to recover from arbitrary drift and maintain global consistency.",
        "bibtex": "@INPROCEEDINGS{Whelan-RSS-15, \r\n    AUTHOR    = {Thomas Whelan AND Stefan Leutenegger AND Renato Salas Moreno AND Ben Glocker AND Andrew Davison}, \r\n    TITLE     = {ElasticFusion: Dense SLAM Without A Pose Graph}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.001} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p01.pdf",
        "supp": "",
        "pdf_size": 3798823,
        "gs_citation": 1054,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4206095699637453686&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Dyson Robotics Laboratory at Imperial College, Department of Computing, Imperial College London, UK; Dyson Robotics Laboratory at Imperial College, Department of Computing, Imperial College London, UK; Department of Computing, Imperial College London, UK; Department of Computing, Imperial College London, UK; Dyson Robotics Laboratory at Imperial College, Department of Computing, Imperial College London, UK",
        "aff_domain": "imperial.ac.uk;imperial.ac.uk;imperial.ac.uk;imperial.ac.uk;imperial.ac.uk",
        "email": "imperial.ac.uk;imperial.ac.uk;imperial.ac.uk;imperial.ac.uk;imperial.ac.uk",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;1;0",
        "aff_unique_norm": "Dyson Robotics Laboratory at Imperial College, Department of Computing, Imperial College London, UK;Imperial College London",
        "aff_unique_dep": ";Department of Computing",
        "aff_unique_url": ";https://www.imperial.ac.uk",
        "aff_unique_abbr": ";Imperial",
        "aff_campus_unique_index": "1;1",
        "aff_campus_unique": ";London",
        "aff_country_unique_index": "1;1",
        "aff_country_unique": ";United Kingdom"
    },
    {
        "id": "78f1d1d86e",
        "title": "Exploiting the Separable Structure of SLAM",
        "site": "https://www.roboticsproceedings.org/rss11/p23.html",
        "author": "Kasra Khosoussi; Shoudong Huang; Gamini Dissanayake",
        "abstract": "In this paper we point out an overlooked structure of SLAM that distinguishes it from a generic nonlinear least squares problem. The measurement function in most common forms of SLAM is linear with respect to robot and features positions. Therefore, given an estimate for robot orientation, the conditionally optimal estimate for the rest of state variables can be easily obtained by solving a sparse linear-Gaussian estimation problem. We propose an algorithm to exploit this intrinsic property of SLAM by stripping the problem down to its nonlinear core, while maintaining its natural sparsity. Our algorithm can be used together with any Newton-based iterative solver and is applicable to 2D/3D pose-graph and feature-based problems. Our results suggest that iteratively solving the nonlinear core of SLAM leads to a fast and reliable convergence as compared to the state-of-the-art back-ends.",
        "bibtex": "@INPROCEEDINGS{Khosoussi-RSS-15, \r\n    AUTHOR    = {Kasra Khosoussi AND Shoudong Huang AND Gamini Dissanayake}, \r\n    TITLE     = {Exploiting the Separable Structure of SLAM}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.023} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p23.pdf",
        "supp": "",
        "pdf_size": 489734,
        "gs_citation": 17,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1480388333966236593&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "Centre for Autonomous Systems, University of Technology Sydney; Centre for Autonomous Systems, University of Technology Sydney; Centre for Autonomous Systems, University of Technology Sydney",
        "aff_domain": "uts.edu.au;uts.edu.au;uts.edu.au",
        "email": "uts.edu.au;uts.edu.au;uts.edu.au",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Technology Sydney",
        "aff_unique_dep": "Centre for Autonomous Systems",
        "aff_unique_url": "https://www.uts.edu.au",
        "aff_unique_abbr": "UTS",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Sydney",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "5d539d392a",
        "title": "Get Out of My Lab: Large-scale, Real-Time Visual-Inertial Localization",
        "site": "https://www.roboticsproceedings.org/rss11/p37.html",
        "author": "Simon Lynen; Torsten Sattler; Michael Bosse; Joel Hesch; Marc Pollefeys; Roland Siegwart",
        "abstract": "Accurately estimating a robot's pose relative to a global scene model and precisely tracking the pose in real-time is a fundamental problem for navigation and obstacle avoidance tasks. Due to the computational complexity of localization against a large map and the memory consumed by the model, state-of-the-art approaches are either limited to small workspaces or rely on a server-side system to query the global model while tracking the pose locally. The latter approaches face the problem of smoothly integrating the server's pose estimates into the trajectory computed locally to avoid temporal discontinuities. In this paper, we demonstrate that large-scale, real-time pose estimation and tracking can be performed on mobile platforms with limited resources without the use of an external server. This is achieved by employing map and descriptor compression schemes as well as efficient search algorithms from computer vision. We derive a formulation for integrating the global pose information into a local state estimator that produces much smoother trajectories than current approaches. Through detailed experiments, we evaluate each of our design choices individually and document its impact on the overall system performance, demonstrating that our approach outperforms state-of-the-art algorithms for localization at scale.",
        "bibtex": "@INPROCEEDINGS{Lynen-RSS-15, \r\n    AUTHOR    = {Simon Lynen AND Torsten Sattler AND Michael Bosse AND Joel Hesch AND Marc Pollefeys AND Roland Siegwart}, \r\n    TITLE     = {Get Out of My Lab: Large-scale, Real-Time Visual-Inertial Localization}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.037} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p37.pdf",
        "supp": "",
        "pdf_size": 7770926,
        "gs_citation": 306,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11960135799388773803&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": ";;;;;",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "6cdc281393",
        "title": "Grounding English Commands to Reward Functions",
        "site": "https://www.roboticsproceedings.org/rss11/p18.html",
        "author": "James MacGlashan; Monica Babes-Vroman; Marie desJardins; Michael Littman; Smaranda Muresan; Shawn Squire; Stefanie Tellex; Dilip Arumugam; Lei Yang",
        "abstract": "As intelligent robots become more prevalent, methods to make interaction with the robots more accessible are increasingly important. Communicating the tasks that a person wants the robot to carry out via natural language, and training the robot to ground the natural language through demonstration, are especially appealing approaches for interaction, since they do not require a technical background. However, existing approaches map natural language commands to robot command languages that directly express the sequence of actions the robot should execute. This sequence is often specific to a particular situation and does not generalize to new situations. To address this problem, we present a system that grounds natural language commands into reward functions using demonstrations of different natural language commands being carried out in the environment. Because language is grounded to reward functions, rather than explicit actions that the robot can perform, commands can be high-level, carried out in novel environments autonomously, and even transferred to other robots with different action spaces. We demonstrate that our learned model can be both generalized to novel environments and transferred to a robot with a different action space than the action space used during training.",
        "bibtex": "@INPROCEEDINGS{MacGlashan-RSS-15, \r\n    AUTHOR    = {James MacGlashan AND Monica Babes-Vroman AND Marie desJardins AND Michael Littman AND Smaranda Muresan AND Shawn Squire AND Stefanie Tellex AND Dilip Arumugam AND Lei Yang}, \r\n    TITLE     = {Grounding English Commands to Reward Functions}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.018} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p18.pdf",
        "supp": "",
        "pdf_size": 794623,
        "gs_citation": 69,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=865562037517737746&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "Computer Science Department, Brown University; Computer Science Department, Rutgers University; Department of Computer Science and Electrical Engineering, University of Maryland, Baltimore County; Computer Science Department, Brown University; Center for Computational Learning Systems, Columbia University; Department of Computer Science and Electrical Engineering, University of Maryland, Baltimore County; Computer Science Department, Brown University; Computer Science Department, Brown University; School of Software, Tsinghua University",
        "aff_domain": ";;;;;;;;",
        "email": ";;;;;;;;",
        "github": "https://github.com/jmacglashan/commandsToTasks",
        "project": "",
        "author_num": 9,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2;0;3;2;0;0;4",
        "aff_unique_norm": "Computer Science Department, Brown University;Rutgers University;Department of Computer Science and Electrical Engineering, University of Maryland, Baltimore County;Columbia University;Tsinghua University",
        "aff_unique_dep": ";Computer Science Department;;Center for Computational Learning Systems;School of Software",
        "aff_unique_url": ";https://www.rutgers.edu;;https://www.columbia.edu;https://www.tsinghua.edu.cn",
        "aff_unique_abbr": ";Rutgers;;Columbia;THU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;1;2",
        "aff_country_unique": ";United States;China"
    },
    {
        "id": "5b540cf53c",
        "title": "Guaranteeing Spoof-Resilient Multi-Robot Networks",
        "site": "https://www.roboticsproceedings.org/rss11/p20.html",
        "author": "Stephanie Gil; Swarun Kumar; Mark Mazumder; Dina Katabi; Daniela Rus",
        "abstract": "Multi-robot networks use wireless communication to provide wide-ranging services such as aerial surveillance and unmanned delivery. However, effective coordination between multiple robots requires trust, making them particularly vulnerable to cyber-attacks. Specifically, such networks can be gravely disrupted by the Sybil attack, where even a single malicious robot can spoof a large number of fake clients. This paper proposes a new solution to defend against the Sybil attack, without requiring expensive cryptographic key-distribution. Our core contribution is a novel algorithm implemented on commercial Wi-Fi radios that can \"sense\" spoofers using the physics of wireless signals. We derive theoretical guarantees on how this algorithm bounds the impact of the Sybil Attack on a broad class of robotic coverage problems. We experimentally validate our claims using a team of AscTec quadrotor servers and iRobot Create ground clients, and demonstrate spoofer detection rates over 96%.",
        "bibtex": "@INPROCEEDINGS{Gil-RSS-15, \r\n    AUTHOR    = {Stephanie Gil AND Swarun Kumar AND Mark Mazumder AND Dina Katabi AND Daniela Rus}, \r\n    TITLE     = {Guaranteeing Spoof-Resilient Multi-Robot Networks}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.020} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p20.pdf",
        "supp": "",
        "pdf_size": 838892,
        "gs_citation": 124,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1953142100592742387&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 21,
        "aff": "Massachusetts Institute of Technology; Massachusetts Institute of Technology; MIT Lincoln Laboratory; Massachusetts Institute of Technology; Massachusetts Institute of Technology",
        "aff_domain": "mit.edu;mit.edu;ll.mit.edu;mit.edu;mit.edu",
        "email": "mit.edu;mit.edu;ll.mit.edu;mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "https://web.mit.edu",
        "aff_unique_abbr": "MIT",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Lincoln Laboratory",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "1029f9a823",
        "title": "Guidance and Navigation for UAV Airborne Docking",
        "site": "https://www.roboticsproceedings.org/rss11/p17.html",
        "author": "Daniel Wilson; Ali Goktogan; Salah Sukkarieh",
        "abstract": "Unmanned aerial vehicle (UAV) capability is currently limited by the amount of energy that can be stored onboard. Airborne docking, for mid-air refueling, is a viable solution that has been implemented with manned aircraft for decades, but has yet to be achieved with their unmanned counterparts. The prohibitive challenge is the highly accurate and reliable relative positioning performance that is necessary to dock with a small target, in the air, amidst external disturbances. This paper presents a complete solution to airborne docking, which includes vision-aided unscented Kalman filters for leader-relative navigation and docking appendage motion estimation; and guidance that is suitable for all phases of the mission. The work concludes by demonstrating the proposed algorithms in what is thought to be the first UAV airborne docking.",
        "bibtex": "@INPROCEEDINGS{Wilson-RSS-15, \r\n    AUTHOR    = {Daniel Wilson AND Ali Goktogan AND Salah Sukkarieh}, \r\n    TITLE     = {Guidance and Navigation for UAV Airborne Docking}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.017} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p17.pdf",
        "supp": "",
        "pdf_size": 4788230,
        "gs_citation": 52,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15922229158297257834&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "Australian Centre for Field Robotics (ACFR); Australian Centre for Field Robotics (ACFR); Australian Centre for Field Robotics (ACFR)",
        "aff_domain": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au",
        "email": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Australian Centre for Field Robotics (ACFR)",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "3b1e5296b9",
        "title": "Hilbert maps: scalable continuous occupancy mapping with stochastic gradient descent",
        "site": "https://www.roboticsproceedings.org/rss11/p02.html",
        "author": "Fabio Ramos; Lionel Ott",
        "abstract": "The vast amount of data robots can capture today motivates the development of fast and scalable statistical tools to model the environment the robot operates in. We devise a new technique for environment representation through continuous occupancy mapping that improves on the popular occupancy grip maps in two fundamental aspects: 1) it does not assume an a priori discretisation of the world into grid cells and therefore can provide maps at an arbitrary resolution; 2) it captures statistical relationships between measurements naturally, thus being more robust to outliers and possessing better generalisation performance. The technique named Hilbert maps, is based on the computation of fast kernel approximations that project the data in a Hilbert space where a logistic regression classifier is learnt. We show that this approach allows for efficient stochastic gradient descent optimisation where each measurement is only processed once during learning or online updates. We present results with three types of kernel approximations, Random Fourier, Nystrom and a novel sparse projections. We also show how to extend the approach to accept probability distributions as inputs, i.e. when there is uncertainty over the position of laser scans due to sensor or localisation errors. Experiments demonstrate the benefits of the approach in popular benchmark datasets with several thousand laser scans.",
        "bibtex": "@INPROCEEDINGS{Ramos-RSS-15, \r\n    AUTHOR    = {Fabio Ramos AND Lionel Ott}, \r\n    TITLE     = {Hilbert maps: scalable continuous occupancy mapping with stochastic gradient descent}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.002} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p02.pdf",
        "supp": "",
        "pdf_size": 2198225,
        "gs_citation": 241,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13932075246310293331&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": "School of Information Technologies, The University of Sydney, Australia; School of Information Technologies, The University of Sydney, Australia",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "The University of Sydney",
        "aff_unique_dep": "School of Information Technologies",
        "aff_unique_url": "https://www.sydney.edu.au",
        "aff_unique_abbr": "USYD",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Sydney",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "378f500544",
        "title": "IMU Preintegration on Manifold for Efficient Visual-Inertial Maximum-a-Posteriori Estimation",
        "site": "https://www.roboticsproceedings.org/rss11/p06.html",
        "author": "Christian Forster; Luca Carlone; Frank Dellaert; Davide Scaramuzza",
        "abstract": "Recent results in monocular visual-inertial navigation (VIN) have shown that optimization-based approaches outperform filtering methods in terms of accuracy due to their capability to relinearize past states. However, the improvement comes at the cost of increased computational complexity. In this paper, we address this issue by preintegrating inertial measurements between selected keyframes. The preintegration allows us to accurately summarize hundreds of inertial measurements into a single relative motion constraint. Our first contribution is a preintegration theory that properly addresses the manifold structure of the rotation group and carefully deals with uncertainty propagation. The measurements are integrated in a local frame, which eliminates the need to repeat the integration when the linearization point changes while leaving the opportunity for belated bias corrections. The second contribution is to show that the preintegrated IMU model can be seamlessly integrated in a visual-inertial pipeline under the unifying framework of factor graphs. This enables the use of a structureless model for visual measurements, further accelerating the computation. The third contribution is an extensive evaluation of our monocular VIN pipeline: experimental results confirm that our system is very fast and demonstrates superior accuracy with respect to competitive state-of-the-art filtering and optimization algorithms, including off-the-shelf systems such as Google Tango.",
        "bibtex": "@INPROCEEDINGS{Forster-RSS-15, \r\n    AUTHOR    = {Christian Forster AND Luca Carlone AND Frank Dellaert AND Davide Scaramuzza}, \r\n    TITLE     = {IMU Preintegration on Manifold for Efficient Visual-Inertial Maximum-a-Posteriori Estimation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.006} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p06.pdf",
        "supp": "",
        "pdf_size": 1764874,
        "gs_citation": -1,
        "gs_cited_by_link": "",
        "gs_version_total": -1,
        "aff": "Robotics and Perception Group, University of Zurich, Switzerland; School of Interactive Computing, Georgia Institute of Technology, Atlanta, GA, USA; School of Interactive Computing, Georgia Institute of Technology, Atlanta, GA, USA; Robotics and Perception Group, University of Zurich, Switzerland",
        "aff_domain": "ifi.uzh.ch;ifi.uzh.ch;gatech.edu;cc.gatech.edu",
        "email": "ifi.uzh.ch;ifi.uzh.ch;gatech.edu;cc.gatech.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;0",
        "aff_unique_norm": "University of Zurich;Georgia Institute of Technology",
        "aff_unique_dep": "Robotics and Perception Group;School of Interactive Computing",
        "aff_unique_url": "https://www.unizh.ch;https://www.gatech.edu",
        "aff_unique_abbr": "UZH;Georgia Tech",
        "aff_campus_unique_index": "1;1",
        "aff_campus_unique": ";Atlanta",
        "aff_country_unique_index": "0;1;1;0",
        "aff_country_unique": "Switzerland;United States"
    },
    {
        "id": "4f77e87786",
        "title": "Information-Theoretic Planning with Trajectory Optimization for Dense 3D Mapping",
        "site": "https://www.roboticsproceedings.org/rss11/p03.html",
        "author": "Benjamin Charrow; Gregory Kahn; Sachin Patil; Sikang Liu; Ken Goldberg; Pieter Abbeel; Nathan Michael; Vijay Kumar",
        "abstract": "We propose an information-theoretic planning approach that enables mobile robots to autonomously construct dense 3D maps in a computationally efficient manner. Inspired by prior work, we accomplish this task by formulating an information-theoretic objective function based on Cauchy-Schwarz quadratic mutual information (CSQMI) that guides robots to obtain measurements in uncertain regions of the map. We then contribute a two stage approach for active mapping. First, we generate a candidate set of trajectories using a combination of global planning and generation of local motion primitives. From this set, we choose a trajectory that maximizes the information-theoretic objective. Second, we employ a gradient-based trajectory optimization technique to locally refine the chosen trajectory such that the CSQMI objective is maximized while satisfying the robot's motion constraints. We evaluated our approach through a series of simulations and experiments on a ground robot and an aerial robot mapping unknown 3D environments. Real-world experiments suggest our approach reduces the time to explore an environment by 70% compared to a closest frontier exploration strategy and 57% compared to an information-based strategy that uses global planning, while simulations demonstrate the approach extends to aerial robots with higher-dimensional state.",
        "bibtex": "@INPROCEEDINGS{Charrow-RSS-15, \r\n    AUTHOR    = {Benjamin Charrow AND Gregory Kahn AND Sachin Patil AND Sikang Liu AND Ken Goldberg AND Pieter Abbeel AND Nathan Michael AND Vijay Kumar}, \r\n    TITLE     = {Information-Theoretic Planning with Trajectory Optimization for Dense 3D Mapping}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.003} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p03.pdf",
        "supp": "",
        "pdf_size": 2729306,
        "gs_citation": 232,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16964779290543524986&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": ";;;;;;;",
        "aff_domain": ";;;;;;;",
        "email": ";;;;;;;",
        "github": "",
        "project": "",
        "author_num": 8,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "cd8aa64766",
        "title": "Layered Interpretation of Street View Images",
        "site": "https://www.roboticsproceedings.org/rss11/p25.html",
        "author": "Ming-Yu Liu; Shuoxin Lin; Srikumar Ramalingam; Oncel Tuzel",
        "abstract": "We propose a layered street view model to encode both depth and semantic information on street view images for autonomous driving. Recently, stixels, stix-mantics, and tiered scene labeling methods have been proposed to model street view images. We propose a 4-layer street view model, a compact representation over the recently proposed stix-mantics model. Our layers encode semantic classes like ground, pedestrians, vehicles, buildings, and sky in addition to the depths. The only input to our algorithm is a pair of stereo images. We use a deep neural network to extract the appearance features for semantic classes. We use a simple and an efficient inference algorithm to jointly estimate both semantic classes and layered depth values. Our method outperforms other competing approaches in Daimler urban scene segmentation dataset. Our algorithm is massively parallelizable, allowing a GPU implementation with a processing speed about 9 fps.",
        "bibtex": "@INPROCEEDINGS{Liu-RSS-15, \r\n    AUTHOR    = {Ming-Yu Liu AND Shuoxin Lin AND Srikumar Ramalingam AND Oncel Tuzel}, \r\n    TITLE     = {Layered Interpretation of Street View Images}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.025} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p25.pdf",
        "supp": "",
        "pdf_size": 951512,
        "gs_citation": 27,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10986323192619794741&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "b69f64bdc3",
        "title": "Leveraging Cone Double Description for Multi-contact Stability of Humanoids with Applications to Statics and Dynamics",
        "site": "https://www.roboticsproceedings.org/rss11/p28.html",
        "author": "Stephane Caron; Quang Cuong Pham; Yoshihiko Nakamura",
        "abstract": "We build on previous works advocating the use of the Gravito-Inertial Wrench Cone (GIWC) as a general contact stability criterion (a ZMP for non-coplanar contacts). We show how to compute this wrench cone from the friction cones of contact forces by using an intermediate representation, the surface contact wrench cone, which is the minimal representation of contact stability for each surface contact. The observation that the GIWC needs to be computed only once per stance leads to particularly efficient algorithms, as we illustrate in two important problems for humanoids: testing robust static equilibrium and time-optimal path parameterization. We show, through theoretical analysis and in physical simulations, that our method is more general and/or outperforms existing ones.",
        "bibtex": "@INPROCEEDINGS{Caron-RSS-15, \r\n    AUTHOR    = {Stephane Caron AND Quang Cuong Pham AND Yoshihiko Nakamura}, \r\n    TITLE     = {Leveraging Cone Double Description for Multi-contact Stability of Humanoids with Applications to Statics and Dynamics}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.028} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p28.pdf",
        "supp": "",
        "pdf_size": 1912419,
        "gs_citation": 108,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9685941977845296377&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "Department of Mechano-Informatics, The University of Tokyo, Japan; School of Mechanical and Aerospace Engineering, Nanyang Technological University, Singapore; Department of Mechano-Informatics, The University of Tokyo, Japan",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "The University of Tokyo;Nanyang Technological University",
        "aff_unique_dep": "Department of Mechano-Informatics;School of Mechanical and Aerospace Engineering",
        "aff_unique_url": "https://www.u-tokyo.ac.jp;https://www.ntu.edu.sg",
        "aff_unique_abbr": "UTokyo;NTU",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Singapore",
        "aff_country_unique_index": "0;1;0",
        "aff_country_unique": "Japan;Singapore"
    },
    {
        "id": "24cb61e3bd",
        "title": "Long-horizon Robotic Search and Classification using Sampling-based Motion Planning",
        "site": "https://www.roboticsproceedings.org/rss11/p10.html",
        "author": "Geoffrey Hollinger",
        "abstract": "This paper presents the Rapidly-exploring Adaptive Search and Classification (ReASC) algorithm, a sampling-based algorithm for planning the trajectories of mobile robots performing real-time target search and classification tasks in the field. The proposed algorithm incrementally builds up a tree of solutions and evaluates the utility of each solution for identifying targets in an environment. An optimistic approximation for the classification utility is used, which reduces the computational cost of evaluating trajectories and makes real-time adaptive planning feasible. The proposed algorithm is tested on an autonomous aquatic vehicle and are shown to outperform myopic methods by up to 36% in a lake monitoring scenario.",
        "bibtex": "@INPROCEEDINGS{Hollinger-RSS-15, \r\n    AUTHOR    = {Geoffrey Hollinger}, \r\n    TITLE     = {Long-horizon Robotic Search and Classification using Sampling-based Motion Planning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.010} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p10.pdf",
        "supp": "",
        "pdf_size": 1712587,
        "gs_citation": 19,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14406937813597065414&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "Robotics Program, School of Mechanical, Industrial & Manufacturing Engineering, Oregon State University, Corvallis, OR 97331, USA",
        "aff_domain": "oregonstate.edu",
        "email": "oregonstate.edu",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Robotics Program, School of Mechanical, Industrial & Manufacturing Engineering, Oregon State University, Corvallis, OR 97331, USA",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": ""
    },
    {
        "id": "49f194d1f8",
        "title": "Material Recognition from Heat Transfer given Varying Initial Conditions and Short-Duration Contact",
        "site": "https://www.roboticsproceedings.org/rss11/p19.html",
        "author": "Tapomayukh Bhattacharjee; Joshua Wade; Charles Kemp",
        "abstract": "When making contact with an object, a robot can use a tactile sensor consisting of a heating element and a temperature sensor to recognize the object's material based on conductive heat transfer from the tactile sensor to the object. When this type of tactile sensor has time to fully reheat prior to contact and the duration of contact is long enough to achieve a thermal steady state, numerous methods have been shown to perform well. In order to enable robots to more efficiently sense their environments and take advantage of brief contact events over which they lack control, we focus on the problem of material recognition from heat transfer given varying initial conditions and short-duration contact. We present both model-based and data-driven methods. For the model-based method, we modeled the thermodynamics of the sensor in contact with a material as contact between two semi-infinite solids. For the data-driven methods, we used three machine learning algorithms (SVM+PCA, k-NN+PCA, HMMs) with time series of raw temperature measurements and temperature change estimates. When recognizing 11 materials with varying initial conditions and 3-fold cross-validation, SVM+PCA outperformed all other methods, achieving 84% accuracy with 0.5 s of contact and 98% accuracy with 1.5 s of contact.",
        "bibtex": "@INPROCEEDINGS{Bhattacharjee-RSS-15, \r\n    AUTHOR    = {Tapomayukh Bhattacharjee AND Joshua Wade AND Charles Kemp}, \r\n    TITLE     = {Material Recognition from Heat Transfer given Varying Initial Conditions and Short-Duration Contact}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.019} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p19.pdf",
        "supp": "",
        "pdf_size": 1116110,
        "gs_citation": 61,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7104080681279851037&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Healthcare Robotics Lab, Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia 30308; Healthcare Robotics Lab, Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia 30308; Healthcare Robotics Lab, Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia 30308",
        "aff_domain": "gatech.edu;gatech.edu;bme.gatech.edu",
        "email": "gatech.edu;gatech.edu;bme.gatech.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Healthcare Robotics Lab, Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia 30308",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "db117b32b9",
        "title": "Monocular SLAM Supported Object Recognition",
        "site": "https://www.roboticsproceedings.org/rss11/p34.html",
        "author": "Sudeep Pillai; John Leonard",
        "abstract": "In this work, we develop a monocular SLAM-aware object recognition system that is able to achieve considerably stronger recognition performance, as compared to classical object recognition systems that function on a frame-by-frame basis. By incorporating several key ideas including multi-view object proposals and efficient feature encoding methods, our proposed system is able to detect and robustly recognize objects in its environment using a single RGB camera in near-constant time. Through experiments, we illustrate the utility of using such a system to effectively detect and recognize objects, incorporating multiple object viewpoint detections into a unified prediction hypothesis. The performance of the proposed recognition system is evaluated on the UW RGB-D Dataset, showing strong recognition performance and scalable run-time performance compared to current state-of-the-art recognition systems.",
        "bibtex": "@INPROCEEDINGS{Pillai-RSS-15, \r\n    AUTHOR    = {Sudeep Pillai AND John Leonard}, \r\n    TITLE     = {Monocular SLAM Supported Object Recognition}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.034} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p34.pdf",
        "supp": "",
        "pdf_size": 7129202,
        "gs_citation": 179,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11605724587450789122&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": "Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology; Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology",
        "aff_domain": "csail.mit.edu;csail.mit.edu",
        "email": "csail.mit.edu;csail.mit.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "Computer Science and Artificial Intelligence Laboratory",
        "aff_unique_url": "https://www.csail.mit.edu",
        "aff_unique_abbr": "MIT",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Cambridge",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "8933c41b02",
        "title": "Motion Planning for Unlabeled Discs with Optimality Guarantees",
        "site": "https://www.roboticsproceedings.org/rss11/p11.html",
        "author": "Kiril Solovey; Jingjin Yu; Or Zamir; Dan Halperin",
        "abstract": "We study the problem of path planning for unlabeled (indistinguishable) unit-disc robots in a planar environment cluttered with polygonal obstacles. We introduce an algorithm which minimizes the total path length, i.e., the sum of lengths of the individual paths. Our algorithm is guaranteed to find a solution if one exists, or report that none exists otherwise. It runs in time $\\tilde{O}(m^4+m^2n^2)$, where $m$ is the number of robots and $n$ is the total complexity of the workspace. Moreover, the total length of the returned solution is at most $O(\\text{OPT}+O(m))$, where OPT is the optimal-solution cost. To the best of our knowledge this is the first algorithm for the problem that has such guarantees. The algorithm has been implemented in an exact manner and we present experimental results that attest to its efficiency.",
        "bibtex": "@INPROCEEDINGS{Solovey-RSS-15, \r\n    AUTHOR    = {Kiril Solovey AND Jingjin Yu AND Or Zamir AND Dan Halperin}, \r\n    TITLE     = {Motion Planning for Unlabeled Discs with Optimality Guarantees}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.011} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p11.pdf",
        "supp": "",
        "pdf_size": 548996,
        "gs_citation": 91,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1414864462113138949&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "Blavatnic School of Computer Science, Tel Aviv University, Israel; Computer Science and Artificial Intelligence Lab, Massachusetts Institute of Technology; Blavatnic School of Computer Science, Tel Aviv University, Israel; Blavatnic School of Computer Science, Tel Aviv University, Israel",
        "aff_domain": "post.tau.ac.il;csail.mit.edu;mail.tau.ac.il;post.tau.ac.il",
        "email": "post.tau.ac.il;csail.mit.edu;mail.tau.ac.il;post.tau.ac.il",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;0",
        "aff_unique_norm": "Blavatnic School of Computer Science, Tel Aviv University, Israel;Massachusetts Institute of Technology",
        "aff_unique_dep": ";Computer Science and Artificial Intelligence Lab",
        "aff_unique_url": ";https://www.csail.mit.edu",
        "aff_unique_abbr": ";MIT",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Cambridge",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "65dae23a2a",
        "title": "Multipolicy Decision-Making for Autonomous Driving via Changepoint-based Behavior Prediction",
        "site": "https://www.roboticsproceedings.org/rss11/p43.html",
        "author": "Enric Galceran; Alexander Cunningham; Ryan Eustice; Edwin Olson",
        "abstract": "To operate reliably in real-world traffic, an autonomous car must evaluate the consequences of its potential actions by anticipating the uncertain intentions of other traffic participants. This paper presents an integrated behavioral inference and decision-making approach that models vehicle behavior for both our vehicle and nearby vehicles as a discrete set of closed-loop policies that react to the actions of other agents. Each policy captures a distinct high-level behavior and intention, such as driving along a lane or turning at an intersection. We first employ Bayesian changepoint detection on the observed history of states of nearby cars to estimate the distribution over potential policies that each nearby car might be executing. We then sample policies from these distributions to obtain high-likelihood actions for each participating vehicle. Through closed-loop forward simulation of these samples, we can evaluate the outcomes of the interaction of our vehicle with other participants (e.g., a merging vehicle accelerates and we slow down to make room for it, or the vehicle in front of ours suddenly slows down and we decide to pass it). Based on those samples, our vehicle then executes the policy with the maximum expected reward value. Thus, our system is able to make decisions based on coupled interactions between cars in a tractable manner. This work extends our previous multipolicy system by incorporating behavioral anticipation into decision-making to evaluate sampled potential vehicle interactions. We evaluate our approach using real-world traffic-tracking data from our autonomous vehicle platform, and present decision-making results in simulation involving highway traffic scenarios.",
        "bibtex": "@INPROCEEDINGS{Galceran-RSS-15, \r\n    AUTHOR    = {Enric Galceran AND Alexander Cunningham AND Ryan Eustice AND Edwin Olson}, \r\n    TITLE     = {Multipolicy Decision-Making for Autonomous Driving via Changepoint-based Behavior Prediction}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.043} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p43.pdf",
        "supp": "",
        "pdf_size": 6254574,
        "gs_citation": 132,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17125752643532078825&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": "University of Michigan; University of Michigan; University of Michigan; University of Michigan",
        "aff_domain": "umich.edu;umich.edu;umich.edu;umich.edu",
        "email": "umich.edu;umich.edu;umich.edu;umich.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "University of Michigan",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.umich.edu",
        "aff_unique_abbr": "UM",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "5055babe4e",
        "title": "On the hardness of unlabeled multi-robot motion planning",
        "site": "https://www.roboticsproceedings.org/rss11/p46.html",
        "author": "Kiril Solovey; Dan Halperin",
        "abstract": "In unlabeled multi-robot motion planning several interchangeable robots operate in a common workspace. The goal is to move the robots to a set of target positions such that each position will be occupied by some robot. In this paper, we study this problem for the specific case of unit-square robots moving amidst polygonal obstacles and show that it is PSPACE-hard. We also consider three additional variants of this problem and show that they are all PSPACE-hard as well. To the best of our knowledge, this is the first hardness proof for the unlabeled case. Furthermore, our proofs can be used to show that the labeled variant (where each robot is assigned with a specific target position), again, for unit-square robots, is PSPACE-hard as well, which sets another precedence, as previous hardness results require the robots to be of different shapes.",
        "bibtex": "@INPROCEEDINGS{Solovey-RSS-15, \r\n    AUTHOR    = {Kiril Solovey AND Dan Halperin}, \r\n    TITLE     = {On the hardness of unlabeled multi-robot motion planning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.046} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p46.pdf",
        "supp": "",
        "pdf_size": 276740,
        "gs_citation": 125,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12938021211562959780&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 9,
        "aff": "Blavatnic School of Computer Science, Tel Aviv University, Israel; Blavatnic School of Computer Science, Tel Aviv University, Israel",
        "aff_domain": "post.tau.ac.il;post.tau.ac.il",
        "email": "post.tau.ac.il;post.tau.ac.il",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Blavatnic School of Computer Science, Tel Aviv University, Israel",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "eaab6fad5e",
        "title": "Online Localization of Radio-Tagged Wildlife with an Autonomous Aerial Robot System",
        "site": "https://www.roboticsproceedings.org/rss11/p42.html",
        "author": "Oliver Cliff; Robert Fitch; Salah Sukkarieh; Debbie Saunders; Robert Heinsohn",
        "abstract": "The application of autonomous robots to efficiently locate small wildlife species has the potential to provide significant ecological insights not previously possible using traditional land-based survey techniques, and a basis for improved conservation policy and management. We present an approach for autonomously localizing radio-tagged wildlife using a small aerial robot. We present a novel two-point phased array antenna system that yields unambiguous bearing measurements and an associated uncertainty measure. Our estimation and information-based planning algorithms incorporate this bearing uncertainty to choose observation points that improve confidence in the location estimate. These algorithms run online in real time and we report experimental results that show successful autonomous localization of stationary radio tags and live radio-tagged birds.",
        "bibtex": "@INPROCEEDINGS{Cliff-RSS-15, \r\n    AUTHOR    = {Oliver Cliff AND Robert Fitch AND Salah Sukkarieh AND Debbie Saunders AND Robert Heinsohn}, \r\n    TITLE     = {Online Localization of Radio-Tagged Wildlife with an Autonomous Aerial Robot System}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.042} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p42.pdf",
        "supp": "",
        "pdf_size": 2912664,
        "gs_citation": 312,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12855440045287920975&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "Australian Centre for Field Robotics, University of Sydney, Australia; Australian Centre for Field Robotics, University of Sydney, Australia; Australian Centre for Field Robotics, University of Sydney, Australia; Fenner School of Environment and Society, Australian National University, Australia; Fenner School of Environment and Society, Australian National University, Australia",
        "aff_domain": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au;anu.edu.au;anu.edu.au",
        "email": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au;anu.edu.au;anu.edu.au",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;1;1",
        "aff_unique_norm": "University of Sydney;Fenner School of Environment and Society, Australian National University, Australia",
        "aff_unique_dep": "Australian Centre for Field Robotics;",
        "aff_unique_url": "https://www.sydney.edu.au;",
        "aff_unique_abbr": "USYD;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Australia;"
    },
    {
        "id": "91f27afcdd",
        "title": "Online Planning for Autonomous Running Jumps Over Obstacles in High-Speed Quadrupeds",
        "site": "https://www.roboticsproceedings.org/rss11/p47.html",
        "author": "Hae-Won Park; Patrick Wensing; Sangbae Kim",
        "abstract": "This paper presents a new framework for the generation of high-speed running jumps to clear terrain obstacles in quadrupedal robots. Our methods enable the quadruped to autonomously jump over obstacles up to 40 cm in height within a single control framework. Specifically, we propose new control system components, layered on top of a low-level running controller, which actively modify the approach and select stance force profiles as required to clear a sensed obstacle. The approach controller enables the quadruped to end in a preferable state relative to the obstacle just before the jump. This multi-step gait planning is formulated as a multiple-horizon model predictive control problem and solved at each step through quadratic programming. Ground reaction force profiles to execute the running jump are selected through constrained nonlinear optimization on a simplified model of the robot that possesses polynomial dynamics. Exploiting the simplified structure of these dynamics, the presented method greatly accelerates the computation of otherwise costly function and constraint evaluations that are required during optimization. With these considerations, the new algorithms allow for online planning that is critical for reliable response to unexpected situations. Experimental results, for a stand-alone quadruped with on-board power and computation, show the viability of this approach, and represent important steps towards broader dynamic maneuverability in experimental machines.",
        "bibtex": "@INPROCEEDINGS{Park-RSS-15, \r\n    AUTHOR    = {Hae-Won Park AND Patrick Wensing AND Sangbae Kim}, \r\n    TITLE     = {Online Planning for Autonomous Running Jumps Over Obstacles in High-Speed Quadrupeds}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.047} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p47.pdf",
        "supp": "",
        "pdf_size": 2490699,
        "gs_citation": 154,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2924666087815883138&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": "Department of Mechanical Engineering, MIT, Cambridge, MA, 02139; Department of Mechanical Engineering, MIT, Cambridge, MA, 02139; Department of Mechanical Engineering, MIT, Cambridge, MA, 02139",
        "aff_domain": "mit.edu;mit.edu;mit.edu",
        "email": "mit.edu;mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Department of Mechanical Engineering, MIT, Cambridge, MA, 02139",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "c67b0ee020",
        "title": "Optimal Robust Control for Bipedal Robots through Control Lyapunov Function based Quadratic Programs",
        "site": "https://www.roboticsproceedings.org/rss11/p48.html",
        "author": "Quan Nguyen; Koushil Sreenath",
        "abstract": "This paper builds off of recent work on rapidly exponentially stabilizing control Lyapunov functions (RES-CLF) and control Lyapunov function based quadratic programs (CLF-QP) for underactuated hybrid systems. The primary contribution of this paper is developing a robust control technique for underactuated hybrid systems with application to bipedal walking, that is able to track desired trajectories with significant model perturbation (mass and inertia increased by up to 200%.) We evaluate our proposed control design on a model of RABBIT, a five-link planar bipedal robot.",
        "bibtex": "@INPROCEEDINGS{Nguyen-RSS-15, \r\n    AUTHOR    = {Quan Nguyen AND Koushil Sreenath}, \r\n    TITLE     = {Optimal Robust Control for Bipedal Robots through Control Lyapunov Function based Quadratic Programs}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.048} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p48.pdf",
        "supp": "",
        "pdf_size": 1466083,
        "gs_citation": 88,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2068924925950092532&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Department of Mechanical Engineering, Carnegie Mellon University; Depts. of Mechanical Engineering, Robotics Institute, and Electrical and Computer Engineering, Carnegie Mellon University",
        "aff_domain": "cmu.edu;cmu.edu",
        "email": "cmu.edu;cmu.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1",
        "aff_unique_norm": "Carnegie Mellon University;Depts. of Mechanical Engineering, Robotics Institute, and Electrical and Computer Engineering, Carnegie Mellon University",
        "aff_unique_dep": "Department of Mechanical Engineering;",
        "aff_unique_url": "https://www.cmu.edu;",
        "aff_unique_abbr": "CMU;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "915383d697",
        "title": "Place Recognition with ConvNet Landmarks: Viewpoint-Robust, Condition-Robust, Training-Free",
        "site": "https://www.roboticsproceedings.org/rss11/p22.html",
        "author": "Niko Suenderhauf; Sareh Shirazi; Adam Jacobson; Feras Dayoub; Edward Pepperell; Ben Upcroft; Michael Milford",
        "abstract": "Place recognition has long been an incompletely solved problem in that all approaches involve significant com- promises. Current methods address many but never all of the critical challenges of place recognition _ viewpoint-invariance, condition-invariance and minimizing training requirements. Here we present an approach that adapts state-of-the-art object proposal techniques to identify potential landmarks within an image for place recognition. We use the astonishing power of convolutional neural network features to identify matching landmark proposals between images to perform place recognition over extreme appearance and viewpoint variations. Our system does not require any form of training, all components are generic enough to be used off-the-shelf. We present a range of challenging experiments in varied viewpoint and environmental conditions. We demonstrate superior performance to current state-of-the- art techniques. Furthermore, by building on existing and widely used recognition frameworks, this approach provides a highly compatible place recognition system with the potential for easy integration of other techniques such as object detection and semantic scene interpretation.",
        "bibtex": "@INPROCEEDINGS{Suenderhauf-RSS-15, \r\n    AUTHOR    = {Niko Suenderhauf AND Sareh Shirazi AND Adam Jacobson AND Feras Dayoub AND Edward Pepperell AND Ben Upcroft AND Michael Milford}, \r\n    TITLE     = {Place Recognition with ConvNet Landmarks: Viewpoint-Robust, Condition-Robust, Training-Free}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.022} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p22.pdf",
        "supp": "",
        "pdf_size": 8019632,
        "gs_citation": 503,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5660314313496576513&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia; ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia; ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia; ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia; ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia; ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia; ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia",
        "aff_domain": "roboticvision.org; ; ; ; ; ; ",
        "email": "roboticvision.org; ; ; ; ; ; ",
        "github": "",
        "project": "",
        "author_num": 7,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0;0;0",
        "aff_unique_norm": "ARC Centre of Excellence for Robotic Vision, Queensland University of Technology, Brisbane QLD 4001, Australia",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "0af8d7873f",
        "title": "Policy Search for Multi-Robot Coordination under Uncertainty",
        "site": "https://www.roboticsproceedings.org/rss11/p07.html",
        "author": "Christopher Amato; George Konidaris; Ariel Anders; Gabriel Cruz; Jonathan How; Leslie Kaelbling",
        "abstract": "We introduce a principled method for multi-robot coordination based on a generic model (termed a MacDec-POMDP) of multi-robot cooperative planning in the presence of stochasticity, uncertain sensing and communication limitations. We present a new MacDec-POMDP planning algorithm that searches over policies represented as finite-state controllers, rather than the existing policy tree representation. Finite-state controllers can be much more concise than trees, are much easier to interpret, and can operate over an infinite horizon. The resulting policy search algorithm requires a substantially simpler simulator that models only the outcomes of executing a given set of motor controllers, not the details of the executions themselves and can to solve significantly larger problems than existing MacDec-POMDP planners. We demonstrate significantly improved performance over previous methods and application to a cooperative multi-robot bartending task, showing that our method can be used for actual multi-robot systems.",
        "bibtex": "@INPROCEEDINGS{Amato-RSS-15, \r\n    AUTHOR    = {Christopher Amato AND George Konidaris AND Ariel Anders AND Gabriel Cruz AND Jonathan How AND Leslie Kaelbling}, \r\n    TITLE     = {Policy Search for Multi-Robot Coordination under Uncertainty}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.007} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p07.pdf",
        "supp": "",
        "pdf_size": 10327470,
        "gs_citation": 101,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9473346268824294291&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": ";;;;;",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "96858c8b88",
        "title": "Probabilistic Semi-Dense Mapping from Highly Accurate Feature-Based Monocular SLAM",
        "site": "https://www.roboticsproceedings.org/rss11/p41.html",
        "author": "Raul Mur-Artal; Juan Tardos",
        "abstract": "In the last years several direct (i.e. featureless) monocular SLAM approaches have appeared showing impressive semi-dense or dense scene reconstructions. These works have questioned the need of features, in which consolidated SLAM techniques of the last decade were based. In this paper we present a novel feature-based monocular SLAM system that is more robust, gives more accurate camera poses, and obtains comparable or better semi-dense reconstructions than the current state of the art. Our semi-dense mapping operates over keyframes, optimized by local bundle adjustment, allowing to obtain accurate triangulations from wide baselines. Our novel method to search correspondences, the measurement fusion and the inter-keyframe depth consistency tests allow to obtain clean reconstructions with very few outliers. Against the current trend in direct SLAM, our experiments show that by decoupling the semi-dense reconstruction from the trajectory computation, the results obtained are better. This opens the discussion on the benefits of features even if a semi-dense reconstruction is desired.",
        "bibtex": "@INPROCEEDINGS{Mur-Artal-RSS-15, \r\n    AUTHOR    = {Raul Mur-Artal AND Juan Tardos}, \r\n    TITLE     = {Probabilistic Semi-Dense Mapping from Highly Accurate Feature-Based Monocular SLAM}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.041} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p41.pdf",
        "supp": "",
        "pdf_size": 8103673,
        "gs_citation": 182,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=252005835837661095&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 3,
        "aff": "Instituto de Investigación en Ingeniería de Aragón (I3A), Universidad de Zaragoza, Spain; Instituto de Investigación en Ingeniería de Aragón (I3A), Universidad de Zaragoza, Spain",
        "aff_domain": "unizar.es;unizar.es",
        "email": "unizar.es;unizar.es",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Universidad de Zaragoza",
        "aff_unique_dep": "Instituto de Investigación en Ingeniería de Aragón (I3A)",
        "aff_unique_url": "https://www.unizar.es",
        "aff_unique_abbr": "UniZar",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Spain"
    },
    {
        "id": "a0c80b59c0",
        "title": "Quantitative Measures of a Robot's Ability to Balance",
        "site": "https://www.roboticsproceedings.org/rss11/p26.html",
        "author": "Roy Featherstone",
        "abstract": "This paper shows how to define quantitative measures of a robot's ability to balance itself actively on a single point of support. These measures are expressed as ratios of velocities, and are called velocity gains. This paper builds on earlier work in this area by showing how these gains can be defined and calculated for the case of a general planar robot balancing on a general rolling-contact point in the plane, and the case of a general spatial robot balancing on a general rolling-contact point in 3D space. The case of balancing on a contact area with compliance is also considered. The paper concludes with two examples showing how to use velocity gains in the design of a triple pendulum and the analysis of a hydraulic quadruped.",
        "bibtex": "@INPROCEEDINGS{Featherstone-RSS-15, \r\n    AUTHOR    = {Roy Featherstone}, \r\n    TITLE     = {Quantitative Measures of a Robot's Ability to Balance}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.026} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p26.pdf",
        "supp": "",
        "pdf_size": 216829,
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15788355806150237462&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "Dept. Advanced Robotics, Istituto Italiano di Tecnologia",
        "aff_domain": "ieee.org",
        "email": "ieee.org",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Dept. Advanced Robotics, Istituto Italiano di Tecnologia",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": ""
    },
    {
        "id": "43e0972ebc",
        "title": "Robust Trajectory Optimization Under Frictional Contact with Iterative Learning",
        "site": "https://www.roboticsproceedings.org/rss11/p14.html",
        "author": "Jingru Luo; Kris Hauser",
        "abstract": "Optimization is often difficult to apply to robots due to the presence of significant errors in the optimization model, which may cause constraints to be violated during execution on a real robot. This work presents a method to optimize trajectories with large modeling errors using a combination of robust optimization and parameter learning. In particular it considers the problem of computing a dynamically-feasible trajectory along a fixed path under frictional contact, where friction is uncertain and actuator effort is noisy. It introduces a robust time-scaling method that is able to accept confidence intervals on uncertain parameters, and uses a convex parameterization that allows dynamically-feasible motions under contact to be computed in seconds. This is combined with an iterative learning method that uses feedback from execution to learn confidence bounds on modeling parameters. Experiments on a manipulator performing a ``waiter'' task, on which an object is moved on a carried tray as quickly as possible, demonstrate this method can compensate for modeling uncertainties within a handful of iterations.",
        "bibtex": "@INPROCEEDINGS{Luo-RSS-15, \r\n    AUTHOR    = {Jingru Luo AND Kris Hauser}, \r\n    TITLE     = {Robust Trajectory Optimization Under Frictional Contact with Iterative Learning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.014} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p14.pdf",
        "supp": "",
        "pdf_size": 1594527,
        "gs_citation": 67,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3928396628665134251&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 15,
        "aff": "School of Informatics and Computing, Indiana University Bloomington; Department of Electrical and Computer Engineering+Department of Mechanical Engineering and Materials Science, Duke University",
        "aff_domain": "indiana.edu;duke.edu",
        "email": "indiana.edu;duke.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1+2",
        "aff_unique_norm": "Indiana University Bloomington;Unknown Institution;Duke University",
        "aff_unique_dep": "School of Informatics and Computing;Department of Electrical and Computer Engineering;Department of Mechanical Engineering and Materials Science",
        "aff_unique_url": "https://www.iu.edu;;https://www.duke.edu",
        "aff_unique_abbr": "IU;;Duke",
        "aff_campus_unique_index": "0;",
        "aff_campus_unique": "Bloomington;",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "0fccabcff0",
        "title": "Robust Trajectory Optimization: A Cooperative Stochastic Game Theoretic Approach",
        "site": "https://www.roboticsproceedings.org/rss11/p29.html",
        "author": "Yunpeng Pan; Evangelos Theodorou; Kaivalya Bakshi",
        "abstract": "We present a novel trajectory optimization framework to address the issue of robustness, scalability and efficiency in optimal control and reinforcement learning. Based on prior work in Cooperative Stochastic Differential Game (CSDG) theory, our method performs local trajectory optimization using cooperative controllers. The resulting framework is called Cooperative Game-Differential Dynamic Programming (CG-DDP). Compared to related methods, CG-DDP exhibits improved performance in terms of robustness and efficiency. The proposed framework is also applied in a data-driven fashion for belief space trajectory optimization under learned dynamics. We present experiments showing that CG-DDP can be used for optimal control and reinforcement learning under external disturbances and internal model errors.",
        "bibtex": "@INPROCEEDINGS{Pan-RSS-15, \r\n    AUTHOR    = {Yunpeng Pan AND Evangelos Theodorou AND Kaivalya Bakshi}, \r\n    TITLE     = {Robust Trajectory Optimization: A Cooperative Stochastic Game Theoretic Approach}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.029} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p29.pdf",
        "supp": "",
        "pdf_size": 794615,
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9706047651034479896&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "School of Aerospace Engineering + Inst. for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia, USA; School of Aerospace Engineering, Georgia Institute of Technology, Atlanta, Georgia, USA; School of Aerospace Engineering + Inst. for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia, USA",
        "aff_domain": "gatech.edu;gatech.edu;ae.gatech.edu",
        "email": "gatech.edu;gatech.edu;ae.gatech.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;2;0+1",
        "aff_unique_norm": "School of Aerospace Engineering;Inst. for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia, USA;School of Aerospace Engineering, Georgia Institute of Technology, Atlanta, Georgia, USA",
        "aff_unique_dep": "Aerospace Engineering;;",
        "aff_unique_url": ";;",
        "aff_unique_abbr": ";;",
        "aff_campus_unique_index": ";",
        "aff_campus_unique": "",
        "aff_country_unique_index": ";",
        "aff_country_unique": ""
    },
    {
        "id": "f408b620c9",
        "title": "Shared Autonomy via Hindsight Optimization",
        "site": "https://www.roboticsproceedings.org/rss11/p32.html",
        "author": "Shervin Javdani; Siddhartha Srinivasa; Andrew Bagnell",
        "abstract": "In shared autonomy, user input and robot autonomy are combined to control a robot to achieve a goal. Often, the robot does not know a priori which goal the user wants to achieve, and must both predict the user's intended goal, and assist in achieving that goal. We formulate the problem of shared autonomy as a Partially Observable Markov Decision Process with uncertainty over the user's goal. We utilize maximum entropy inverse optimal control to estimate a distribution over the user's goal based on the history of inputs. Ideally, the robot assists the user by solving for an action which minimizes the expected cost-to-go for the (unknown) goal. As solving the POMDP to select the optimal action is intractable, we use hindsight optimization to approximate the solution. In a user study, we compare our method to a standard predict-then-blend approach. We find that our method enables users to accomplish tasks more quickly while utilizing less input. However, when asked to rate each system, users were mixed in their assessment, citing a tradeoff between maintaining control authority and accomplishing tasks quickly.",
        "bibtex": "@INPROCEEDINGS{Javdani-RSS-15, \r\n    AUTHOR    = {Shervin Javdani AND Siddhartha Srinivasa AND Andrew Bagnell}, \r\n    TITLE     = {Shared Autonomy via Hindsight Optimization}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.032} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p32.pdf",
        "supp": "",
        "pdf_size": 4615355,
        "gs_citation": 248,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2241260133092948699&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 22,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University",
        "aff_domain": "cs.cmu.edu;cs.cmu.edu;cs.cmu.edu",
        "email": "cs.cmu.edu;cs.cmu.edu;cs.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "d56ea89cb0",
        "title": "The dynamics of legged locomotion in heterogeneous terrain: universality in scattering and sensitivity to initial conditions",
        "site": "https://www.roboticsproceedings.org/rss11/p30.html",
        "author": "Feifei Qian; Daniel Goldman",
        "abstract": "Natural substrates are often composed of particulates of varying size, from fine sand to pebbles and boulders. Robot locomotion on such heterogeneous substrates is complicated in part due to large force and kinematic fluctuations introduced by heterogeneities. To systematically explore how heterogeneity affects locomotion, we study the movement of a hexapedal robot (15 cm, 150 g) in a trackway filled with ~1 mm sand, with a larger convex boulder of various shape and roughness embedded within. We investigate how the presence of the boulder affects the robot's trajectory. To do so we develop a fully-automated terrain creation system, the SCATTER (Systematic Creation of Arbitrary Terrain and Testing of Exploratory Robots), to control the initial conditions of the substrate, including sand compaction, boulder distribution, and substrate inclination. Analysis of the robot's trajectory indicates that the interaction with a boulder can be modeled as a scatterer with attractive and repulsive features. Depending on the contact position on the boulder, the robot will be scattered to different directions after the interaction. The trajectory of an individual interaction depends sensitively on the initial conditions, but remarkably this dependence of scattering angle upon initial contact location is universal over a wide range of boulder properties. For a larger heterogeneous field with multiple scatterers, the trajectory of the robot can be estimated using a superposition of the scattering angles from each scatterer. This scattering superposition can be applied to a variety of complex terrains, including heterogeneities of different geometry, orientation, and texture. Our results can aid in development of both deterministic and statistical descriptions of robot locomotion, control and path planning in complex terrain.",
        "bibtex": "@INPROCEEDINGS{Qian-RSS-15, \r\n    AUTHOR    = {Feifei Qian AND Daniel Goldman}, \r\n    TITLE     = {The dynamics of legged locomotion in heterogeneous terrain: universality in scattering and sensitivity to initial conditions}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.030} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p30.pdf",
        "supp": "",
        "pdf_size": 3820745,
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10701483504501500166&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Georgia Institute of Technology; Georgia Institute of Technology",
        "aff_domain": "; ",
        "email": "; ",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Georgia Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.gatech.edu",
        "aff_unique_abbr": "Georgia Tech",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "7949a7499c",
        "title": "Theoretical Limits of Speed and Resolution for Kinodynamic Planning in a Poisson Forest",
        "site": "https://www.roboticsproceedings.org/rss11/p05.html",
        "author": "Sanjiban Choudhury; Sebastian Scherer; Andrew Bagnell",
        "abstract": "The performance of a state lattice motion planning algorithm depends critically on the resolution of the lattice to ensure a balance between solution quality and computation time. There is currently no theoretical basis for selecting the resolution because of its dependence on the robot dynamics and the distribution of obstacles. In this paper, we examine the problem of motion planning on a resolution constrained lattice for a robot with non-linear dynamics operating in an environment with randomly generated disc shaped obstacles sampled from a homogeneous Poisson process. We present a unified framework for computing explicit solutions to two problems - i) the critical planning resolution which guarantees the existence of an infinite collision free trajectory in the search graph ii) the critical speed limit which guarantees infinite collision free motion. In contrast to techniques used by \\citet{karaman2012high}, we use a novel approach that maps the problem to parameters of directed asymmetric hexagonal lattice bond percolation. Since standard percolation theory offers no results for this lattice, we map the lattice to an infinite absorbing Markov chain and use results pertaining to its survival to obtain bounds on the parameters. As a result, we are able to derive theoretical expressions that relate the non-linear dynamics of a robot, the resolution of the search graph and the density of the Poisson process. We validate the theoretical bounds using Monte-Carlo simulations for single integrator and curvature constrained systems and are able to validate the previous results presented by Karaman and Frazolli independently using the novel connections introduced in this paper.",
        "bibtex": "@INPROCEEDINGS{Choudhury-RSS-15, \r\n    AUTHOR    = {Sanjiban Choudhury AND Sebastian Scherer AND Andrew Bagnell}, \r\n    TITLE     = {Theoretical Limits of Speed and Resolution for Kinodynamic Planning in a Poisson Forest}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.005} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p05.pdf",
        "supp": "",
        "pdf_size": 1244330,
        "gs_citation": 8,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=49884292072222839&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University",
        "aff_domain": "cmu.edu;cmu.edu;ri.cmu.edu",
        "email": "cmu.edu;cmu.edu;ri.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "9f43261caf",
        "title": "Three's company, or a crowd?: The effects of robot number and behavior on HRI in Japan and the USA",
        "site": "https://www.roboticsproceedings.org/rss11/p33.html",
        "author": "Marlena Fraune; Satoru Kawakami; Selma Sabanovic; Ravindra de Silva; Michio Okada",
        "abstract": "In everyday applications of robotics, people will likely interact with groups of robots. Most human-robot interaction (HRI) research to date, however, has studied humans interacting with individual robots. Initial research suggests that humans respond differently to individual robots and robots in groups, making responses to groups of robots critical to study. This paper presents a study performed in a public setting familiar to participants (university cafeterias) to examine how participants respond when robots, individually and in groups, enter their space. We examined participant survey and behavioral responses to different numbers of robots (Single or Group) with different behaviors (Social or Functional). Because robots will be used across cultures, we performed the study in Japan and the USA. Across cultures, we found that people interact more with robots in groups than single robots, yet report similar levels of liking for both; participants also rated social robots as more friendly and helpful than functional robots in general. They rated single social robots more positively than a group of social robots, but a group of functional robots more positively than single functional robots. Japanese participants reported liking the robots more than USA participants. This suggests that researchers and designers should be aware of how robot characteristics influence group effects.",
        "bibtex": "@INPROCEEDINGS{Fraune-RSS-15, \r\n    AUTHOR    = {Marlena Fraune AND Satoru Kawakami AND Selma Sabanovic AND Ravindra de Silva AND Michio Okada}, \r\n    TITLE     = {Three's company, or a crowd?: The effects of robot number and behavior on HRI in Japan and the USA}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.033} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p33.pdf",
        "supp": "",
        "pdf_size": 588381,
        "gs_citation": 59,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13869205990488699883&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Indiana University; Toyohashi University of Technology; Indiana University; Toyohashi University of Technology; Toyohashi University of Technology",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;1;1",
        "aff_unique_norm": "Indiana University;Toyohashi University of Technology",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.indiana.edu;https://www.tut.ac.jp",
        "aff_unique_abbr": "IU;TUT",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;1;0;1;1",
        "aff_country_unique": "United States;Japan"
    },
    {
        "id": "825dcd741a",
        "title": "Tracking Attracting Lagrangian Coherent Structures in Flows",
        "site": "https://www.roboticsproceedings.org/rss11/p21.html",
        "author": "Dhanushka Kularatne; Ani Hsieh",
        "abstract": "This paper presents a collaborative control strategy designed to enable a team of robots to track attracting Lagrangian coherent structures (LCS) and unstable manifolds in two-dimensional flows. Tracking LCS in dynamical systems is important for many applications such as planning energy optimal paths in the ocean and predicting various physical and biological processes in the ocean. Similar to existing approaches, the proposed strategy does not require global information about the dynamics of the surrounding flow, and is based on local sensing, prediction, and correction. Different from existing approaches, the proposed strategy has the ability to track attracting LCS and unstable manifolds in real time through direct computation of the local finite time Lyapunov exponent field. The collaborative control strategy is implemented on a team of robots and the theoretical guarantees of the tracking strategy is briefly discussed. We demonstrate the tracking strategy in simulation using static and time dependent flows and experimentally validate the strategy using a team of micro autonomous surface vehicles (mASVs) in an actual fluid environment.",
        "bibtex": "@INPROCEEDINGS{Kularatne-RSS-15, \r\n    AUTHOR    = {Dhanushka Kularatne AND Ani Hsieh}, \r\n    TITLE     = {Tracking Attracting Lagrangian Coherent Structures in Flows}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.021} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p21.pdf",
        "supp": "",
        "pdf_size": 4819601,
        "gs_citation": 11,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15776985588622701184&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "Drexel University, Philadelphia, Pennsylvania 19104; Drexel University, Philadelphia, Pennsylvania 19104",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Drexel University, Philadelphia, Pennsylvania 19104",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "192f80a9b7",
        "title": "Two-Stage Focused Inference for Resource-Constrained Collision-Free Navigation",
        "site": "https://www.roboticsproceedings.org/rss11/p04.html",
        "author": "Beipeng Mu; Ali-akbar Agha-mohammadi; Liam Paull; Matthew Graham; Jonathan How; John Leonard",
        "abstract": "Long-term operations of resource-constrained robots typically require hard decisions be made about which data to process and/or retain. The question then arises of how to choose which data is most useful to keep to achieve the task at hand. As spacial scale grows, the size of the map will grow without bound, and as temporal scale grows, the number of measurements will grow without bound. In this work, we present the first known approach to tackle both of these issues. The approach has two stages. First, a subset of the variables (focused variables) is selected that are most useful for a particular task. Second, a task-agnostic and principled method (focused inference) is proposed to select a subset of the measurements that maximizes the information over the focused variables. The approach is then applied to the specific task of robot navigation in an obstacle-laden environment. A landmark selection method is proposed to minimize the probability of collision and then select the set of measurements that best localizes those landmarks. It is shown that the two-stage approach outperforms both only selecting measurement and only selecting landmarks in terms of minimizing the probability of collision. The performance improvement is validated through detailed simulation and real experiments on a Pioneer robot.",
        "bibtex": "@INPROCEEDINGS{Mu-RSS-15, \r\n    AUTHOR    = {Beipeng Mu AND Ali-akbar Agha-mohammadi AND Liam Paull AND Matthew Graham AND Jonathan How AND John Leonard}, \r\n    TITLE     = {Two-Stage Focused Inference for Resource-Constrained Collision-Free Navigation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.004} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p04.pdf",
        "supp": "",
        "pdf_size": 2100716,
        "gs_citation": 34,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10137384816986552553&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": "Laboratory for Information and Decision Systems; Laboratory for Information and Decision Systems; Computer Science and Artificial Intelligence Laboratory; Laboratory for Information and Decision Systems; Laboratory for Information and Decision Systems; Computer Science and Artificial Intelligence Laboratory",
        "aff_domain": "mit.edu;mit.edu;mit.edu;mit.edu;mit.edu;mit.edu",
        "email": "mit.edu;mit.edu;mit.edu;mit.edu;mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "Laboratory for Information and Decision Systems",
        "aff_unique_url": "http://web.mit.edu/lids",
        "aff_unique_abbr": "LIDS",
        "aff_campus_unique_index": "0;0;0;0;0;0",
        "aff_campus_unique": "Cambridge",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "cfe14b3cf7",
        "title": "Voting for Voting in Online Point Cloud Object Detection",
        "site": "https://www.roboticsproceedings.org/rss11/p35.html",
        "author": "Dominic Zeng Wang; Ingmar Posner",
        "abstract": "This paper proposes an efficient and effective scheme to applying the sliding window approach popular in computer vision to 3D data. Specifically, the sparse nature of the problem is exploited via a voting scheme to enable a search through all putative object locations at any orientation. We prove that this voting scheme is mathematically equivalent to a convolution on a sparse feature grid and thus enables the processing, in full 3D, of any point cloud irrespective of the number of vantage points required to construct it. As such it is versatile enough to operate on data from popular 3D laser scanners such as a Velodyne as well as on 3D data obtained from increasingly popular push-broom configurations. Our approach is \"embarrassingly parallelisable\" and capable of processing a point cloud containing over 100K points at eight orientations in less than 0.5s. For the object classes car, pedestrian and bicyclist the resulting detector achieves best-in-class detection and timing performance relative to prior art on the KITTI dataset as well as compared to another existing 3D object detection approach.",
        "bibtex": "@INPROCEEDINGS{Wang-RSS-15, \r\n    AUTHOR    = {Dominic Zeng Wang AND Ingmar Posner}, \r\n    TITLE     = {Voting for Voting in Online Point Cloud Object Detection}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.035} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p35.pdf",
        "supp": "",
        "pdf_size": 1815469,
        "gs_citation": 479,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5059520817237420364&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": "Mobile Robotics Group, University of Oxford, UK; Mobile Robotics Group, University of Oxford, UK",
        "aff_domain": "robots.ox.ac.uk;robots.ox.ac.uk",
        "email": "robots.ox.ac.uk;robots.ox.ac.uk",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Oxford",
        "aff_unique_dep": "Mobile Robotics Group",
        "aff_unique_url": "https://www.ox.ac.uk",
        "aff_unique_abbr": "Oxford",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Oxford",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United Kingdom"
    },
    {
        "id": "cb2ce4c71a",
        "title": "rCRF: Recursive Belief Estimation over CRFs in RGB-D Activity Videos",
        "site": "https://www.roboticsproceedings.org/rss11/p24.html",
        "author": "Ozan Sener; Ashutosh Saxena",
        "abstract": "For assistive robots, anticipating the future actions of humans is an essential task. This requires modeling both the evolution of the activities over time and the rich relationships between humans and the objects. Since the future activities of humans are quite ambiguous, robots need to assess all the future possibilities in order to choose an appropriate action. Therefore, a successful anticipation algorithm needs to compute all plausible future activities and their corresponding probabilities. In this paper, we address the problem of efficiently computing beliefs over future human activities from RGB-D videos. We present a new recursive algorithm that we call Recursive Conditional Random Field (rCRF) which can compute an accurate belief over a temporal CRF model. We use the rich modeling power of CRFs and describe a computationally tractable inference algorithm based on Bayesian filtering and structured diversity. In our experiments, we show that incorporating belief, computed via our approach, significantly outperforms the state-of-the-art methods, both in terms of accuracy and computation time.",
        "bibtex": "@INPROCEEDINGS{Sener-RSS-15, \r\n    AUTHOR    = {Ozan Sener AND Ashutosh Saxena}, \r\n    TITLE     = {rCRF: Recursive Belief Estimation over CRFs in RGB-D Activity Videos}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2015}, \r\n    ADDRESS   = {Rome, Italy}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2015.XI.024} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss11/p24.pdf",
        "supp": "",
        "pdf_size": 6157361,
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2794140920949606730&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "School of Electrical & Computer Eng., Cornell University; Department of Computer Science, Cornell University",
        "aff_domain": "; ",
        "email": "; ",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1",
        "aff_unique_norm": "School of Electrical & Computer Eng., Cornell University;Cornell University",
        "aff_unique_dep": ";Department of Computer Science",
        "aff_unique_url": ";https://www.cornell.edu",
        "aff_unique_abbr": ";Cornell",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";United States"
    }
]