[
    {
        "id": "64fd397818",
        "title": "A Distributable and Computation-flexible Assignment Algorithm: From Local Task Swapping to Global Optimality",
        "site": "https://www.roboticsproceedings.org/rss08/p33.html",
        "author": "Lantao Liu; Dylan Shell",
        "abstract": "The assignment problem arises in multi-robot task-allocation scenarios. This paper introduces an algorithm for solving the assignment problem with several appealing features for online, distributed robotics applications. The method can start with any initial matching and incrementally improve the solution to reach the global optimum, producing valid assignments at any intermediate point. It is an any-time algorithm with an attractive performance profile (quality improves linearly) that, additionally, is comparatively straightforward to implement and is efficient both theoretically (O(n3 lg n) complexity is better than widely used solvers) and practically (comparable to the fastest implementation, for up to hundreds of robots/tasks). We present a centralized version and two decentralized variants that trade between computational and communication complexity.  Inspired by techniques that employ task exchanges between robots, our algorithm guarantees global optimality while using generalized swap primitives. The centralized version turns out to be a computational improvement and reinterpretation of the little-known method of Balinski-Gomory, proposed over half a century ago. Deeper understanding of the relationship between approximate swap-based techniques developed by roboticists and combinatorial optimization techniques, e.g., the Hungarian and Auction algorithms developed by operations researchers but used extensively by roboticists is uncovered.",
        "bibtex": "@INPROCEEDINGS{Liu-RSS-12, \r\n    AUTHOR    = {Lantao Liu AND Dylan Shell}, \r\n    TITLE     = {A Distributable and Computation-flexible Assignment Algorithm: From Local Task Swapping to Global Optimality}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.033} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p33.pdf",
        "supp": "",
        "pdf_size": 896859,
        "gs_citation": 34,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8208703831932969705&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Dept. of Computer Science and Engineering, Texas A&M University, College Station, USA; Dept. of Computer Science and Engineering, Texas A&M University, College Station, USA",
        "aff_domain": "cse.tamu.edu;cse.tamu.edu",
        "email": "cse.tamu.edu;cse.tamu.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Texas A&M University",
        "aff_unique_dep": "Department of Computer Science and Engineering",
        "aff_unique_url": "https://www.tamu.edu",
        "aff_unique_abbr": "TAMU",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "College Station",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "e952ef89f1",
        "title": "Affine trajectory deformation for redundant manipulators",
        "site": "https://www.roboticsproceedings.org/rss08/p42.html",
        "author": "Quang-Cuong Pham; Yoshihiko Nakamura",
        "abstract": "We propose a new method to smoothly deform trajectories of redundant manipulators in order to deal with unforeseen perturbations or to retarget captured motions into new environments. This method is based on the recently-developed affine deformation framework, which offers such advantages as closed-form solutions, one-step computation and no trajectory re-integration. Satisfaction of inequality constraints and dynamics optimization are seamlessly integrated into the framework. Applications of the method to interactive motion editing and motion transfer to humanoid robots are presented. Building on these developments, we offer a brief discussion of the concept of redundancy from the viewpoint of group theory.",
        "bibtex": "@INPROCEEDINGS{Pham-RSS-12, \r\n    AUTHOR    = {Quang-Cuong Pham AND Yoshihiko Nakamura}, \r\n    TITLE     = {Affine trajectory deformation for redundant manipulators}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.042} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p42.pdf",
        "supp": "",
        "pdf_size": 2715578,
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2540641819772144890&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": "Department of Mechano-Informatics, University of Tokyo, Japan; Department of Mechano-Informatics, University of Tokyo, Japan",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Tokyo",
        "aff_unique_dep": "Department of Mechano-Informatics",
        "aff_unique_url": "https://www.u-tokyo.ac.jp",
        "aff_unique_abbr": "UTokyo",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tokyo",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "84590015d0",
        "title": "An Object-Based Approach to Map Human Hand Synergies onto Robotic Hands with Dissimilar Kinematics",
        "site": "https://www.roboticsproceedings.org/rss08/p13.html",
        "author": "Guido Gioioso; Gionata Salvietti; Monica Malvezzi; Domenico Prattichizzo",
        "abstract": "Robotic hands differ in kinematics, dynamics, programming, control and sensing frameworks. Borrowing the terminology from software engineering, there is a need for middleware solutions to control the robotic hands independently from their specific structure, and focusing only on the task. Results in neuroscience concerning the synergistic organization of the human hand, are the theoretical foundation of this work, which focuses on the problem of mapping human hand synergies on robotic hands with dissimilar kinematic structures. The proposed mapping is based on the use of a virtual ellipsoid and it is mediated by a model of an anthropomorphic robotic hand able to capture the idea of synergies in human hands. This approach has been tested in two different robotic hands with an anthropomorphic and non-anthropomorphic kinematic structure.",
        "bibtex": "@INPROCEEDINGS{Gioioso-RSS-12, \r\n    AUTHOR    = {Guido Gioioso AND Gionata Salvietti AND Monica Malvezzi AND Domenico Prattichizzo}, \r\n    TITLE     = {An Object-Based Approach to Map Human Hand Synergies onto Robotic Hands with Dissimilar Kinematics}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.013} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p13.pdf",
        "supp": "",
        "pdf_size": 5790187,
        "gs_citation": 66,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16373088799338873667&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": "Department of Information Engineering, University of Siena; Department of Information Engineering, University of Siena; Department of Information Engineering, University of Siena; Department of Information Engineering, University of Siena + Italian Institute of Technology, Genova",
        "aff_domain": "dii.unisi.it;dii.unisi.it;dii.unisi.it;dii.unisi.it",
        "email": "dii.unisi.it;dii.unisi.it;dii.unisi.it;dii.unisi.it",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0+1",
        "aff_unique_norm": "University of Siena;Italian Institute of Technology",
        "aff_unique_dep": "Department of Information Engineering;",
        "aff_unique_url": "https://www.unisi.it;https://www.iit.it",
        "aff_unique_abbr": ";IIT",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Genova",
        "aff_country_unique_index": "0;0;0;0+0",
        "aff_country_unique": "Italy"
    },
    {
        "id": "c1a3a2474f",
        "title": "Asymptotically-optimal Path Planning on Manifolds",
        "site": "https://www.roboticsproceedings.org/rss08/p19.html",
        "author": "Leonard Jaillet; Josep Porta",
        "abstract": "This paper presents an approach for optimal path planning on implicitly-defined configuration spaces such as those arising, for instance, when manipulating an object with two arms or with a multifingered hand. In this kind of situations, the kinematic and contact constraints induce configuration spaces that are manifolds embedded in higher dimensional ambient spaces. Existing sampling-based approaches for path planning on manifolds focus on finding a feasible solution, but they do not optimize the quality of the path in any sense. Thus, the returned paths are usually not suitable for direct execution. Recently, RRT* and other similar asymptotically-optimal path planners have been proposed to generate high-quality paths in the case of globally parametrizable configuration spaces. In this paper, we propose to use higher dimensional continuation tools to extend RRT* to the case of implicitly-defined configuration spaces. Experiments in different problems validate the proposed approach.",
        "bibtex": "@INPROCEEDINGS{Jaillet-RSS-12, \r\n    AUTHOR    = {Leonard Jaillet AND Josep Porta}, \r\n    TITLE     = {Asymptotically-optimal Path Planning on Manifolds}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.019} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p19.pdf",
        "supp": "",
        "pdf_size": 1156021,
        "gs_citation": 53,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15274488410371658855&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 18,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "ff3d6ae97e",
        "title": "Colour-Consistent Structure-from-Motion Models using Underwater Imagery",
        "site": "https://www.roboticsproceedings.org/rss08/p05.html",
        "author": "Mitch Bryson; Matthew Johnson-Roberson; Oscar Pizarro; Stefan Williams",
        "abstract": "This paper presents an automated approach to correcting for colour inconsistency in underwater images collected from multiple perspectives during the construction of 3D structure-from-motion models. When capturing images underwater, the water column imposes several effects on images that are negligible in air such as colour-dependant attenuation and lighting patterns. These effects cause problems for human interpretation of images and also confound computer-based techniques for clustering and classification. Our approach exploits the 3D structure of the scene generated using structure-from-motion and photogrammetry techniques accounting for distance-based attenuation, vignetting and lighting pattern, and improves the consistency of photo-textured 3D models. Results are presented using imagery collected in two different underwater environments using an Autonomous Underwater Vehicle (AUV).",
        "bibtex": "@INPROCEEDINGS{Bryson-RSS-12, \r\n    AUTHOR    = {Mitch Bryson AND Matthew Johnson-Roberson AND Oscar Pizarro AND Stefan Williams}, \r\n    TITLE     = {Colour-Consistent Structure-from-Motion Models using Underwater Imagery}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.005} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p05.pdf",
        "supp": "",
        "pdf_size": 7019058,
        "gs_citation": 72,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7208292732010129453&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Australian Centre for Field Robotics, University of Sydney, Australia; Australian Centre for Field Robotics, University of Sydney, Australia; Australian Centre for Field Robotics, University of Sydney, Australia; Australian Centre for Field Robotics, University of Sydney, Australia",
        "aff_domain": "acfr.usyd.edu.au; ; ; ",
        "email": "acfr.usyd.edu.au; ; ; ",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "University of Sydney",
        "aff_unique_dep": "Australian Centre for Field Robotics",
        "aff_unique_url": "https://www.sydney.edu.au",
        "aff_unique_abbr": "USYD",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Sydney",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "882d6912f9",
        "title": "CompAct Arm\u0099: a Compliant Manipulator with Intrinsic Variable Physical Damping",
        "site": "https://www.roboticsproceedings.org/rss08/p29.html",
        "author": "Matteo Laffranchi; Nikos Tsagarakis; Darwin Caldwell",
        "abstract": "Humans exploit compliance in their biomechanical muscle-tendon-bone actuation structure to enable robust and safe interaction with the environment and utilize the elastic energy stored into muscles and tendons to obtain large energy efficiency or high output mechanical power peaks at their limbs. From the robotic/mechatronic point of view it is clear that emulating such a property in robotic actuation systems enables the achievement of performance which is not possible with classical stiff designs. In contrast to this, transmission compliance introduces some disadvantages as e.g. typically underdamped modes which reduce the achievable control bandwidth, stability margin and accuracy of the controlled system. These limitations are solved in mammalians by means of physical damping which clarifies why these biological systems are able of performing fast and smooth yet accurate motions in their limbs. This motivates this work which consists in the analysis and development of the CompAct\\texttrademark Arm, a novel compliant manipulator with intrinsic variable damping. This is probably the first robotic system to exhibit these diverse bio inspired characteristics. A motivation analysis is initially presented to show how the drawbacks introduced by compliance can be overcome by means of physical damping. The second part of the paper presents the mechatronic development of the robotic manipulator and preliminary experimental results.",
        "bibtex": "@INPROCEEDINGS{Laffranchi-RSS-12, \r\n    AUTHOR    = {Matteo Laffranchi AND Nikos Tsagarakis AND Darwin Caldwell}, \r\n    TITLE     = {CompAct Arm: a Compliant Manipulator with Intrinsic Variable Physical Damping }, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.029} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p29.pdf",
        "supp": "",
        "pdf_size": 8382704,
        "gs_citation": 31,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16210182562473490903&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "2d7eea72c3",
        "title": "Contextual Sequence Prediction with Application to Control Library Optimization",
        "site": "https://www.roboticsproceedings.org/rss08/p07.html",
        "author": "Debadeepta Dey; Tian Yu Liu; Martial Hebert; J. Andrew Bagnell",
        "abstract": "Sequence optimization, where the items in a list are ordered to maximize some reward has many applications such as web advertisement placement, search, and control libraries in robotics. Previous work in sequence optimization produces a static ordering that does not take any features of the item or context of the problem into account. In this work, we propose a general approach to order the items within the sequence based on the context (e.g., perceptual information, environment description, and goals). We take a simple, efficient, reduction-based approach where the choice and order of the items is established by repeatedly learning simple classifiers or regressors for each slot in the sequence. Our approach leverages recent work on submodular function maximization to provide a formal regret reduction from submodular sequence optimization to simple cost- sensitive prediction. We apply our contextual sequence prediction algorithm to optimize control libraries and demonstrate results on two robotics problems: manipulator trajectory prediction and mobile robot path planning.",
        "bibtex": "@INPROCEEDINGS{Dey-RSS-12, \r\n    AUTHOR    = {Debadeepta Dey AND Tian Yu Liu AND Martial Hebert AND J. Andrew Bagnell}, \r\n    TITLE     = {Contextual Sequence Prediction with Application to Control Library Optimization}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.007} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p07.pdf",
        "supp": "",
        "pdf_size": 1874345,
        "gs_citation": 53,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6113597418467460375&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "aff": "The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA; The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA; The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA; The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA",
        "aff_domain": "ri.cmu.edu;ri.cmu.edu;ri.cmu.edu;ri.cmu.edu",
        "email": "ri.cmu.edu;ri.cmu.edu;ri.cmu.edu;ri.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Pittsburgh",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "33c0cc0443",
        "title": "Development of a Testbed for Robotic Neuromuscular Controllers",
        "site": "https://www.roboticsproceedings.org/rss08/p49.html",
        "author": "Alexander Schepelmann; Hartmut Geyer; Michael Taylor",
        "abstract": "Current control approaches to robotic legged locomotion rely on centralized planning and tracking or motion pattern matching.  Central control is not available to robotic assistive devices that integrate with humans, and matching predefined patterns severely limits user dexterity.  By contrast, biological systems show substantial legged dexterity even when their central nervous system is severed from their spinal cord, indicating that neuromuscular feedback controls can be harnessed to encode stability, adaptability, and maneuverability into legged systems.  Here we present the initial steps to develop a robotic gait testbed that can implement and verify neuromuscular controls for robotic assistive devices.   The initial stage consists of an antagonistically actuated two segment leg with a floating compliant joint.   We detail its electromechanical design and low level, velocity-based torque control.  Additionally, we present experiments that test the leg's performance during human-like high fidelity motions.   The results show that the robot can track fast motions corresponding to 87",
        "bibtex": "@INPROCEEDINGS{Schepelmann-RSS-12, \r\n    AUTHOR    = {Alexander Schepelmann AND Hartmut Geyer AND Michael Taylor}, \r\n    TITLE     = {Development of a Testbed for Robotic Neuromuscular Controllers}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.049} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p49.pdf",
        "supp": "",
        "pdf_size": 5147659,
        "gs_citation": 32,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16298929921903653316&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University",
        "aff_domain": "cmu.edu;cmu.edu;cs.cmu.edu",
        "email": "cmu.edu;cmu.edu;cs.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "ca636d2660",
        "title": "Distributed Approximation of Joint Measurement Distributions Using Mixtures of Gaussians",
        "site": "https://www.roboticsproceedings.org/rss08/p22.html",
        "author": "Brian Julian; Stephen Smith; Daniela Rus",
        "abstract": "This paper presents an approach to distributively approximate the continuous probability distribution that describes the fusion of sensor measurements from many networked robots.  Each robot forms a weighted mixture of Gaussians to represent the measurement distribution of its local observation.  From this mixture set, the robot then draws samples of Gaussian elements to enable the use of a consensus-based algorithm that evolves the corresponding canonical parameters.  We show that the these evolved parameters describe a distribution that converges weakly to the joint of all the robots' unweighted mixture distributions, which itself converges weakly to the joint measurement distribution as more system resources are allocated. The major innovation of this approach is to combine sample-based sensor fusion with the notion of pre-convergence termination that results in scalable multi-robot system. We also derive bounds and convergence rates for the approximated joint measurement distribution, specifically the elements of its information vectors and the eigenvalues of its information matrices.  Most importantly, these performance guarantees do not come at a cost of complexity, since computational and communication complexity scales quadratically with respect to the Gaussian dimension, linearly with respect to the number of samples, and constant with respect to the number of robots. Results from numerical simulations for object localization are discussed using both Gaussians and mixtures of Gaussians.",
        "bibtex": "@INPROCEEDINGS{Julian-RSS-12, \r\n    AUTHOR    = {Brian Julian AND Stephen Smith AND Daniela Rus}, \r\n    TITLE     = {Distributed Approximation of Joint Measurement Distributions Using Mixtures of Gaussians}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.022} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p22.pdf",
        "supp": "",
        "pdf_size": 1574869,
        "gs_citation": 9,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16055031284886157627&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "f17c89dda5",
        "title": "E-Graphs: Bootstrapping Planning with Experience Graphs",
        "site": "https://www.roboticsproceedings.org/rss08/p43.html",
        "author": "Michael Phillips; Benjamin Cohen; Sachin Chitta; Maxim Likhachev",
        "abstract": "Human environments possess a significant amount of underlying structure that is under-utilized in motion planning and mobile manipulation. In domestic environments for example, walls and shelves are static, large objects such as furniture and kitchen appliances most of the time do not move and do not change, and objects are typically placed on a limited number of support surfaces such as tables, countertops or shelves. Motion planning for robots operating in such environments should be able to exploit this structure to improve its performance with each execution of a task. In this paper, we develop an online motion planning approach which learns from its planning episodes (experiences) a graph, an Experience Graph. This graph represents the underlying connectivity of the space required for the execution of the mundane tasks performed by the robot. The planner uses the Experience graph to accelerate its planning efforts whenever possible and gracefully degenerates to planning from scratch if no previous planning experiences can be reused. On the theoretical side, we show that planning with Experience graphs is complete and provides bounds on suboptimality with respect to the graph that represents the original planning problem. On the experimental side, we show in simulations and on a physical robot that our approach is particularly suitable for higher-dimensional motion planning tasks such as planning for single-arm manipulation and two armed mobile manipulation. The approach provides significant speedups over planning from scratch and generates predictable motion plans: motions planned from start positions that are close to each other, to goal positions that are also close to each other, are similar. In addition, we show how the Experience graphs can incorporate solutions from other approaches such as human demonstrations, providing an easy way of bootstrapping motion planning for complex tasks.",
        "bibtex": "@INPROCEEDINGS{Phillips-RSS-12, \r\n    AUTHOR    = {Michael Phillips AND Benjamin Cohen AND Sachin Chitta AND Maxim Likhachev}, \r\n    TITLE     = {E-Graphs: Bootstrapping Planning with Experience Graphs}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.043} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p43.pdf",
        "supp": "",
        "pdf_size": 850516,
        "gs_citation": 144,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=625751236154080180&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 19,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "3b08a5db52",
        "title": "Efficiently finding optimal winding-constrained loops in the plane",
        "site": "https://www.roboticsproceedings.org/rss08/p53.html",
        "author": "Paul Vernaza; Venkatraman Narayanan; Maxim Likhachev",
        "abstract": "We present a method to efficiently find winding- constrained loops in the plane that are optimal with respect to a minimum-cost objective and in the presence of obstacles. Our approach is similar to a typical graph-based search for an optimal path in the plane, but with an additional state variable that encodes information about path homotopy. Upon finding a loop, the value of this state corresponds to a line integral over the loop that indicates how many times it winds around each obstacle, enabling us to reduce the problem of finding paths satisfying winding constraints to that of searching for paths to suitable states in this augmented state space. We give an intuitive interpretation of the method based on fluid mechanics and show how this yields a way to perform the necessary calculations efficiently. Results are given in which we use our method to find optimal routes for autonomous surveillance and intruder containment.",
        "bibtex": "@INPROCEEDINGS{Vernaza-RSS-12, \r\n    AUTHOR    = {Paul Vernaza AND Venkatraman Narayanan AND Maxim Likhachev}, \r\n    TITLE     = {Efficiently finding optimal winding-constrained loops in the plane}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.053} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p53.pdf",
        "supp": "",
        "pdf_size": 6848103,
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9058215833503952013&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University",
        "aff_domain": "cs.cmu.edu;andrew.cmu.edu;cs.cmu.edu",
        "email": "cs.cmu.edu;andrew.cmu.edu;cs.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "bd07acba07",
        "title": "Estimating Human Dynamics On-the-fly Using Monocular Video For Pose Estimation",
        "site": "https://www.roboticsproceedings.org/rss08/p01.html",
        "author": "Priyanshu Agarwal; Suren Kumar; Julian Ryde; Jason Corso; Venkat Krovi",
        "abstract": "Human pose estimation using uncalibrated monocular visual inputs alone is a challenging problem for both the computer vision and robotics communities. From the robotics perspective, the challenge here is one of pose estimation of a multiply-articulated system of bodies using a single non-specialized environmental sensor (the camera) and thereby, creating low-order surrogate computational models for analysis and control.  In this work, we propose a technique for estimating the lower-limb dynamics of a human solely based on captured behavior using an uncalibrated monocular video camera. We leverage our previously developed framework for human pose estimation to (i) deduce the correct sequence of temporally coherent gap-filled pose estimates, (ii) estimate physical parameters, employing a dynamics model incorporating the anthropometric constraints, and (iii) filter out the optimized gap-filled pose estimates, using an Unscented Kalman Filter (UKF) with the estimated dynamically-equivalent human dynamics model. We test the framework on videos from the publicly available DARPA Mind's Eye Year 1 corpus [8]. The combined estimation and filtering framework not only results in more accurate physically plausible pose estimates, but also provides pose estimates for frames, where the original human pose estimation framework failed to provide one.",
        "bibtex": "@INPROCEEDINGS{Agarwal-RSS-12, \r\n    AUTHOR    = {Priyanshu Agarwal AND Suren Kumar AND Julian Ryde AND Jason Corso AND Venkat Krovi}, \r\n    TITLE     = {Estimating Human Dynamics On-the-fly Using Monocular Video For Pose Estimation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.001} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p01.pdf",
        "supp": "",
        "pdf_size": 9733398,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12858816940355184810&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "Mechanical and Aerospace Engineering Department†; Mechanical and Aerospace Engineering Department†; Department of Computer Science and Engineering‡; Department of Computer Science and Engineering‡; Mechanical and Aerospace Engineering Department†",
        "aff_domain": "buffalo.edu;buffalo.edu;buffalo.edu;buffalo.edu;buffalo.edu",
        "email": "buffalo.edu;buffalo.edu;buffalo.edu;buffalo.edu;buffalo.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;1;0",
        "aff_unique_norm": "Mechanical and Aerospace Engineering Department;Department of Computer Science and Engineering",
        "aff_unique_dep": "Mechanical and Aerospace Engineering;Computer Science and Engineering",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "5844017c1f",
        "title": "Experiments with Balancing on Irregular Terrains using the Dreamer Mobile Humanoid Robot",
        "site": "https://www.roboticsproceedings.org/rss08/p50.html",
        "author": "Luis Sentis; Josh Petersen; Roland Philippsen",
        "abstract": "We investigate controllers for mobile humanoid robots that maneuver in irregular terrains while performing accurate physical interactions with the environment and with human operators and test them on Dreamer, our new robot with a humanoid upper body (torso, arm, head) and a holonomic mobile base (triangularly arranged Omni wheels).  All its actuators are torque controlled, and the upper body provides redundant degrees of freedom.  We developed new dynamical models and created controllers that stabilize the robot in the presence of slope variations, while it compliantly interacts with humans. This paper considers underactuated free-body dynamics with contact constraints between the wheels and the terrain.  Moreover, Dreamer incorporates a biarticular mechanical transmission that we model as a force constraint.  Using these tools, we develop new compliant multiobjective skills and include self-motion stabilization for the highly redundant robot.",
        "bibtex": "@INPROCEEDINGS{Sentis-RSS-12, \r\n    AUTHOR    = {Luis Sentis AND Josh Petersen AND Roland Philippsen}, \r\n    TITLE     = {Experiments with Balancing on Irregular Terrains using the Dreamer Mobile Humanoid Robot}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.050} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p50.pdf",
        "supp": "",
        "pdf_size": 3712336,
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8603651424194380167&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 14,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "c5d279a2f6",
        "title": "Exploiting Passive Dynamics with Variable Stiffness Actuation in Robot Brachiation",
        "site": "https://www.roboticsproceedings.org/rss08/p39.html",
        "author": "Jun Nakanishi; Sethu Vijayakumar",
        "abstract": "This paper explores a passive control strategy with variable stiffness actuation for swing movements. We consider brachiation as an example of a highly dynamic task which requires exploitation of gravity in an efficient manner for successful task execution. First, we present our passive control strategy considering a pendulum with variable stiffness actuation. Then, we formulate the problem based an optimal control framework with temporal optimization in order to simultaneously find an appropriate stiffness profile and movement duration such that the resultant movement will be able to exploit the passive dynamics of the robot. Finally, numerical evaluations on a two-link brachiating robot with a variable stiffness actuator (VSA) model are provided to demonstrate the effectiveness of our approach under different task requirements, modelling errors and variations in the robot dynamics. In addition, we discuss the issue of task description in terms of the choice of cost function for successful task execution in optimal control.",
        "bibtex": "@INPROCEEDINGS{Nakanishi-RSS-12, \r\n    AUTHOR    = {Jun Nakanishi AND Sethu Vijayakumar}, \r\n    TITLE     = {Exploiting Passive Dynamics with Variable Stiffness Actuation in Robot Brachiation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.039} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p39.pdf",
        "supp": "",
        "pdf_size": 1541579,
        "gs_citation": 27,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5227645945248327893&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 14,
        "aff": "School of Informatics, University of Edinburgh, United Kingdom; School of Informatics, University of Edinburgh, United Kingdom",
        "aff_domain": "ed.ac.uk;ed.ac.uk",
        "email": "ed.ac.uk;ed.ac.uk",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Edinburgh",
        "aff_unique_dep": "School of Informatics",
        "aff_unique_url": "https://www.ed.ac.uk",
        "aff_unique_abbr": "Edinburgh",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Edinburgh",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United Kingdom"
    },
    {
        "id": "5af059ea35",
        "title": "Extrinsic Calibration from Per-Sensor Egomotion",
        "site": "https://www.roboticsproceedings.org/rss08/p04.html",
        "author": "Jonathan Brookshire; Seth Teller",
        "abstract": "\"We show how to recover the 6-DOF transform between two sensors mounted rigidly on a moving body, a form of extrinsic calibration useful for data fusion.  Our algorithm takes noisy, per-sensor incremental egomotion observations (i.e., incremental poses) as input and produces as output an estimate of the maximum-likelihood 6-DOF calibration relating the sensors and accompanying uncertainty.  The 6-DOF transformation sought can be represented effectively as a unit dual quaternion with 8 parameters subject to two constraints.  Noise is explicitly modeled (via the Lie algebra), yielding a constrained Fisher Information Matrix and Cramer-Rao Lower Bound.  The result is an analysis of motion degeneracy and a singularity-free optimization procedure.  The method requires only that the sensors travel together along a motion path that is non-degenerate.  It does not require that the sensors be synchronized, have overlapping fields of view, or observe common features.  It does not require construction of a global reference frame or solving SLAM.  In practice, from hand-held motion of RGB-D cameras, the method recovered inter-camera calibrations accurate to within 0.014 m and 0.022 radians (about 1 cm and 1 degree).\"",
        "bibtex": "@INPROCEEDINGS{Brookshire-RSS-12, \r\n    AUTHOR    = {Jonathan Brookshire AND Seth Teller}, \r\n    TITLE     = {Extrinsic Calibration from Per-Sensor Egomotion}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.004} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p04.pdf",
        "supp": "",
        "pdf_size": 1260779,
        "gs_citation": 83,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15093258976112798579&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": "MIT Computer Science and Artificial Intelligence Laboratory; MIT Computer Science and Artificial Intelligence Laboratory",
        "aff_domain": "csail.mit.edu;csail.mit.edu",
        "email": "csail.mit.edu;csail.mit.edu",
        "github": "",
        "project": "http://rvsn.csail.mit.edu/calibration3d",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "Computer Science and Artificial Intelligence Laboratory",
        "aff_unique_url": "https://www.csail.mit.edu",
        "aff_unique_abbr": "MIT CSAIL",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Cambridge",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "82293f048d",
        "title": "FFT-based Terrain Segmentation for Underwater Mapping",
        "site": "https://www.roboticsproceedings.org/rss08/p09.html",
        "author": "Bertrand Douillard; Navid Nourani-Vatani; Matthew Johnson-Roberson; Stefan Williams; Chris Roman; Oscar Pizarro; Ian  Vaughn; Gabrielle Inglis",
        "abstract": "A method for segmenting three-dimensional scans of underwater unstructured terrains is presented. Individual terrain scans are represented as an elevation map and analysed using fast Fourier transform (FFT). The segmentation of the ground surface is performed in the frequency domain. The lower frequency components represent the slower varying undulations of the underlying ground whose segmentation is similar to de-noising / low pass filtering. The cut-off frequency, below which ground frequency components are selected, is automatically determined using peak detection. The user can specify a maximum admissible size of objects (relative to the extent of the scan) to drive the automatic detection of the cut-off frequency. The points above the estimated ground surface are clustered via standard proximity clustering to form object segments. The approach is evaluated using ground truth hand labelled data. It is also evaluated for registration error when the segments are fed as features to an alignment algorithm. In both sets of experiments, the approach is compared to three other segmentation techniques. The results show that the approach is applicable to a range of different terrains and is able to generate features useful for navigation.",
        "bibtex": "@INPROCEEDINGS{Douillard-RSS-12, \r\n    AUTHOR    = {Bertrand Douillard AND Navid Nourani-Vatani AND Matthew Johnson-Roberson AND Stefan Williams AND Chris Roman AND Oscar Pizarro AND Ian  Vaughn AND Gabrielle Inglis}, \r\n    TITLE     = {FFT-based Terrain Segmentation for Underwater Mapping}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.009} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p09.pdf",
        "supp": "",
        "pdf_size": 5017685,
        "gs_citation": 9,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15130767562839880575&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": "The Australian Centre for Field Robotics, The University of Sydney, Australia; The Australian Centre for Field Robotics, The University of Sydney, Australia; The Australian Centre for Field Robotics, The University of Sydney, Australia; The Australian Centre for Field Robotics, The University of Sydney, Australia; Department of Ocean Engineering, The University of Rhode Island, USA; The Australian Centre for Field Robotics, The University of Sydney, Australia; Department of Ocean Engineering, The University of Rhode Island, USA; Department of Ocean Engineering, The University of Rhode Island, USA",
        "aff_domain": "acfr.usyd.edu.au; ; ; ; ; ; ; ",
        "email": "acfr.usyd.edu.au; ; ; ; ; ; ; ",
        "github": "",
        "project": "",
        "author_num": 8,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;1;0;1;1",
        "aff_unique_norm": "University of Sydney;University of Rhode Island",
        "aff_unique_dep": "Australian Centre for Field Robotics;Department of Ocean Engineering",
        "aff_unique_url": "https://www.sydney.edu.au;https://www.uri.edu",
        "aff_unique_abbr": "USYD;URI",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0;1;0;1;1",
        "aff_country_unique": "Australia;United States"
    },
    {
        "id": "8f244a3939",
        "title": "Failure anticipation in pursuit-evasion",
        "site": "https://www.roboticsproceedings.org/rss08/p46.html",
        "author": "Cyril Robin; Simon Lacroix",
        "abstract": "This paper presents a new approach for the pursuit of targets by a team of aerial and ground robots under realistic conditions. Mobile target pursuit is often a sub-task of more general scenarios, that call for environment exploration or monitoring activities. Since most of the time a single robot is sufficient to ensure the pursuit of a target, our approach aims at minimizing the team resources devoted to the pursuit: while ensuring the pursuit, a single pursuer evaluates its own potential failures on the basis of the situation defined by the target evolution and the environment structure. It thus assesses its need for team support. When support is necessary to keep the target in view, one or more additional robots are involved, according to a task allocation scheme. We provide mathematical bounds of the complexity of the approach, that ensure that the system has real-time performance. Simulations in a variety of realistic situations illustrate the efficiency of the proposed solution.",
        "bibtex": "@INPROCEEDINGS{Robin-RSS-12, \r\n    AUTHOR    = {Cyril Robin AND Simon Lacroix}, \r\n    TITLE     = {Failure anticipation in pursuit-evasion}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.046} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p46.pdf",
        "supp": "",
        "pdf_size": 1899583,
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12491757586104965056&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "CNRS, LAAS, 7 avenue du colonel Roche, F-31400 Toulouse, France + Univ de Toulouse, LAAS, F-31400 Toulouse, France; CNRS, LAAS, 7 avenue du colonel Roche, F-31400 Toulouse, France + Univ de Toulouse, LAAS, F-31400 Toulouse, France",
        "aff_domain": "laas.fr;laas.fr",
        "email": "laas.fr;laas.fr",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0+1",
        "aff_unique_norm": "CNRS;University of Toulouse",
        "aff_unique_dep": "LAAS;LAAS",
        "aff_unique_url": "https://www.cnrs.fr;https://www.univ-toulouse.fr",
        "aff_unique_abbr": "CNRS;UT",
        "aff_campus_unique_index": "1;1",
        "aff_campus_unique": ";Toulouse",
        "aff_country_unique_index": "0+0;0+0",
        "aff_country_unique": "France"
    },
    {
        "id": "66015db540",
        "title": "Fast Weighted Exponential Product Rules for Robust General Multi-Robot Data Fusion",
        "site": "https://www.roboticsproceedings.org/rss08/p02.html",
        "author": "Nisar Ahmed; Jonathan Schoenberg; Mark  Campbell",
        "abstract": "This paper considers the distributed data fusion (DDF) problem for general multi-agent robotic sensor networks in applications such as 3D mapping and target search. In particular, this paper focuses on the use of conservative fusion via the weighted exponential product (WEP) rule to combat inconsistencies that arise from double-counting common information between fusion agents. WEP fusion is ideal for fusing arbitrarily distributed estimates in ad-hoc communication network topologies, but current WEP rule variants have limited applicability to general multi-robot DDF. To address these issues, new information-theoretic WEP metrics are presented along with novel optimization algorithms for efficiently performing DDF within a recursive Bayesian estimation framework. While the proposed WEP fusion methods are generalizable to arbitrary probability distribution functions (pdfs), emphasis is placed here on widely-used Bernoulli and Gaussian mixture pdfs. Experimental results for multi-robot 3D mapping and target search applications show the effectiveness of the proposed methods.",
        "bibtex": "@INPROCEEDINGS{Ahmed-RSS-12, \r\n    AUTHOR    = {Nisar Ahmed AND Jonathan Schoenberg AND Mark  Campbell}, \r\n    TITLE     = {Fast Weighted Exponential Product Rules for Robust General Multi-Robot Data Fusion}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.002} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p02.pdf",
        "supp": "",
        "pdf_size": 9456277,
        "gs_citation": 32,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5465017777233994107&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": "Autonomous Systems Laboratory, Cornell University; Autonomous Systems Laboratory, Cornell University; Autonomous Systems Laboratory, Cornell University",
        "aff_domain": "cornell.edu;cornell.edu;cornell.edu",
        "email": "cornell.edu;cornell.edu;cornell.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Cornell University",
        "aff_unique_dep": "Autonomous Systems Laboratory",
        "aff_unique_url": "https://www.cornell.edu",
        "aff_unique_abbr": "Cornell",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "39f51478c5",
        "title": "Feature-Based Prediction of Trajectories for Socially Compliant Navigation",
        "site": "https://www.roboticsproceedings.org/rss08/p25.html",
        "author": "Markus Kuderer; Henrik Kretzschmar; Christoph Sprunk; Wolfram Burgard",
        "abstract": "Mobile robots that operate in a shared environment with humans need the ability to predict the movements of people to better plan their navigation actions. In this paper, we present a novel approach to predict the movements of pedestrians.  Our method reasons about entire trajectories that arise from interactions between people in navigation tasks.  It applies a maximum entropy learning method based on features that capture relevant aspects of the trajectories to determine the probability distribution that underlies human navigation behavior.  Hence, our approach can be used by mobile robots to predict forthcoming interactions with pedestrians and thus react in a socially compliant way.  In extensive experiments, we evaluate the capability and accuracy of our approach and demonstrate that our algorithm outperforms the popular social forces method, a state-of-the-art approach.  Furthermore, we show how our algorithm can be used for autonomous robot navigation using a real robot.",
        "bibtex": "@INPROCEEDINGS{Kuderer-RSS-12, \r\n    AUTHOR    = {Markus Kuderer AND Henrik Kretzschmar AND Christoph Sprunk AND Wolfram Burgard}, \r\n    TITLE     = {Feature-Based Prediction of Trajectories for Socially Compliant Navigation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.025} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p25.pdf",
        "supp": "",
        "pdf_size": 5089570,
        "gs_citation": 337,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11070148290638529934&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": "Department of Computer Science, University of Freiburg, Germany; Department of Computer Science, University of Freiburg, Germany; Department of Computer Science, University of Freiburg, Germany; Department of Computer Science, University of Freiburg, Germany",
        "aff_domain": "informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de",
        "email": "informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "University of Freiburg",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.uni-freiburg.de",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "db78897234",
        "title": "Formalizing Assistive Teleoperation",
        "site": "https://www.roboticsproceedings.org/rss08/p10.html",
        "author": "Anca Dragan; Siddhartha Srinivasa",
        "abstract": "In assistive teleoperation, the robot helps the user accomplish the desired task, making teleoperation easier and more seamless. Rather than simply executing the user's input, which is hindered by the inadequacies of the interface, the robot attempts to predict the user's intent, and assists in accomplishing it. In this work, we are interested in the scientific underpinnings of assistance: we formalize assistance under the general framework of policy blending, show how previous work methods instantiate this formalism, and provide a principled analysis of its main components: prediction of user intent and its arbitration with the user input. We define the prediction problem, with foundations in Inverse Reinforcement Learning, discuss simplifying assumptions that make it tractable, and test these on data from users teleoperating a robotic manipulator under various circumstances. We propose that arbitration should be moderated by the confidence in the prediction. Our user study analyzes the effect of the arbitration type, together with the prediction correctness and the task difficulty, on the performance of assistance and the preferences of users.",
        "bibtex": "@INPROCEEDINGS{Dragan-RSS-12, \r\n    AUTHOR    = {Anca Dragan AND Siddhartha Srinivasa}, \r\n    TITLE     = {Formalizing Assistive Teleoperation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.010} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p10.pdf",
        "supp": "",
        "pdf_size": 2848149,
        "gs_citation": 196,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12709925763314428864&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University",
        "aff_domain": "cs.cmu.edu;cs.cmu.edu",
        "email": "cs.cmu.edu;cs.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "622b670cc1",
        "title": "Guaranteeing High-Level Behaviors while Exploring Partially Known Maps",
        "site": "https://www.roboticsproceedings.org/rss08/p48.html",
        "author": "Shahar Sarid; Bingxin Xu; Hadas Kress-Gazit",
        "abstract": "This paper presents an approach for automatically synthesizing and re-synthesizing a hybrid controller that guarantees a robot will exhibit a user-defined high-level behavior while exploring a partially known workspace (map).  The approach includes dynamically adjusting the discrete abstraction of the workspace as new regions are detected by the robot's sensors, automatically rewriting the specification (formally defined using Linear Temporal Logic) and  re-synthesizing the control while preserving the robot state and its history of task completion.  The approach is implemented within the LTLMoP toolkit and is demonstrated using a Pioneer 3-DX in the lab.",
        "bibtex": "@INPROCEEDINGS{Sarid-RSS-12, \r\n    AUTHOR    = {Shahar Sarid AND Bingxin Xu AND Hadas Kress-Gazit}, \r\n    TITLE     = {Guaranteeing High-Level Behaviors while Exploring Partially Known Maps}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.048} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p48.pdf",
        "supp": "",
        "pdf_size": 1560901,
        "gs_citation": 38,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14112799065529938638&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": "Sibley School of Mechanical and Aerospace Engineering, Cornell University; Sibley School of Mechanical and Aerospace Engineering, Cornell University; Sibley School of Mechanical and Aerospace Engineering, Cornell University",
        "aff_domain": "cornell.edu;cornell.edu;cornell.edu",
        "email": "cornell.edu;cornell.edu;cornell.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Cornell University",
        "aff_unique_dep": "Sibley School of Mechanical and Aerospace Engineering",
        "aff_unique_url": "https://www.cornell.edu",
        "aff_unique_abbr": "Cornell",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Ithaca",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "eb39d234c0",
        "title": "Hierarchical Motion Planning in Topological Representations",
        "site": "https://www.roboticsproceedings.org/rss08/p59.html",
        "author": "Dmitry Zarubin; Vladimir Ivan; Marc Toussaint; Taku Komura; Sethu Vijayakumar",
        "abstract": "Motion can be described in alternative representations, including joint configuration or endeffector spaces, but also more complex topological representations that imply a change of Voronoi bias, metric or topology of the motion space. In particular certain types of robot interaction problems, e.g. wrapping around an object, can suitably be described by so-called writhe and interaction mesh representations. However, considering motion synthesis in only a topological space is insufficient since it does not account for additional tasks and constraints in other representations. In this paper we propose methods to combine and exploit different representations for motion synthesis and generalization of motion to novel situations. Our motion synthesis approach is formulated in the framework of optimal control as an approximate inference problem. This allows for a direct extension of the graphical model to incorporate multiple representations. Motion generalization is similarly performed by projecting motion from topological to joint configuration space. We demonstrate the benefit of our methods on problems where direct path finding in joint configuration space is extremely hard whereas local optimal control exploiting a representation with different topology can efficiently find optimal trajectories. In real world we demonstrate the use of topological representations for online motion generalization in dynamic environments.",
        "bibtex": "@INPROCEEDINGS{Zarubin-RSS-12, \r\n    AUTHOR    = {Dmitry Zarubin AND Vladimir Ivan AND Marc Toussaint AND Taku Komura AND Sethu Vijayakumar}, \r\n    TITLE     = {Hierarchical Motion Planning in Topological Representations}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.059} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p59.pdf",
        "supp": "",
        "pdf_size": 1019635,
        "gs_citation": 32,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10532103179414104160&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 21,
        "aff": "Department of Computer Science, FU Berlin, Germany; School of Informatics, University of Edinburgh, UK; Department of Computer Science, FU Berlin, Germany; School of Informatics, University of Edinburgh, UK; School of Informatics, University of Edinburgh, UK",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;1;1",
        "aff_unique_norm": "Freie Universität Berlin;University of Edinburgh",
        "aff_unique_dep": "Department of Computer Science;School of Informatics",
        "aff_unique_url": "https://www.fu-berlin.de;https://www.ed.ac.uk",
        "aff_unique_abbr": "FU Berlin;Edinburgh",
        "aff_campus_unique_index": "0;1;0;1;1",
        "aff_campus_unique": "Berlin;Edinburgh",
        "aff_country_unique_index": "0;1;0;1;1",
        "aff_country_unique": "Germany;United Kingdom"
    },
    {
        "id": "2cfa15143c",
        "title": "Hybrid Operational Space Control for Compliant Legged Systems",
        "site": "https://www.roboticsproceedings.org/rss08/p17.html",
        "author": "Marco Hutter; Mark Hoepflinger; Christian Gehring; Michael Bloesch; C. David Remy; Roland Siegwart",
        "abstract": "This paper introduces the concept of hybrid operational space control, a method that unifies kinematic tracking of individual joints with an inverse dynamics task space controller for the remainder of the robot. The proposed control strategy allows for a hierarchical task decomposition while simultaneously regulating the inner forces between the contact points.  At the same time it improves fast tracking for compliant systems by means of appropriate low level position controllers.  Introducing StarlETH, a compliant quadrupedal robot, the applicability of the controller and the hardware is demonstrated in real-time simulations and hardware experiments.  We perform static walking in challenging terrain and show how the controller can combine precise and fast position control with robust and compliant interaction with the environment.",
        "bibtex": "@INPROCEEDINGS{Hutter-RSS-12, \r\n    AUTHOR    = {Marco Hutter AND Mark Hoepflinger AND Christian Gehring AND Michael Bloesch AND C. David Remy AND Roland Siegwart}, \r\n    TITLE     = {Hybrid Operational Space Control for Compliant Legged Systems}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.017} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p17.pdf",
        "supp": "",
        "pdf_size": 2902364,
        "gs_citation": 77,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6278540966962930387&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 18,
        "aff": ";;;;;",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "84e1b826ce",
        "title": "Inference on networks of mixtures for robust robot mapping",
        "site": "https://www.roboticsproceedings.org/rss08/p40.html",
        "author": "Edwin Olson; Pratik Agarwal",
        "abstract": "The central challenge in robotic mapping is obtaining reliable data associations (or ``loop closures''): state-of-the-art inference algorithms can fail catastrophically if even one erroneous loop closure is incorporated into the map. Consequently, much work has been done to push error rates closer to zero. However, a long-lived or multi-robot system will still encounter errors, leading to system failure.  We propose a fundamentally different approach: allow richer error models that allow the probability of a failure to be explicitly modeled. In other words, we optimize the map while simultaneously determining which loop closures are correct from within a single integrated Bayesian framework. Unlike earlier multiple-hypothesis approaches, our approach avoids exponential memory complexity and is fast enough for real-time performance.  We show that the proposed method not only allows loop closing errors to be automatically identified, but also that in extreme cases, the ``front-end'' loop-validation systems can be unnecessary. We demonstrate our system both on standard benchmarks and on the real-world datasets that motivated this work.",
        "bibtex": "@INPROCEEDINGS{Olson-RSS-12, \r\n    AUTHOR    = {Edwin Olson AND Pratik Agarwal}, \r\n    TITLE     = {Inference on networks of mixtures for robust robot mapping}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.040} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p40.pdf",
        "supp": "",
        "pdf_size": 3074219,
        "gs_citation": 348,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=661224392318639401&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 23,
        "aff": "Computer Science and Engineering, University of Michigan; Computer Science and Engineering, University of Michigan",
        "aff_domain": "umich.edu;umich.edu",
        "email": "umich.edu;umich.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Michigan",
        "aff_unique_dep": "Computer Science and Engineering",
        "aff_unique_url": "https://www.umich.edu",
        "aff_unique_abbr": "UM",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Ann Arbor",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "68814b63ce",
        "title": "M-Width: Stability and Accuracy of Haptic Rendering of Virtual Mass",
        "site": "https://www.roboticsproceedings.org/rss08/p06.html",
        "author": "Nick Colonnese; Allison Okamura",
        "abstract": "\"In many physical human-robot interaction scenarios, such as haptic virtual environments for training and rehabilitation, it is desirable to carefully control the apparent inertia of a robot. Inertia compensation can be used to mitigate forces felt by the user during free-space motion, and rendering of additional inertia is desired for particular rehabilitation and training procedures. Many factors influence the stability and accuracy of rendering for haptic display of a pure mass, including device mechanical properties, sample rate, control structure, and human behavior. Inspired by the \"\"Z-Width\"\" approach to haptic device stability and performance analysis, we introduce \"\"M-width\"\", which we define as the dynamic range of virtual masses renderable in a stable manner. We identify the important parameters for system stability, find stability boundaries, and describe the expected accuracy of the haptic rendering for a canonical haptic system. These results serve as a design tool for designing haptic environments implementing mass, establish limits of performance, and lay the groundwork for new controllers to improve mass rendering.\"",
        "bibtex": "@INPROCEEDINGS{Colonnese-RSS-12, \r\n    AUTHOR    = {Nick Colonnese AND Allison Okamura}, \r\n    TITLE     = {M-Width: Stability and Accuracy of Haptic Rendering of Virtual Mass}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.006} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p06.pdf",
        "supp": "",
        "pdf_size": 767917,
        "gs_citation": 28,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18273814929320216024&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": "Mechanical Engineering, Stanford University; Mechanical Engineering, Stanford University",
        "aff_domain": "stanford.edu;stanford.edu",
        "email": "stanford.edu;stanford.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Stanford University",
        "aff_unique_dep": "Mechanical Engineering",
        "aff_unique_url": "https://www.stanford.edu",
        "aff_unique_abbr": "Stanford",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Stanford",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "c14c7fc7d4",
        "title": "Minimal Coordinate Formulation of Contact Dynamics in Operational Space",
        "site": "https://www.roboticsproceedings.org/rss08/p20.html",
        "author": "Abhinandan Jain; Cory Crean; Calvin Kuo; Hubertus Von Bremen; Steven Myint",
        "abstract": "In recent years,   complementarity techniques have been developed for modeling non-smooth   contact and collision dynamics   problems for multi-link robotic systems.    In this approach, a linear complementarity problem     (LCP) is set up using 6n non-minimal coordinates for a   system with n links together with all the unilateral   constraints and   inter-link bilateral  constraints on the system. In this paper, we use operational   space dynamics to develop a   complementarity formulation for contact and collision dynamics that   uses  minimal coordinates. The use of   such non-redundant coordinates results in much smaller size LCP   problems and the automatic   enforcement of the inter-link bilateral constraints. Furthermore, we   exploit operational space  low-order   algorithms to overcome some of the  computational bottlenecks in using minimal   coordinates.",
        "bibtex": "@INPROCEEDINGS{Jain-RSS-12, \r\n    AUTHOR    = {Abhinandan Jain AND Cory Crean AND Calvin Kuo AND Hubertus Von Bremen AND Steven Myint}, \r\n    TITLE     = {Minimal Coordinate Formulation of Contact Dynamics in Operational Space}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.020} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p20.pdf",
        "supp": "",
        "pdf_size": 436713,
        "gs_citation": 12,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8879613561376039557&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": "Jet Propulsion Laboratory, California Institute of Technology; Jet Propulsion Laboratory, California Institute of Technology; Jet Propulsion Laboratory, California Institute of Technology; Jet Propulsion Laboratory, California Institute of Technology; California State Polytechnic University",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;1",
        "aff_unique_norm": "California Institute of Technology;California State Polytechnic University",
        "aff_unique_dep": "Jet Propulsion Laboratory;",
        "aff_unique_url": "https://www.caltech.edu;https://www.cpp.edu",
        "aff_unique_abbr": "Caltech;CPP",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Pasadena;",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "f65bb289d0",
        "title": "Modeling and Prediction of Pedestrian Behavior based on the Sub-goal Concept",
        "site": "https://www.roboticsproceedings.org/rss08/p18.html",
        "author": "Tetsushi Ikeda; Yoshihiro Chigodo; Daniel Rea; Francesco Zanlungo; Masahiro Shiomi; Takayuki Kanda",
        "abstract": "This study addresses a method to predict pedestrians' long term behavior in order to enable a robot to provide them services. In order to do that we want to be able to predict their final goal and the trajectory they will follow to reach it. We attain this task borrowing from human science studies the concept of sub-goals, defined as points and landmarks of the environment towards which pedestrians walk or where they take directional choices before reaching the final destination. We retrieve the position of these sub-goals from the analysis of a large set of pedestrian trajectories in a shopping mall, and model their global behavior through transition probabilities between sub-goals. The method allows us to predict the future position of pedestrians on the basis of the observation of their trajectory up to the moment.",
        "bibtex": "@INPROCEEDINGS{Ikeda-RSS-12, \r\n    AUTHOR    = {Tetsushi Ikeda AND Yoshihiro Chigodo AND Daniel Rea AND Francesco Zanlungo AND Masahiro Shiomi AND Takayuki Kanda}, \r\n    TITLE     = {Modeling and Prediction of Pedestrian Behavior based on the Sub-goal Concept}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.018} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p18.pdf",
        "supp": "",
        "pdf_size": 2084250,
        "gs_citation": 97,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=266687348607550344&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 16,
        "aff": "Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan; Intelligent Robotics and Communication Laboratories, ATR, Kyoto, Japan",
        "aff_domain": "atr.jp; ; ; ; ; ",
        "email": "atr.jp; ; ; ; ; ",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0;0",
        "aff_unique_norm": "ATR",
        "aff_unique_dep": "Intelligent Robotics and Communication Laboratories",
        "aff_unique_url": "https://www.atr.jp",
        "aff_unique_abbr": "ATR",
        "aff_campus_unique_index": "0;0;0;0;0;0",
        "aff_campus_unique": "Kyoto",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "Japan"
    },
    {
        "id": "475fc6e559",
        "title": "Multi-stage micro rockets for robotic insects",
        "site": "https://www.roboticsproceedings.org/rss08/p24.html",
        "author": "Mirko Kovac; Maria Bendana; Rohit Krishnan; Jessica Burton; Michael Smith; Robert Wood",
        "abstract": "One of the main challenges for sustained flight of current aerial micro robots is the low energy density available from common power sources. In this paper we propose solid rocket fuel powered micro thrusters as a high energy density actuation method for aerial micro robots. In a multi stage configuration these thrusters can be used for intermittent flight which can decrease the energetic cost of locomotion. In particular we focus on the fabrication method and characterization of multi-stage micro thrusters with a diameter of 3mm and 6.4mm. We demonstrate a sustained and repeatable thrust force of up to 35mN for a duration of up to 42s and a multi-stage designs with a time delay of up to 4.7s between the propulsion phases. Furthermore, we present a take-off  trajectory of a 10cm rocket glider with an integrated micro thruster as propulsion mechanism showing that the technologies developed can be used to successfully power micro robots in flight. Future work will focus on control and flight dynamics of micro thruster powered gliders. Wider applications of similar thrusters can include other robotic applications where low weight and high force is important such as for jumping or running robots.",
        "bibtex": "@INPROCEEDINGS{Kovac-RSS-12, \r\n    AUTHOR    = {Mirko Kovac AND Maria Bendana AND Rohit Krishnan AND Jessica Burton AND Michael Smith AND Robert Wood}, \r\n    TITLE     = {Multi-stage micro rockets for robotic insects}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.024} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p24.pdf",
        "supp": "",
        "pdf_size": 2705728,
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9166663951396712676&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 14,
        "aff": "Harvard University; Harvard University; Harvard University; Harvard University; Harvard University; Harvard University",
        "aff_domain": "wyss.harvard.edu; ; ; ; ;eecs.harvard.edu",
        "email": "wyss.harvard.edu; ; ; ; ;eecs.harvard.edu",
        "github": "",
        "project": "http://micro.seas.harvard.edu",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0;0",
        "aff_unique_norm": "Harvard University",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.harvard.edu",
        "aff_unique_abbr": "Harvard",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "ed7be9e43b",
        "title": "Nonparametric Bayesian Models for Unsupervised Scene Analysis and Reconstruction",
        "site": "https://www.roboticsproceedings.org/rss08/p21.html",
        "author": "Dominik Joho; Gian Diego Tipaldi; Nikolas Engelhard; Cyrill Stachniss; Wolfram Burgard",
        "abstract": "Robots operating in domestic environments need to deal with a variety of different objects. Often, these objects are neither placed randomly, nor independently of each other. For example, objects on a breakfast table such as plates, knives, or bowls typically occur in recurrent configurations. In this paper, we propose a novel hierarchical generative model to reason about latent object constellations in a scene. The proposed model is a combination of Dirichlet processes and beta processes, which allow for a probabilistic treatment of the unknown dimensionality of the parameter space. We show how the model can be employed to address a set of different tasks in scene understanding ranging from unsupervised scene segmentation to completion of a partially specified scene. We describe how sampling in this model can be done using Markov chain Monte Carlo (MCMC) techniques and present an experimental evaluation with simulated as well as real-world data obtained with a Kinect camera.",
        "bibtex": "@INPROCEEDINGS{Joho-RSS-12, \r\n    AUTHOR    = {Dominik Joho AND Gian Diego Tipaldi AND Nikolas Engelhard AND Cyrill Stachniss AND Wolfram Burgard}, \r\n    TITLE     = {Nonparametric Bayesian Models for Unsupervised Scene Analysis and Reconstruction}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.021} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p21.pdf",
        "supp": "",
        "pdf_size": 1868938,
        "gs_citation": 24,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4571179902687093518&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 18,
        "aff": "Department of Computer Science, University of Freiburg, Germany; Department of Computer Science, University of Freiburg, Germany; Department of Computer Science, University of Freiburg, Germany; Department of Computer Science, University of Freiburg, Germany; Department of Computer Science, University of Freiburg, Germany",
        "aff_domain": "informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de",
        "email": "informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de;informatik.uni-freiburg.de",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "University of Freiburg",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.uni-freiburg.de",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "e87248841e",
        "title": "On Stochastic Optimal Control and Reinforcement Learning by Approximate Inference",
        "site": "https://www.roboticsproceedings.org/rss08/p45.html",
        "author": "Konrad Rawlik; Marc Toussaint; Sethu Vijayakumar",
        "abstract": "We present a reformulation of the stochastic optimal control problem in terms of $",
        "bibtex": "@INPROCEEDINGS{Rawlik-RSS-12, \r\n    AUTHOR    = {Konrad Rawlik AND Marc Toussaint AND Sethu Vijayakumar}, \r\n    TITLE     = {On Stochastic Optimal Control and Reinforcement Learning by Approximate Inference}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.045} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p45.pdf",
        "supp": "",
        "pdf_size": 427660,
        "gs_citation": 391,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8586349755850943031&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 20,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "18e4688756",
        "title": "On the Structure of Nonlinearities in Pose Graph SLAM",
        "site": "https://www.roboticsproceedings.org/rss08/p54.html",
        "author": "Heng Wang; Gibson Hu; Shoudong Huang; Gamini Dissanayake",
        "abstract": "\"Pose graphs have become an attractive representation for solving Simultaneous Localization and Mapping (SLAM) problems. In this paper, we analyze the structure of the nonlinearities in the 2D SLAM problem formulated as the optimizing of a pose graph. First, we prove that finding the optimal configuration of a very basic pose graph with 3 nodes (poses) and 3 edges (relative pose constraints)  with spherical covariance matrices, which can be formulated as a six dimensional least squares optimization problem, is equivalent to solving a one dimensional optimization problem. Then we show that the same result can be extended to the optimizing of a pose graph with \"\"two anchor nodes\"\" where every edge is connecting to one of the two anchor nodes. Furthermore, we prove that the global minimum of the resulting one dimensional optimization problem must belong to a certain interval and there are at most 3 minima in that interval. Thus the globally optimal pose configuration of the pose graph can be obtained very easily through the bisection method and closed-form formulas.\"",
        "bibtex": "@INPROCEEDINGS{Wang-RSS-12, \r\n    AUTHOR    = {Heng Wang AND Gibson Hu AND Shoudong Huang AND Gamini Dissanayake}, \r\n    TITLE     = {On the Structure of Nonlinearities in Pose Graph {SLAM}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.054} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p54.pdf",
        "supp": "",
        "pdf_size": 961022,
        "gs_citation": 48,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2274884625953628853&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "College of Electronic Information and Control Engineering, Beijing University of Technology, Beijing, China; Centre for Autonomous Systems, Faculty of Engineering and Information Technology, University of Technology, Sydney, Australia; Centre for Autonomous Systems, Faculty of Engineering and Information Technology, University of Technology, Sydney, Australia; Centre for Autonomous Systems, Faculty of Engineering and Information Technology, University of Technology, Sydney, Australia",
        "aff_domain": "126.com;uts.edu.au;uts.edu.au;uts.edu.au",
        "email": "126.com;uts.edu.au;uts.edu.au;uts.edu.au",
        "github": "",
        "project": "http://services.eng.uts.edu.au/~sdhuang/research.htm",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;1",
        "aff_unique_norm": "Beijing University of Technology;University of Technology Sydney",
        "aff_unique_dep": "College of Electronic Information and Control Engineering;Centre for Autonomous Systems",
        "aff_unique_url": "http://www.bjut.edu.cn;https://www.uts.edu.au",
        "aff_unique_abbr": "BJUT;UTS",
        "aff_campus_unique_index": "0;1;1;1",
        "aff_campus_unique": "Beijing;Sydney",
        "aff_country_unique_index": "0;1;1;1",
        "aff_country_unique": "China;Australia"
    },
    {
        "id": "042d4f7c68",
        "title": "Optimal Control with Weighted Average Costs and Temporal Logic Specifications",
        "site": "https://www.roboticsproceedings.org/rss08/p57.html",
        "author": "Eric Wolff; Ufuk Topcu; Richard Murray",
        "abstract": "We consider optimal control for a system subject to temporal logic constraints.  We minimize a weighted average cost function that generalizes the commonly used average cost function from discrete-time optimal control.  Dynamic programming algorithms are used to construct an optimal trajectory for the system that minimizes the cost function while satisfying a temporal logic specification.  Constructing an optimal trajectory takes only polynomially more time than constructing a feasible trajectory.  We demonstrate our methods on simulations of autonomous driving and robotic surveillance tasks.",
        "bibtex": "@INPROCEEDINGS{Wolff-RSS-12, \r\n    AUTHOR    = {Eric Wolff AND Ufuk Topcu AND Richard Murray}, \r\n    TITLE     = {Optimal Control with Weighted Average Costs and Temporal Logic Specifications}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.057} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p57.pdf",
        "supp": "",
        "pdf_size": 291339,
        "gs_citation": 55,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9516254241431800571&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 16,
        "aff": "Control and Dynamical Systems, California Institute of Technology; Control and Dynamical Systems, California Institute of Technology; Control and Dynamical Systems, California Institute of Technology",
        "aff_domain": "caltech.edu;cds.caltech.edu;cds.caltech.edu",
        "email": "caltech.edu;cds.caltech.edu;cds.caltech.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "California Institute of Technology",
        "aff_unique_dep": "Control and Dynamical Systems",
        "aff_unique_url": "https://www.caltech.edu",
        "aff_unique_abbr": "Caltech",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Pasadena",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "1722326f55",
        "title": "Optimization of Temporal Dynamics for Adaptive Human-Robot Interaction in Assembly Manufacturing",
        "site": "https://www.roboticsproceedings.org/rss08/p56.html",
        "author": "Ronald Wilcox; Stefanos Nikolaidis; Julie Shah",
        "abstract": "Human-robot collaboration presents an opportunity to improve the efficiency of manufacturing and assembly processes, particularly for aerospace manufacturing where tight integration and variability in the build process make physical isolation of robotic-only work challenging. In this paper, we develop a robotic scheduling and control capability that adapts to the changing preferences of a human co-worker or supervisor while providing strong guarantees for synchronization and timing of activities. This innovation is realized through dynamic execution of a flexible optimal scheduling policy that accommodates temporal disturbance. We describe the Adaptive Preferences Algorithm that computes the flexible scheduling policy and show empirically that execution is fast, robust, and adaptable to changing preferences for workflow. We achieve satisfactory computation times, on the order of seconds for moderately-sized problems, and demonstrate the capability for human-robot teaming using a small industrial robot.",
        "bibtex": "@INPROCEEDINGS{Wilcox-RSS-12, \r\n    AUTHOR    = {Ronald Wilcox AND Stefanos Nikolaidis AND Julie Shah}, \r\n    TITLE     = {Optimization of Temporal Dynamics for Adaptive Human-Robot Interaction in Assembly Manufacturing}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.056} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p56.pdf",
        "supp": "",
        "pdf_size": 2437091,
        "gs_citation": 179,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2886891097652373927&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 17,
        "aff": "Massachusetts Institute of Technology; Massachusetts Institute of Technology; Massachusetts Institute of Technology",
        "aff_domain": "mit.edu;mit.edu;csail.mit.edu",
        "email": "mit.edu;mit.edu;csail.mit.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "https://web.mit.edu",
        "aff_unique_abbr": "MIT",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "4ef08788d9",
        "title": "Optimization-Based Estimator Design for Vision-Aided Inertial Navigation",
        "site": "https://www.roboticsproceedings.org/rss08/p31.html",
        "author": "Mingyang Li; Anastasios Mourikis",
        "abstract": "This paper focuses on the problem of real-time pose tracking using visual and inertial sensors in systems with limited processing power. Our main contribution is a novel approach to the design of estimators for these systems, which optimally utilizes the available resources. Specifically, we design a hybrid estimator that integrates two algorithms with complementary computational characteristics, namely a sliding-window EKF and EKF-SLAM. To decide which algorithm is best suited to process each of the available features at runtime, we learn the distribution of the feature number and of the lengths of the feature tracks. We show that using this information, we can predict the expected computational cost of each feature-allocation policy, and formulate an objective function whose minimization determines the optimal way to process the feature data. Our results demonstrate that the hybrid algorithm outperforms each individual method (EKF-SLAM and sliding-window EKF) by a wide margin, and allows processing the sensor data at real-time speed on the processor of a mobile phone.",
        "bibtex": "@INPROCEEDINGS{Li-RSS-12, \r\n    AUTHOR    = {Mingyang Li AND Anastasios Mourikis}, \r\n    TITLE     = {Optimization-Based Estimator Design for Vision-Aided Inertial Navigation}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.031} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p31.pdf",
        "supp": "",
        "pdf_size": 727614,
        "gs_citation": 103,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7444615214079660369&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": "Dept. of Electrical Engineering, University of California, Riverside; Dept. of Electrical Engineering, University of California, Riverside",
        "aff_domain": "ee.ucr.edu;ee.ucr.edu",
        "email": "ee.ucr.edu;ee.ucr.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of California, Riverside",
        "aff_unique_dep": "Dept. of Electrical Engineering",
        "aff_unique_url": "https://www.ucr.edu",
        "aff_unique_abbr": "UCR",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Riverside",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "4f5d65b9ba",
        "title": "Parsing Indoor Scenes Using RGB-D Imagery",
        "site": "https://www.roboticsproceedings.org/rss08/p51.html",
        "author": "Camillo Taylor; Anthony Cowley",
        "abstract": "This paper presents an approach to parsing the Manhattan structure of an indoor scene from a single RGB-D frame. The problem of recovering the floor plan is recast as an optimal labeling problem which can be solved efficiently using Dynamic Programming.",
        "bibtex": "@INPROCEEDINGS{Taylor-RSS-12, \r\n    AUTHOR    = {Camillo Taylor AND Anthony Cowley}, \r\n    TITLE     = {Parsing Indoor Scenes Using RGB-D Imagery}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.051} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p51.pdf",
        "supp": "",
        "pdf_size": 3459093,
        "gs_citation": 87,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1646404488983921230&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "GRASP Laboratory, University of Pennsylvania; GRASP Laboratory, University of Pennsylvania",
        "aff_domain": "cis.upenn.edu;cis.upenn.edu",
        "email": "cis.upenn.edu;cis.upenn.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Pennsylvania",
        "aff_unique_dep": "GRASP Laboratory",
        "aff_unique_url": "https://www.upenn.edu",
        "aff_unique_abbr": "UPenn",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Philadelphia",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "50df0ad0bd",
        "title": "Physics-Based Grasp Planning Through Clutter",
        "site": "https://www.roboticsproceedings.org/rss08/p08.html",
        "author": "Mehmet Dogar; Kaijen Hsiao; Matei Ciocarlie; Siddhartha Srinivasa",
        "abstract": "We propose a planning method for grasping in cluttered environments, a method where the robot can make simultaneous contact with multiple objects. With this method, the robot reaches for and grasps the target while simultaneously contacting and moving aside objects to clear a desired path. We use a physics-based analysis of pushing to compute the motion of each object in the scene in response to a set of possible robot motions. Our method enables multiple robot-object interactions, interactions that can be pre-computed and cached. However, our method avoids object-object interactions to make the problem computationally tractable. Through tests on large sets of simulated scenes, we show that our planner produces more successful grasps in more complex scenes than versions that avoid any interaction with surrounding clutter. We validate our method on a real robot, a PR2, and show that it accurately predicts the outcome of a grasp. We also show that our approach, in conjunction with state-of-the-art object recognition tools, is applicable in real-life scenes that are highly cluttered and constrained.",
        "bibtex": "@INPROCEEDINGS{Dogar-RSS-12, \r\n    AUTHOR    = {Mehmet Dogar AND Kaijen Hsiao AND Matei Ciocarlie AND Siddhartha Srinivasa}, \r\n    TITLE     = {Physics-Based Grasp Planning Through Clutter}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.008} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p08.pdf",
        "supp": "",
        "pdf_size": 7881180,
        "gs_citation": 157,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14576254409824618646&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "91aeaf94c5",
        "title": "Practical Route Planning Under Delay Uncertainty: Stochastic Shortest Path Queries",
        "site": "https://www.roboticsproceedings.org/rss08/p32.html",
        "author": "Sejoon Lim; Christian Sommer; Evdokia Nikolova; Daniela Rus",
        "abstract": "We describe an algorithm for stochastic path planning and applications to route planning in the presence of traffic delays. We improve on the prior state of the art by designing, analyzing, implementing, and evaluating data structures that answer approximate stochastic shortest path queries.  For example, our data structure can be used to efficiently compute paths that maximize the probability of arriving at a destination before a given time deadline.    Our main theoretical result is an algorithm that, given a directed planar network with edge lengths characterized by expected travel time and variance, pre-computes a data structure in quasi-linear time such that stochastic approximate shortest-path queries can be answered in poly-logarithmic time (actual worst-case bounds depend on the probabilistic model).   Our main experimental results are two-fold: (i) we provide methods to extract travel-time distributions from a large set of heterogenous GPS traces and we build a stochastic model of an entire city, and (ii) we adapt our algorithms to work for real-world road networks, we provide an efficient implementation, and we evaluate the performance of our method for the model of the aforementioned city.",
        "bibtex": "@INPROCEEDINGS{Lim-RSS-12, \r\n    AUTHOR    = {Sejoon Lim AND Christian Sommer AND Evdokia Nikolova AND Daniela Rus}, \r\n    TITLE     = {Practical Route Planning Under Delay Uncertainty: Stochastic Shortest Path Queries}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.032} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p32.pdf",
        "supp": "",
        "pdf_size": 997492,
        "gs_citation": 56,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13002218615864073994&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": "Computer Science and Artificial Intelligence Lab, MIT; Computer Science and Artificial Intelligence Lab, MIT; Department of Computer Science and Engineering, Texas A&M University; Computer Science and Artificial Intelligence Lab, MIT",
        "aff_domain": "csail.mit.edu;csail.mit.edu;tamu.edu;csail.mit.edu",
        "email": "csail.mit.edu;csail.mit.edu;tamu.edu;csail.mit.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;0",
        "aff_unique_norm": "Massachusetts Institute of Technology;Texas A&M University",
        "aff_unique_dep": "Computer Science and Artificial Intelligence Lab;Department of Computer Science and Engineering",
        "aff_unique_url": "https://www.csail.mit.edu;https://www.tamu.edu",
        "aff_unique_abbr": "MIT;TAMU",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Cambridge;",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "18e9a6244d",
        "title": "Probabilistic Modeling of Human Movements for Intention Inference",
        "site": "https://www.roboticsproceedings.org/rss08/p55.html",
        "author": "Zhikun Wang; Marc Deisenroth; Heni Ben Amor; David Vogt; Bernhard Schölkopf; Jan Peters",
        "abstract": "Inference of human intention may be an essential step towards understanding human actions and is hence important for realizing efficient human-robot interaction. In this paper, we propose the Intention-Driven Dynamics Model (IDDM), a latent variable model for inferring unknown human intentions. We train the model based on observed human movements/actions. We introduce an efficient approximate inference algorithm to infer the human's intention from an ongoing movement.  We verify the feasibility of the IDDM in two scenarios, i.e., target inference in robot table tennis and action recognition for interactive humanoid robots. In both tasks, the IDDM achieves substantial improvements over state-of-the-art regression and classification.",
        "bibtex": "@INPROCEEDINGS{Wang-RSS-12, \r\n    AUTHOR    = {Zhikun Wang AND Marc Deisenroth AND Heni Ben Amor AND David Vogt AND Bernhard Scholkopf AND Jan Peters}, \r\n    TITLE     = {Probabilistic Modeling of Human Movements for Intention Inference}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.055} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p55.pdf",
        "supp": "",
        "pdf_size": 1916033,
        "gs_citation": 59,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5072897786651063137&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": "MPI for Intelligent Systems, Spemannstr. 38, 72076 Tübingen, Germany + TU Darmstadt, Hochschulstr. 10, 64289 Darmstadt, Germany; TU Darmstadt, Hochschulstr. 10, 64289 Darmstadt, Germany; TU Darmstadt, Hochschulstr. 10, 64289 Darmstadt, Germany; TU Freiberg, Bernhard-von-Cotta Str. 2, 09596 Freiberg, Germany; MPI for Intelligent Systems, Spemannstr. 38, 72076 Tübingen, Germany + TU Darmstadt, Hochschulstr. 10, 64289 Darmstadt, Germany; MPI for Intelligent Systems, Spemannstr. 38, 72076 Tübingen, Germany + TU Darmstadt, Hochschulstr. 10, 64289 Darmstadt, Germany",
        "aff_domain": "tuebingen.mpg.de;ias.tu-darmstadt.de;ias.tu-darmstadt.de; ;tuebingen.mpg.de;ias.tu-darmstadt.de",
        "email": "tuebingen.mpg.de;ias.tu-darmstadt.de;ias.tu-darmstadt.de; ;tuebingen.mpg.de;ias.tu-darmstadt.de",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;1;1;2;0+1;0+1",
        "aff_unique_norm": "Max Planck Institute for Intelligent Systems;Technische Universität Darmstadt;Technische Universität Bergakademie Freiberg",
        "aff_unique_dep": ";;",
        "aff_unique_url": "https://www.mpituebingen.mpg.de;https://www.tu-darmstadt.de;https://www.tu-freiberg.de",
        "aff_unique_abbr": "MPI-IS;TU Darmstadt;TU Freiberg",
        "aff_campus_unique_index": "0+1;1;1;2;0+1;0+1",
        "aff_campus_unique": "Tübingen;Darmstadt;Freiberg",
        "aff_country_unique_index": "0+0;0;0;0;0+0;0+0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "7ea78c86a4",
        "title": "Probabilistic Temporal Logic for Motion Planning with Resource Threshold Constraints",
        "site": "https://www.roboticsproceedings.org/rss08/p58.html",
        "author": "Chanyeol Yoo; Robert Fitch; Salah Sukkarieh",
        "abstract": "Temporal logic and model-checking are useful theoretical tools for specifying complex goals at the task level and formally verifying the performance of control policies. We are interested in tasks that involve constraints on real-valued energy resources. In particular, autonomous gliding aircraft gain energy in the form of altitude by exploiting wind currents and must maintain altitude within some range during motion planning. We propose an extension to probabilistic computation tree logic that expresses such real-valued resource threshold constraints, and present model-checking algorithms that evaluate a piecewise control policy with respect to a formal specification and hard or soft performance guarantees. We validate this approach through simulated examples of motion planning among obstacles for an autonomous thermal glider. Our results demonstrate probabilistic performance guarantees on the ability of the glider to complete its task, following a given piecewise control policy, without knowing the exact path of the glider in advance.",
        "bibtex": "@INPROCEEDINGS{Yoo-RSS-12, \r\n    AUTHOR    = {Chanyeol Yoo AND Robert Fitch AND Salah Sukkarieh}, \r\n    TITLE     = {Probabilistic Temporal Logic for Motion Planning with Resource Threshold Constraints}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.058} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p58.pdf",
        "supp": "",
        "pdf_size": 5034009,
        "gs_citation": 24,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7914572584848613324&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": "Australian Centre for Field Robotics (ACFR); Australian Centre for Field Robotics (ACFR); Australian Centre for Field Robotics (ACFR)",
        "aff_domain": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au",
        "email": "acfr.usyd.edu.au;acfr.usyd.edu.au;acfr.usyd.edu.au",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Australian Centre for Field Robotics",
        "aff_unique_dep": "Field Robotics",
        "aff_unique_url": "http://www.acfr.usyd.edu.au",
        "aff_unique_abbr": "ACFR",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "de1bcaf43a",
        "title": "Real-Time Inverse Dynamics Learning for Musculoskeletal Robots based on Echo State Gaussian Process Regression",
        "site": "https://www.roboticsproceedings.org/rss08/p15.html",
        "author": "Christoph Hartmann; Joschka Boedecker; Oliver Obst; Shuhei Ikemoto; Minoru Asada",
        "abstract": "\"A challenging topic in articulated robots is the control of redundantly many degrees of freedom with artificial muscles. Actuation with these devices is difficult to solve because of nonlinearities, delays and unknown parameters such as friction. Machine learning methods can be used to learn control of these systems, but are faced with the additional problem that the size of the search space prohibits full exploration in reasonable time. We propose a novel method that is able to learn control of redundant robot arms with artificial muscles online from scratch using only the position of the end effector, without using any joint positions, accelerations or an analytical model of the system or the environment. To learn in real time, we use the so called online \"\"goal babbling\"\" method to effectively reduce the search space, a recurrent neural network to represent the state of the robot arm, and novel online Gaussian processes for regression. With our approach, we achieve good performance on trajectory tracking tasks for the end effector of two very challenging systems: a simulated 6 DOF redundant arm with artificial muscles, and a 7 DOF robot arm with McKibben pneumatic artificial muscles. We also show that the combination of techniques we propose results in significantly improved performance over using the individual techniques alone.\"",
        "bibtex": "@INPROCEEDINGS{Hartmann-RSS-12, \r\n    AUTHOR    = {Christoph Hartmann AND Joschka Boedecker AND Oliver Obst AND Shuhei Ikemoto AND Minoru Asada}, \r\n    TITLE     = {Real-Time Inverse Dynamics Learning for Musculoskeletal Robots based on Echo State Gaussian Process Regression}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.015} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p15.pdf",
        "supp": "",
        "pdf_size": 1331817,
        "gs_citation": 37,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9714892933087475417&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": "Institute of Cognitive Science, University of Osnabrueck, 49069 Osnabrueck, Germany+Graduate School of Engineering, Osaka University, Suita 56 5-0871, Osaka, Japan; Graduate School of Engineering, Osaka University, Suita 56 5-0871, Osaka, Japan; CSIRO ICT Centre, PO Box 76, Epping NSW 1710, Australia+School of Information Technologies, The University of Sydney, NSW 2006, Australia; Graduate School of Information Science and Technology, Osaka University, Suita 565-0871, Osaka, Japan; Graduate School of Engineering, Osaka University, Suita 56 5-0871, Osaka, Japan",
        "aff_domain": "uos.de; ; ; ; ",
        "email": "uos.de; ; ; ; ",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;1;2+3;1;1",
        "aff_unique_norm": "University of Osnabrueck;Osaka University;CSIRO ICT Centre;University of Sydney",
        "aff_unique_dep": "Institute of Cognitive Science;Graduate School of Engineering;ICT Centre;School of Information Technologies",
        "aff_unique_url": "https://www.uni-osnabrueck.de;https://www.osaka-u.ac.jp;https://www.csiro.au;https://www.sydney.edu.au",
        "aff_unique_abbr": ";Osaka U;CSIRO;USYD",
        "aff_campus_unique_index": "0+1;1;3;1;1",
        "aff_campus_unique": "Osnabrueck;Suita;;Sydney",
        "aff_country_unique_index": "0+1;1;2+2;1;1",
        "aff_country_unique": "Germany;Japan;Australia"
    },
    {
        "id": "4e41044683",
        "title": "Recognition and Pose Estimation of Rigid Transparent Objects with a Kinect Sensor",
        "site": "https://www.roboticsproceedings.org/rss08/p35.html",
        "author": "Ilya Lysenkov; victor Eruhimov; Gary Bradski",
        "abstract": "Recognizing and determining the 6DOF pose of transparent objects is necessary in order for robots to manipulate such objects. However, it is a challenging problem for computer vision. We propose new algorithms for segmentation, pose estimation and recognition of transparent objects from a single RGB-D image from a Kinect sensor. Kinect's weakness in the perception of transparent objects is exploited in their segmentation. Following segmentation, edge fitting is used for recognition and pose estimation. A 3D model of the object is created automatically during training and it is required for pose estimation and recognition.  The algorithm is evaluated in different conditions of a domestic environment within the framework of a robotic grasping pipeline where it demonstrates high grasping success rates compared to the state-of-the-art results. The method doesn't deal with occlusions and overlapping transparent objects currently but it is robust against non-transparent clutter.",
        "bibtex": "@INPROCEEDINGS{Lysenkov-RSS-12, \r\n    AUTHOR    = {Ilya Lysenkov AND victor Eruhimov AND Gary Bradski}, \r\n    TITLE     = {Recognition and Pose Estimation of Rigid Transparent Objects with a Kinect Sensor }, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.035} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p35.pdf",
        "supp": "",
        "pdf_size": 5277806,
        "gs_citation": 126,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12702651655556689384&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "aff": "Itseez; Itseez; Willow Garage",
        "aff_domain": "itseez.com;itseez.com;industrial-perception.com",
        "email": "itseez.com;itseez.com;industrial-perception.com",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Itseez;Willow Garage",
        "aff_unique_dep": ";",
        "aff_unique_url": "http://itseez.com;http://willowgarage.com/",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;1",
        "aff_country_unique": "Russian Federation;United States"
    },
    {
        "id": "30a69500c9",
        "title": "Recognition, Prediction, and Planning for Assisted Teleoperation of Freeform Tasks",
        "site": "https://www.roboticsproceedings.org/rss08/p16.html",
        "author": "Kris Hauser",
        "abstract": "This paper presents a system for improving the intuitiveness and responsiveness of assisted robot teleoperation interfaces by combining intent prediction and motion planning.  Two technical contributions are described.  First, an intent predictor estimates the user's desired task, and accepts freeform tasks that include both discrete types and continuous parameters (e.g., desired target positions).  Second, a cooperative motion planner uses the task estimates to generate continuously updated robot trajectories by solving optimal control problems with time-varying objective functions.  The planner is designed to respond interactively to changes in the indicated task, avoid collisions in cluttered environments, and achieve high-quality motions using a hybrid of numerical and sample-based techniques.  The system is applied to the problem of controlling a 6D robot manipulator using 2D mouse input in the context of two tasks: static target reaching and dynamic trajectory tracking.  Simulations suggest that it enables the robot to reach static targets faster and to track trajectories more closely than comparable techniques.",
        "bibtex": "@INPROCEEDINGS{Hauser-RSS-12, \r\n    AUTHOR    = {Kris Hauser}, \r\n    TITLE     = {Recognition, Prediction, and Planning for Assisted Teleoperation of Freeform Tasks}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.016} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p16.pdf",
        "supp": "",
        "pdf_size": 1364262,
        "gs_citation": 137,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=729359437955867269&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 22,
        "aff": "School of Informatics and Computing, Indiana University at Bloomington",
        "aff_domain": "indiana.edu",
        "email": "indiana.edu",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Indiana University",
        "aff_unique_dep": "School of Informatics and Computing",
        "aff_unique_url": "https://www.indiana.edu",
        "aff_unique_abbr": "IU",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Bloomington",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "d5f1ed441b",
        "title": "Reducing Conservativeness in Safety Guarantees by Learning Disturbances Online: Iterated Guaranteed Safe Online Learning",
        "site": "https://www.roboticsproceedings.org/rss08/p11.html",
        "author": "Jeremy Gillula; Claire Tomlin",
        "abstract": "Reinforcement learning has proven itself to be a powerful technique in robotics, however it has not often been employed to learn a controller in a hardware-in-the-loop environment due to the fact that spurious training data could cause a robot to take an unsafe (and potentially catastrophic) action.  One approach to overcoming this limitation is known as Guaranteed Safe Online Learning via Reachability (GSOLR), in which the controller being learned is wrapped inside another controller based on reachability analysis that seeks to guarantee safety against worst-case disturbances.  This paper proposes a novel improvement to GSOLR which we call Iterated Guaranteed Safe Online Learning via Reachability (IGSOLR), in which the worst-case disturbances are modeled in a state-dependent manner (either parametrically or nonparametrically), this model is learned online, and the safe sets are periodically recomputed (in parallel with whatever machine learning is being run online to learn how to control the system).  As a result the safety of the system automatically becomes neither too liberal nor too conservative, depending only on the actual system behavior.  This allows the machine learning algorithm running in parallel the widest possible latitude in performing its task while still guaranteeing system safety.  In addition to explaining IGSOLR, we show how it was used in a real-world example, namely that of safely learning an altitude controller for a quadrotor helicopter.  The resulting controller, which was learned via hardware-in-the-loop reinforcement learning, out-performs our original hand-tuned controller while still maintaining safety.  To our knowledge, this is the first example in the robotics literature of an algorithm in which worst-case disturbances are learned online in order to guarantee system safety.",
        "bibtex": "@INPROCEEDINGS{Gillula-RSS-12, \r\n    AUTHOR    = {Jeremy Gillula AND Claire Tomlin}, \r\n    TITLE     = {Reducing Conservativeness in Safety Guarantees by Learning Disturbances Online: Iterated Guaranteed Safe Online Learning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.011} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p11.pdf",
        "supp": "",
        "pdf_size": 1182576,
        "gs_citation": 45,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=747966396574332091&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": "Computer Science Dept., Stanford University; Electrical Engineering and Computer Sciences Dept., UC Berkeley",
        "aff_domain": "cs.stanford.edu;eecs.berkeley.edu",
        "email": "cs.stanford.edu;eecs.berkeley.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1",
        "aff_unique_norm": "Stanford University;University of California, Berkeley",
        "aff_unique_dep": "Computer Science Dept.;Electrical Engineering and Computer Sciences",
        "aff_unique_url": "https://www.stanford.edu;https://www.berkeley.edu",
        "aff_unique_abbr": "Stanford;UC Berkeley",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Stanford;Berkeley",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "22b8738632",
        "title": "Rigidity Maintenance Control for Multi-Robot Systems",
        "site": "https://www.roboticsproceedings.org/rss08/p60.html",
        "author": "Daniel Zelazo; Antonio Franchi; Frank Allgüwer; Heinrich Bülthoff; Paolo Robuffo Giordano",
        "abstract": "Rigidity of formations in multi-robot systems is important for formation control, localization, and sensor fusion. This work proposes a rigidity maintenance gradient controller for a multi-agent robot team. To develop such a controller, we first provide an alternative characterization of the rigidity matrix and use that to introduce the novel concept of the rigidity eigenvalue. We provide a necessary and sufficient condition relating the positivity of the rigidity eigenvalue to the rigidity of the formation. The rigidity maintenance controller is based on the gradient of the rigidity eigenvalue with respect to each robot position.  This gradient has a naturally distributed structure, and is thus amenable to a distributed implementation. Additional requirements such as obstacle and inter-agent collision avoidance, as well as typical constraints such as limited sensing/communication ranges and line-of-sight occlusions, are also explicitly considered.  Finally, we present a simulation with a group of seven quadrotor UAVs to demonstrate and validate the theoretical results.",
        "bibtex": "@INPROCEEDINGS{Zelazo-RSS-12, \r\n    AUTHOR    = {Daniel Zelazo AND Antonio Franchi AND Frank Allgower AND Heinrich Bulthoff AND Paolo Robuffo Giordano}, \r\n    TITLE     = {Rigidity Maintenance Control for Multi-Robot Systems}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.060} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p60.pdf",
        "supp": "",
        "pdf_size": 2580048,
        "gs_citation": 90,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10954337467683382033&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 24,
        "aff": "Institute for Systems Theory and Automatic Control, University of Stuttgart, Germany; Max Planck Institute for Biological Cybernetics, Tubingen, Germany; Institute for Systems Theory and Automatic Control, University of Stuttgart, Germany; Max Planck Institute for Biological Cybernetics, Tubingen, Germany + Department of Brain and Cognitive Engineering, Korea University; Max Planck Institute for Biological Cybernetics, Tubingen, Germany",
        "aff_domain": "ist.uni-stuttgart.de;tuebingen.mpg.de;ist.uni-stuttgart.de;tuebingen.mpg.de;tuebingen.mpg.de",
        "email": "ist.uni-stuttgart.de;tuebingen.mpg.de;ist.uni-stuttgart.de;tuebingen.mpg.de;tuebingen.mpg.de",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;1+2;1",
        "aff_unique_norm": "University of Stuttgart;Max Planck Institute for Biological Cybernetics;Korea University",
        "aff_unique_dep": "Institute for Systems Theory and Automatic Control;;Department of Brain and Cognitive Engineering",
        "aff_unique_url": "https://www.ustuttgart.de;https://www.biocybernetics.mpg.de;http://www.korea.ac.kr",
        "aff_unique_abbr": ";MPIBC;KU",
        "aff_campus_unique_index": "1;1;1",
        "aff_campus_unique": ";Tubingen",
        "aff_country_unique_index": "0;0;0;0+1;0",
        "aff_country_unique": "Germany;South Korea"
    },
    {
        "id": "1e5f185a23",
        "title": "Robust Loop Closing Over Time",
        "site": "https://www.roboticsproceedings.org/rss08/p30.html",
        "author": "Yasir Latif; Cesar Cadena Lerma; José Neira",
        "abstract": "Long term autonomy in robots requires the ability to reconsider previously taken decisions when new evidence becomes available. Loop closing links generated by a place recognition system may become inconsistent as additional evidence arrives. This paper is concerned with the detection and exclusion of such contradictory information from the map being built, in order to recover the correct map estimate. We propose a novel consistency based method to extract the loop closure regions that agree both among themselves and with the robot trajectory over time. We also assume that the contradictory loop closures are inconsistent among themselves and with the robot trajectory. We support our proposal, the RRR algorithm, on well-known odometry systems, e.g. visual or laser, using the very efficient graph optimization framework g2o as back-end.We back our claims with several experiments carried out on real data.",
        "bibtex": "@INPROCEEDINGS{Latif-RSS-12, \r\n    AUTHOR    = {Yasir Latif AND Cesar Cadena Lerma AND Jose Neira}, \r\n    TITLE     = {Robust Loop Closing Over Time}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.030} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p30.pdf",
        "supp": "",
        "pdf_size": 1722219,
        "gs_citation": 87,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12172658378112827855&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 18,
        "aff": "Instituto de Investigación en Ingeniería de Aragón, I3A; Instituto de Investigación en Ingeniería de Aragón, I3A; Instituto de Investigación en Ingeniería de Aragón, I3A",
        "aff_domain": "unizar.es;unizar.es;unizar.es",
        "email": "unizar.es;unizar.es;unizar.es",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Instituto de Investigación en Ingeniería de Aragón",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "I3A",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Spain"
    },
    {
        "id": "1c5d626467",
        "title": "Robust Navigation Execution by Planning in Belief Space",
        "site": "https://www.roboticsproceedings.org/rss08/p37.html",
        "author": "Bhaskara Marthi",
        "abstract": "We consider robot navigation in environments consisting of a known static map, but where dynamic obstacles of varying and unknown lifespans appear and disappear over time.   We describe a roadmap-based formulation of the problem that takes the sensing and transition uncertainty into account, and an efficient online planner for this problem. The planner displays behaviors such as persistence and obstacle timeouts that would normally be hardcoded into an executive. It is also able to make inferences about obstacle types even with impoverished sensors. We present empirical results on simulated domains and on a PR2 robot.",
        "bibtex": "@INPROCEEDINGS{Marthi-RSS-12, \r\n    AUTHOR    = {Bhaskara Marthi}, \r\n    TITLE     = {Robust Navigation Execution by Planning in Belief Space}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.037} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p37.pdf",
        "supp": "",
        "pdf_size": 567859,
        "gs_citation": 17,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9704324223645306050&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": "Willow Garage, Inc.",
        "aff_domain": "willowgarage.com",
        "email": "willowgarage.com",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Willow Garage",
        "aff_unique_dep": "",
        "aff_unique_url": "http://www.willowgarage.com",
        "aff_unique_abbr": "",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "c6ba638f9f",
        "title": "Robust Object Grasping using Force Compliant Motion Primitives",
        "site": "https://www.roboticsproceedings.org/rss08/p23.html",
        "author": "Moslem Kazemi; Jean-Sebastien Valois; J. Andrew Bagnell; Nancy Pollard",
        "abstract": "We address the problem of grasping everyday objects that are small relative to an anthropomorphic hand, such as pens, screwdrivers, cellphones, and hammers from their natural poses on a support surface, e.g., a table top. In such conditions, state of the art grasp generation techniques fail to provide robust, achievable solutions due to either ignoring or trying to avoid contact with the support surface. In contrast, we show that contact with support surfaces is critical for grasping small objects. This also conforms with our anecdotal observations of human grasping behaviors. We develop a simple closed-loop hybrid controller that mimics this interactive, contact-rich strategy by a position-force, pre-grasp and landing strategy for finger placement. The approach uses a compliant control of the hand during the grasp and release of objects in order to preserve safety. We conducted extensive grasping experiments on a variety of small objects with similar shape and size. The results demonstrate that our approach is robust to localization uncertainties and applies to many everyday objects.",
        "bibtex": "@INPROCEEDINGS{Kazemi-RSS-12, \r\n    AUTHOR    = {Moslem Kazemi AND Jean-Sebastien Valois AND J. Andrew Bagnell AND Nancy Pollard}, \r\n    TITLE     = {Robust Object Grasping using Force Compliant Motion Primitives}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.023} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p23.pdf",
        "supp": "",
        "pdf_size": 3177043,
        "gs_citation": 70,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13935221857371371347&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": "The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213 USA; The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213 USA; The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213 USA; The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213 USA",
        "aff_domain": "andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu",
        "email": "andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Pittsburgh",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "e01fe871a8",
        "title": "State Estimation for Legged Robots - Consistent Fusion of Leg Kinematics and IMU",
        "site": "https://www.roboticsproceedings.org/rss08/p03.html",
        "author": "Michael Bloesch; Marco Hutter; Mark Hoepflinger; Stefan Leutenegger; Christian Gehring; C. David Remy; Roland Siegwart",
        "abstract": "This paper introduces a state estimation framework for legged robots that allows estimating the full pose of the robot without making any assumptions about the geometrical structure of its environment. This is achieved by means of an Observability Constrained Extended Kalman Filter that fuses kinematic encoder data with on-board IMU measurements. By including the absolute position of all footholds into the filter state, simple model equations can be formulated which accurately capture the uncertainties associated with the intermittent ground contacts. The resulting filter simultaneously estimates the position of all footholds and the pose of the main body. In the algorithmic formulation, special attention is paid to the consistency of the linearized filter: it maintains the same observability properties as the nonlinear system, which is a prerequisite for accurate state estimation. The presented approach is implemented in simulation and validated experimentally on an actual quadrupedal robot.",
        "bibtex": "@INPROCEEDINGS{Bloesch-RSS-12, \r\n    AUTHOR    = {Michael Bloesch AND Marco Hutter AND Mark Hoepflinger AND Stefan Leutenegger AND Christian Gehring AND C. David Remy AND Roland Siegwart}, \r\n    TITLE     = {State Estimation for Legged Robots - Consistent Fusion of Leg Kinematics and {IMU}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.003} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p03.pdf",
        "supp": "",
        "pdf_size": 2551697,
        "gs_citation": 433,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11674537549906889945&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": ";;;;;;",
        "aff_domain": ";;;;;;",
        "email": ";;;;;;",
        "github": "",
        "project": "",
        "author_num": 7,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "d1d2c50524",
        "title": "Tendon-Driven Variable Impedance Control Using Reinforcement Learning",
        "site": "https://www.roboticsproceedings.org/rss08/p47.html",
        "author": "Eric Rombokas; Mark Malhotra; Evangelos Theodorou; Yoky Matsuoka ; Emo Todorov",
        "abstract": "Biological motor control is capable of learning complex movements containing contact transitions and unknown force requirements while adapting the impedance of the system. In this work, we seek to achieve robotic mimicry of this compliance, employing stiffness only when it is necessary for task completion.  We use path integral reinforcement learning which has been successfully applied on torque-driven systems to learn episodic tasks without using explicit models. Applying this method to tendon-driven systems is challenging because of the increase in dimensionality, the intrinsic nonlinearities of such systems, and the increased effect of external dynamics on the lighter tendon-driven end effectors.   We demonstrate the simultaneous learning of feedback gains and desired tendon trajectories in a dynamically complex sliding-switch task with a tendon-driven robotic hand.  The learned controls look noisy but nonetheless result in smooth and expert task performance.  We show discovery of dynamic strategies not explored in a demonstration, and that the learned strategy is useful for understanding difficult-to-model plant characteristics.",
        "bibtex": "@INPROCEEDINGS{Rombokas-RSS-12, \r\n    AUTHOR    = {Eric Rombokas AND Mark Malhotra AND Evangelos Theodorou AND Yoky Matsuoka  AND Emo Todorov}, \r\n    TITLE     = {Tendon-Driven Variable Impedance Control Using Reinforcement Learning}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.047} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p47.pdf",
        "supp": "",
        "pdf_size": 1020456,
        "gs_citation": 30,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2947167746089845503&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": ";;;;",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "http://tendondriven.pbworks.com/",
        "author_num": 5,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "9b0ba6c10e",
        "title": "The Banana Distribution is Gaussian: A Localization Study with Exponential Coordinates",
        "site": "https://www.roboticsproceedings.org/rss08/p34.html",
        "author": "Andrew Long; Kevin Wolfe; Michael Mashner; Gregory Chirikjian",
        "abstract": "Distributions in position and orientation are central to many problems in robot localization.  To increase efficiency, a majority of algorithms for planar mobile robots use Gaussians defined on positional Cartesian coordinates and heading. However,  the distribution of poses for a noisy two-wheeled robot moving in the plane has been observed by many to be a ``banana-shaped'' distribution, which is clearly not Gaussian/normal in these coordinates.  As uncertainty increases, many localization algorithms therefore become ``inconsistent''  due to the normality assumption breaking down. We observe that this is because the combination of Cartesian coordinates and heading is not the most appropriate set of coordinates to use, and that the banana distribution can be described in closed form as a Gaussian in an alternative set of coordinates via the so-called exponential map.    With this formulation, we can derive closed-form expressions for propagating the mean and covariance of the Gaussian in these exponential coordinates for a differential-drive car moving along a trajectory constructed from sections of straight segments and arcs of constant curvature. In addition, we detail how to fuse two or more Gaussians in exponential coordinates together with given relative pose measurements between robots moving in formation.  These propagation and fusion formulas utilized here reduce uncertainty in localization better than when using traditional methods.  We demonstrate with numerical examples dramatic improvements in the estimated pose of three robots moving in formation when compared to classical Cartesian-coordinate-based Gaussian fusion methods.",
        "bibtex": "@INPROCEEDINGS{Long-RSS-12, \r\n    AUTHOR    = {Andrew Long AND Kevin Wolfe AND Michael Mashner AND Gregory Chirikjian}, \r\n    TITLE     = {The Banana Distribution is Gaussian: A Localization Study with Exponential Coordinates}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.034} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p34.pdf",
        "supp": "",
        "pdf_size": 3583204,
        "gs_citation": 150,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13690306951773571473&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "80e5a0532f",
        "title": "Time-Optimal Trajectory Generation for Path Following with Bounded Acceleration and Velocity",
        "site": "https://www.roboticsproceedings.org/rss08/p27.html",
        "author": "Tobias Kunz; Mike Stilman",
        "abstract": "This paper presents a novel method to generate the time-optimal trajectory that exactly follows a given differentiable joint-space path within given bounds on joint accelerations and velocities. We also present a path preprocessing method to make nondifferentiable paths differentiable by adding circular blends. We introduce improvements to existing work that make the algorithm more robust in the presence of numerical inaccuracies. Furthermore we validate our methods on hundreds of randomly generated test cases on simulated and real 7-DOF robot arms. Finally, we provide open source software that implements our algorithms.",
        "bibtex": "@INPROCEEDINGS{Kunz-RSS-12, \r\n    AUTHOR    = {Tobias Kunz AND Mike Stilman}, \r\n    TITLE     = {Time-Optimal Trajectory Generation for Path Following with Bounded Acceleration and Velocity}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.027} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p27.pdf",
        "supp": "",
        "pdf_size": 740215,
        "gs_citation": 172,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11871526067554593825&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "1394ee6ffc",
        "title": "Toward Information Theoretic Human-Robot Dialog",
        "site": "https://www.roboticsproceedings.org/rss08/p52.html",
        "author": "Stefanie Tellex; Pratiksha Thaker; Robin Deits; Thomas Kollar; Nicholas Roy",
        "abstract": "Our goal is to build robots that can robustly interact with humans using natural language.  This problem is challenging because human language is filled with ambiguity, and furthermore, due to limitations in sensing, the robot's perception of its environment might be much more limited than that of its human partner.  To enable a robot to recover from a failure to understand a natural language utterance, this paper describes an information-theoretic strategy for asking targeted clarifying questions and using information from the answer to disambiguate the language. To identify good questions, we derive an estimate of the robot's uncertainty about the mapping between specific phrases in the language and aspects of the external world.  This metric enables the robot to ask a targeted question about the parts of the language for which it is most uncertain.  After receiving an answer, the robot fuses information from the command, the question, and the answer in a joint probabilistic graphical model in the",
        "bibtex": "@INPROCEEDINGS{Tellex-RSS-12, \r\n    AUTHOR    = {Stefanie Tellex AND Pratiksha Thaker AND Robin Deits AND Thomas Kollar AND Nicholas Roy}, \r\n    TITLE     = {Toward Information Theoretic Human-Robot Dialog}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.052} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p52.pdf",
        "supp": "",
        "pdf_size": 470898,
        "gs_citation": 95,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11755550570952233412&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 21,
        "aff": ";;;;",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "dea0d81f9a",
        "title": "Towards A Swarm of Agile Micro Quadrotors",
        "site": "https://www.roboticsproceedings.org/rss08/p28.html",
        "author": "Aleksandr Kushleyev; Vijay Kumar; Daniel Mellinger",
        "abstract": "We describe a prototype 73 gram, 21 cm diameter micro quadrotor with onboard attitude estimation and control that operates autonomously with an external localization system. We argue that the reduction in size leads to agility and the ability to operate in tight formations and provide experimental arguments in support of this claim. The robot is shown to be capable of 1850 degrees/sec roll and pitch, performs a 360 degree flip in 0.4 seconds and exhibits a lateral step response of 1 body length in 1 second. We describe the architecture and algorithms to coordinate a team of quadrotors, organize them into groups and fly through known three-dimensional environments. We provide experimental results for a team of 20 micro quadrotors.",
        "bibtex": "@INPROCEEDINGS{Kushleyev-RSS-12, \r\n    AUTHOR    = {Aleksandr Kushleyev AND Vijay Kumar AND Daniel Mellinger}, \r\n    TITLE     = {Towards A Swarm of Agile Micro Quadrotors}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.028} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p28.pdf",
        "supp": "",
        "pdf_size": 3773070,
        "gs_citation": 729,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3577728573924645669&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 17,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "91c68d0aca",
        "title": "Towards Persistent Localization and Mapping with a Continuous Appearance-based Topology",
        "site": "https://www.roboticsproceedings.org/rss08/p36.html",
        "author": "William Maddern; Michael Milford; Gordon Wyeth",
        "abstract": "Appearance-based localization can provide loop closure detection at vast scales regardless of accumulated metric error. However, the computation time and memory requirements of current appearance-based methods scale not only with the size of the environment but also with the operation time of the platform. Additionally, repeated visits to locations will develop multiple competing representations, which will reduce recall performance over time. These properties impose severe restrictions on long-term autonomy for mobile robots, as loop closure performance will inevitably degrade with increased operation time. In this paper we present a graphical extension to CAT-SLAM, a particle filter-based algorithm for appearance-based localization and mapping, to provide constant computation and memory requirements over time and minimal degradation of recall performance during repeated visits to locations. We demonstrate loop closure detection in a large urban environment with capped computation time and memory requirements and performance exceeding previous appearance-based methods by a factor of 2. We discuss the limitations of the algorithm with respect to environment size, appearance change over time and applications in topological planning and navigation for long-term robot operation.",
        "bibtex": "@INPROCEEDINGS{Maddern-RSS-12, \r\n    AUTHOR    = {William Maddern AND Michael Milford AND Gordon Wyeth}, \r\n    TITLE     = {Towards Persistent Localization and Mapping with a Continuous Appearance-based Topology}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.036} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p36.pdf",
        "supp": "",
        "pdf_size": 708620,
        "gs_citation": 23,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17808201008033904085&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 19,
        "aff": "School of Electrical Engineering and Computer Science, Queensland University of Technology, Brisbane, Australia; School of Electrical Engineering and Computer Science, Queensland University of Technology, Brisbane, Australia; School of Electrical Engineering and Computer Science, Queensland University of Technology, Brisbane, Australia",
        "aff_domain": "qut.edu.au;qut.edu.au;qut.edu.au",
        "email": "qut.edu.au;qut.edu.au;qut.edu.au",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Queensland University of Technology",
        "aff_unique_dep": "School of Electrical Engineering and Computer Science",
        "aff_unique_url": "https://www.qut.edu.au",
        "aff_unique_abbr": "QUT",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Brisbane",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "1c8195b256",
        "title": "Turning-rate Selective Control : A New Method for Independent Control of Stress-engineered MEMS Microrobots",
        "site": "https://www.roboticsproceedings.org/rss08/p41.html",
        "author": "Igor Paprotny; Christopher Levey; Paul Wright; Bruce Donald",
        "abstract": "We present a novel method for independently controlling multiple stress-engineered MEMS microrobots (MicroStressBots) through a single, global, control signal.  Called Turning-rate Selective Control (TSC), this new technique employs designed variations in turning rates between individual microrobots to differentiate their motion. Despite all robots moving simultaneously and being identical except for exhibiting different turning rates, TSC can individually and independently position the robots' centers of rotation within a planar configuration space. This allows the individual robots to be independently maneuverable to within a distance equal to the turning radius (approximately half of a microrobot width) away from an arbitrary location (configuration excluding rotation) in R^2.  We introduce the theory behind TSC and, by using fabricated microrobots, show experimental results that confirm the feasibility of TSC for controlling multiple MicroStressBots through a single, global, control signal. We conclude by discussing how TSC can extend the maximum number of independently controllable MicroStressBots beyond previously published approaches.",
        "bibtex": "@INPROCEEDINGS{Paprotny-RSS-12, \r\n    AUTHOR    = {Igor Paprotny AND Christopher Levey AND Paul Wright AND Bruce Donald}, \r\n    TITLE     = {Turning-rate Selective Control : A New Method for Independent Control of Stress-engineered {MEMS} Microrobots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.041} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p41.pdf",
        "supp": "",
        "pdf_size": 4536032,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1278282623307299678&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "Berkeley Sensor & Actuator Center (BSAC), University of California, Berkeley, CA, USA + Center for Information Technology Research in the Interest of Society (CITRIS), University of California, Berkeley, CA, USA + Department of Mechanical Engineering, University of California, Berkeley, CA, USA + Duke Institute for Brain Sciences, Duke University Medical Center, Durham, NC, USA; Thayer School of Engineering, Dartmouth College, Hanover, NH, USA; Berkeley Sensor & Actuator Center (BSAC), University of California, Berkeley, CA, USA + Center for Information Technology Research in the Interest of Society (CITRIS), University of California, Berkeley, CA, USA + Department of Mechanical Engineering, University of California, Berkeley, CA, USA; Department of Computer Science, Duke University, Durham, NC, USA + Department of Biochemistry, School of Medicine, Duke University Medical Center, Durham, NC, USA + Duke Institute for Brain Sciences, Duke University Medical Center, Durham, NC, USA",
        "aff_domain": "eecs.berkeley.edu; ; ; ",
        "email": "eecs.berkeley.edu; ; ; ",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+0+0+1;2;0+0+0;1+3+1",
        "aff_unique_norm": "University of California, Berkeley;Duke University;Dartmouth College;Duke University Medical Center",
        "aff_unique_dep": "Berkeley Sensor & Actuator Center (BSAC);Duke Institute for Brain Sciences;Thayer School of Engineering;Department of Biochemistry",
        "aff_unique_url": "https://www.berkeley.edu;https://www.duke.edu;https://engineering.dartmouth.edu;https://med.duke.edu",
        "aff_unique_abbr": "UC Berkeley;Duke;Dartmouth;Duke",
        "aff_campus_unique_index": "0+0+0+1;2;0+0+0;1+1+1",
        "aff_campus_unique": "Berkeley;Durham;Hanover",
        "aff_country_unique_index": "0+0+0+0;0;0+0+0;0+0+0",
        "aff_country_unique": "United States"
    },
    {
        "id": "efd97a6a81",
        "title": "Variational Bayesian Optimization for Runtime Risk-Sensitive Control",
        "site": "https://www.roboticsproceedings.org/rss08/p26.html",
        "author": "Scott Kuindersma; Roderic Grupen; Andrew Barto",
        "abstract": "We present a new Bayesian policy search algorithm suitable for problems with policy-dependent cost variance, a property present in many robot control tasks. We extend recent work on variational heteroscedastic Gaussian processes to the optimization case to achieve efficient minimization of very noisy cost signals. In contrast to most policy search algorithms, our method explicitly models the cost variance in regions of low expected cost and permits runtime adjustment of risk sensitivity without relearning. Our experiments with artificial systems and a real mobile manipulator demonstrate that flexible risk-sensitive policies can be learned in very few trials.",
        "bibtex": "@INPROCEEDINGS{Kuindersma-RSS-12, \r\n    AUTHOR    = {Scott Kuindersma AND Roderic Grupen AND Andrew Barto}, \r\n    TITLE     = {Variational Bayesian Optimization for Runtime Risk-Sensitive Control}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.026} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p26.pdf",
        "supp": "",
        "pdf_size": 1859536,
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1228254886473938970&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 21,
        "aff": "Computer Science Department, University of Massachusetts Amherst; Computer Science Department, University of Massachusetts Amherst; Computer Science Department, University of Massachusetts Amherst",
        "aff_domain": "cs.umass.edu;cs.umass.edu;cs.umass.edu",
        "email": "cs.umass.edu;cs.umass.edu;cs.umass.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Massachusetts Amherst",
        "aff_unique_dep": "Computer Science Department",
        "aff_unique_url": "https://www.umass.edu",
        "aff_unique_abbr": "UMass Amherst",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Amherst",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "79449e6974",
        "title": "Visual Route Recognition with a Handful of Bits",
        "site": "https://www.roboticsproceedings.org/rss08/p38.html",
        "author": "Michael Milford",
        "abstract": "In this paper we use a sequence-based visual localization algorithm to reveal surprising answers to the question, how much visual information is actually needed to conduct effective navigation? The algorithm actively searches for the best local image matches within a sliding window of short route segments or sub-routes, and matches sub-routes by searching for coherent sequences of local image matches. In contrast to many existing techniques, the technique requires no pre-training or camera parameter calibration. We compare the algorithm's performance to the state-of-the-art FAB-MAP 2.0 algorithm on a 70 km benchmark dataset. Performance matches or exceeds the state of the art feature-based localization technique using images as small as 4 pixels, fields of view reduced by a factor of 250, and pixel bit depths reduced to 2 bits. We present further results demonstrating the system localizing in an office environment with near 100",
        "bibtex": "@INPROCEEDINGS{Milford-RSS-12, \r\n    AUTHOR    = {Michael Milford}, \r\n    TITLE     = {Visual Route Recognition with a Handful of Bits}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.038} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p38.pdf",
        "supp": "",
        "pdf_size": 3322546,
        "gs_citation": 58,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15715557090288203231&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": "School of Electrical Engineering and Computer Science, Queensland University of Technology, Brisbane, Australia",
        "aff_domain": "qut.edu.au",
        "email": "qut.edu.au",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Queensland University of Technology",
        "aff_unique_dep": "School of Electrical Engineering and Computer Science",
        "aff_unique_url": "https://www.qut.edu.au",
        "aff_unique_abbr": "QUT",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Brisbane",
        "aff_country_unique_index": "0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "dafe9bebdc",
        "title": "Walking and running on yielding and fluidizing ground",
        "site": "https://www.roboticsproceedings.org/rss08/p44.html",
        "author": "Feifei Qian; Tingnan Zhang; chen Li; Aaron Hoover; Pierangelo Masarati; Paul Birkmeyer; Andrew Pullin; Ronald Fearing; Dan Goldman",
        "abstract": "We study the detailed locomotor mechanics of a small, lightweight  robot (DynaRoACH, 10 cm, 25 g) which can move on a granular substrate of closely packed 3 mm diameter glass particles at speeds up to 50 cm/s (5 body length/s), approaching the  performance of small, high-performing, desert-dwelling lizards. To reveal how the robot achieves this high performance, we used high speed imaging to capture kinematics, and developed a numerical multi-body simulation of the robot coupled to an experimentally validated discrete element method (DEM) simulation of the granular media. Average forward speeds measured in both experiment and simulation agreed well, and increased non-linearly with stride frequency, reflecting a change in the mode of propulsion. At low frequencies, the robot used a quasi-static rotary walking mode, in which the granular material yielded as the legs penetrated and then solidified once vertical force balance was achieved. At high frequencies, duty factor decreased below 0.5 and aerial phases occurred. The propulsion mechanism was qualitatively different: the robot ran rapidly by utilizing the speed-dependent fluid-like inertial response of the material. We also used our simulation tool to vary substrate parameters that were inconvenient to vary in experiment (e.g., granular particle friction) to test performance and reveal limits of stability of the robot. Using small robots as physical models, our study reveals a mechanism by which small animals can achieve high performance on granular substrates, which in return advances the design and control of small robots in deformable terrains.",
        "bibtex": "@INPROCEEDINGS{Qian-RSS-12, \r\n    AUTHOR    = {Feifei Qian AND Tingnan Zhang AND chen Li AND Aaron Hoover AND Pierangelo Masarati AND Paul Birkmeyer AND Andrew Pullin AND Ronald Fearing AND Dan Goldman}, \r\n    TITLE     = {Walking and running on yielding and fluidizing ground}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.044} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p44.pdf",
        "supp": "",
        "pdf_size": 832953,
        "gs_citation": 43,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5132483065675765470&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 23,
        "aff": "Georgia Institute of Technology; Georgia Institute of Technology; Georgia Institute of Technology; Dipartimento di Ingegneria Aerospaziale, Politecnico di Milano; Franklin W. Olin College of Engineering; University of California at Berkeley; University of California at Berkeley; University of California at Berkeley; Georgia Institute of Technology",
        "aff_domain": ";;;;;;;;",
        "email": ";;;;;;;;",
        "github": "",
        "project": "",
        "author_num": 9,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;1;2;3;3;3;0",
        "aff_unique_norm": "Georgia Institute of Technology;Politecnico di Milano;Franklin W. Olin College of Engineering;University of California, Berkeley",
        "aff_unique_dep": ";Dipartimento di Ingegneria Aerospaziale;;",
        "aff_unique_url": "https://www.gatech.edu;https://www.polimi.it;https://www.olin.edu;https://www.berkeley.edu",
        "aff_unique_abbr": "Georgia Tech;Politecnico di Milano;Olin College;UC Berkeley",
        "aff_campus_unique_index": "1;1;1",
        "aff_campus_unique": ";Berkeley",
        "aff_country_unique_index": "0;0;0;1;0;0;0;0;0",
        "aff_country_unique": "United States;Italy"
    },
    {
        "id": "54d69a1312",
        "title": "What Types of Interactions do Bio-Inspired Robot Swarms and Flocks Afford a Human?",
        "site": "https://www.roboticsproceedings.org/rss08/p14.html",
        "author": "Michael Goodrich; Sean Kerman; Brian Pendleton; P.B. Sujit",
        "abstract": "\"This paper uses simulations to identify what types of human influence are afforded by the flocking and swarming structures that emerge from Couzin's bio-inspired model.  The goal is to allow a human to influence a decentralized agent collective without resorting to centralized human control.  Evidence is provided that, when nominal agents use switching-based control to respond to human-guided predators and leaders, the resulting behavior is responsive to human input but is obtained at the cost of causing the dynamic structure of the collective to follow a single flocking structure.   Leaders are more effective in influencing coherent flocks, but predators can be used to divide the flock into sub-flocks, yielding higher performance on some problems.  Introducing a so-called \"\"stakeholder\"\" leadership style makes it possible for a human to guide the agents while maintaining several different types of structures; doing so requires more than one human-controlled agent.  We then demonstrate that it is possible to produce potentially useful emergent dynamics  without centralized human control, and identify an important type of emergent dynamics: automatic switches between structure types.\"",
        "bibtex": "@INPROCEEDINGS{Goodrich-RSS-12, \r\n    AUTHOR    = {Michael Goodrich AND Sean Kerman AND Brian Pendleton AND P.B. Sujit}, \r\n    TITLE     = {What Types of Interactions do Bio-Inspired Robot Swarms and Flocks Afford a Human?}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.014} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p14.pdf",
        "supp": "",
        "pdf_size": 414850,
        "gs_citation": 39,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13368725047385415942&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "Computer Science Department, Brigham Young University; Computer Science Department, Brigham Young University; Computer Science Department, Brigham Young University; Electrical and Computer Engineering Department, University of Porto",
        "aff_domain": "cs.byu.edu; ; ;fe.up.pt",
        "email": "cs.byu.edu; ; ;fe.up.pt",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;1",
        "aff_unique_norm": "Brigham Young University;University of Porto",
        "aff_unique_dep": "Computer Science Department;Electrical and Computer Engineering Department",
        "aff_unique_url": "https://www.byu.edu;https://www.fe.up.pt",
        "aff_unique_abbr": "BYU;UPorto",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Provo;",
        "aff_country_unique_index": "0;0;0;1",
        "aff_country_unique": "United States;Portugal"
    },
    {
        "id": "2ddd5ea6b7",
        "title": "What's in the Bag: A Distributed Approach to 3D Shape Duplication with Modular Robots",
        "site": "https://www.roboticsproceedings.org/rss08/p12.html",
        "author": "Kyle Gilpin; Daniela Rus",
        "abstract": "Our goal is to develop an automated digital fabrication process that can make any object out of smart materials. In this paper, we present an algorithm for creating shapes by the process of duplication, using modules we have termed smart sand. The object to be duplicated is dipped into a bag of smart sand; the particles exchange messages to sense the object's shape; and then the particles selectively form mechanical bonds with their neighbors to form a duplicate of the original.  Our algorithm is capable of duplicating convex and concave 3D objects in a completely distributed manner. It uses O(1) storage space and O(n) inter-module messages per module. We perform close to 500 experiments using a realistic simulator with over 1400 modules. These experiments confirm the functionality and messaging demands of our distributed duplication algorithm while demonstrating that the algorithm can be used to form interesting and useful shapes.",
        "bibtex": "@INPROCEEDINGS{Gilpin-RSS-12, \r\n    AUTHOR    = {Kyle Gilpin AND Daniela Rus}, \r\n    TITLE     = {What's in the Bag: A Distributed Approach to 3D Shape Duplication with Modular Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2012}, \r\n    ADDRESS   = {Sydney, Australia}, \r\n    MONTH     = {July},\r\n    DOI       = {10.15607/RSS.2012.VIII.012} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss08/p12.pdf",
        "supp": "",
        "pdf_size": 715134,
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16133384930634375523&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    }
]