[
    {
        "id": "4f23fc5e96",
        "title": "A Low-Cost Compliant Gripper Using Cooperative Mini-Delta Robots for Dexterous Manipulation",
        "site": "https://www.roboticsproceedings.org/rss17/p076.html",
        "author": "Pragna Mannam",
        "abstract": "Traditional parallel-jaw grippers are insufficient for delicate object manipulation due to their stiffness and lack of dexterity. Other dexterous robotic hands often have bulky fingers; rely on complex time-varying cable drives; or are prohibitively expensive. In this paper; we introduce a novel low-cost compliant gripper with two centimeter-scaled 3-DOF delta robots using off-the-shelf linear actuators and 3D-printed soft materials. To model the kinematics of delta robots with soft compliant links; which diverge from typical rigid links; we train neural networks using a perception system. Furthermore; we analyze the delta robot's force profile by varying the starting position in its workspace and measuring the resulting force from a push action. Finally; we demonstrate the compliance and dexterity of our gripper through six dexterous manipulation tasks involving small and delicate objects. Thus; we present the groundwork for creating modular multi-fingered hands that can execute precise and low-inertia manipulations.",
        "bibtex": "@INPROCEEDINGS{Mannam-RSS-21, \r\n    AUTHOR    = {Pragna Mannam AND Avi Rudich AND Kevin Zhang AND Manuela Veloso AND Oliver Kroemer AND F. Zeynep Temel}, \r\n    TITLE     = {{A Low-Cost Compliant Gripper Using Cooperative Mini-Delta Robots for Dexterous Manipulation}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.076} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p076.pdf",
        "supp": "",
        "pdf_size": 3487395,
        "gs_citation": 19,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3301304076249099219&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://sites.google.com/view/mini-delta-robots",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "3e6518c18d",
        "title": "A Quality Diversity Approach to Automatically Generating Human-Robot Interaction Scenarios in Shared Autonomy",
        "site": "https://www.roboticsproceedings.org/rss17/p036.html",
        "author": "Matthew Fontaine; Stefanos Nikolaidis",
        "abstract": "The growth of scale and complexity of interactions between humans and robots highlights the need for new computational methods to automatically evaluate novel algorithms and applications. Exploring diverse scenarios of humans and robots interacting in simulation can improve understanding of the robotic system and avoid potentially costly failures in real-world settings. We formulate this problem as a quality diversity (QD) problem; where the goal is to discover diverse failure scenarios by simultaneously exploring both environments and human actions. We focus on the shared autonomy domain; where the robot attempts to infer the goal of a human operator; and adopt the QD algorithm MAP-Elites to generate scenarios for two published algorithms in this domain: shared autonomy via hindsight optimization and linear policy blending. Some of the generated scenarios confirm previous theoretical findings; while others are surprising and bring about a new understanding of state-of-the-art implementations. Our experiments show that MAP-Elites outperforms Monte-Carlo simulation and optimization based methods in effectively searching the scenario space; highlighting its promise for automatic evaluation of algorithms in human-robot interaction.",
        "bibtex": "@INPROCEEDINGS{Fontaine-RSS-21, \r\n    AUTHOR    = {Matthew Fontaine AND Stefanos Nikolaidis}, \r\n    TITLE     = {{A Quality Diversity Approach to Automatically Generating Human-Robot Interaction Scenarios in Shared Autonomy}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.036} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p036.pdf",
        "supp": "",
        "pdf_size": 2509634,
        "gs_citation": 50,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12974770035201610677&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "Department of Computer Science, University of Southern California; Department of Computer Science, University of Southern California",
        "aff_domain": "usc.edu;usc.edu",
        "email": "usc.edu;usc.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Southern California",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.usc.edu",
        "aff_unique_abbr": "USC",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Los Angeles",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "07b3b35053",
        "title": "Ab Initio Particle-based Object Manipulation",
        "site": "https://www.roboticsproceedings.org/rss17/p071.html",
        "author": "Siwei Chen; Xiao Ma; Yunfan Lu; David Hsu",
        "abstract": "This paper presents Particle-based Object Manipulation (PROMPT); a new approach to robot manipulation of novel objects ab initio; without prior object models or pre-training on a large object data set. The key element of PROMPT is a particle-based object representation; in which each particle represents a point in the object; the local geometric; physical; and other features of the point; and also its relation with other particles. Like the model-based analytic approaches to manipulation; the particle representation enables the robot to reason about the object's geometry and dynamics in order to choose suitable manipulation actions. Like the data-driven approaches; the particle representation is inferred online in real-time from visual sensor input; specifically; multi-view RGB images. The particle representation thus connects visual perception with robot control. PROMPT combines the benefits of both model-based reasoning and data-driven learning. We show empirically that PROMPT successfully handles a variety of everyday objects; some of which are transparent. It handles various manipulation tasks; including grasping; pushing; etc;. Our experiments also show that PROMPT outperforms a state-of-the-art data-driven grasping method on the daily objects; even though it does not use any offline training data.",
        "bibtex": "@INPROCEEDINGS{ChenS-RSS-21, \r\n    AUTHOR    = {Siwei Chen AND Xiao Ma AND Yunfan Lu AND David Hsu}, \r\n    TITLE     = {{Ab Initio Particle-based Object Manipulation}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.071} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p071.pdf",
        "supp": "",
        "pdf_size": 4935727,
        "gs_citation": 11,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15728323855684808818&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "eb5266357e",
        "title": "Active Learning of Abstract Plan Feasibility",
        "site": "https://www.roboticsproceedings.org/rss17/p043.html",
        "author": "Michael Noseworthy",
        "abstract": "Long horizon sequential manipulation tasks are effectively addressed hierarchically: at a high level of abstraction the planner searches over abstract action sequences; and when a plan is found; lower level motion plans are generated. Such a strategy hinges on the ability to reliably predict that a feasible low level plan will be found which satisfies the abstract plan. However; computing Abstract Plan Feasibility (APF) is difficult because the outcome of a plan depends on complex real-world phenomena that are computationally costly to model; such as noise in estimation and plan execution.  In this work; we present an active learning approach to efficiently acquire an APF predictor through curious exploration on a robot. The robot identifies plans whose outcomes would be informative about APF; executes those plans; and learns from their subsequent successes or failures. We evaluate our strategy in simulation and on a real Franka Emika Panda robot with integrated perception; experimentation; planning; and execution. In a stacking domain where objects have non-uniform mass distributions; we show that our system permits real-robot learning of an APF model in four hundred self-supervised interactions; and that our learned model can be used effectively in different downstream tasks (e.g.; constructing the tallest tower or tower with the longest overhang).",
        "bibtex": "@INPROCEEDINGS{NoseworthyBrandMoses-RSS-21, \r\n    AUTHOR    = {Michael Noseworthy AND Isaiah Brand AND Caris Moses AND Sebastian Castro AND Leslie Kaelbling AND Tomas Lozano-Perez AND Nicholas Roy}, \r\n    TITLE     = {{Active Learning of Abstract Plan Feasibility}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.043} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p043.pdf",
        "supp": "",
        "pdf_size": 17397669,
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1252680261567538561&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://youtu.be/UF-SjGm20Mw",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "1d537c5cc7",
        "title": "Active Safety Envelopes using Light Curtains with Probabilistic Guarantees",
        "site": "https://www.roboticsproceedings.org/rss17/p045.html",
        "author": "Siddharth Ancha; Gaurav Pathak; Srinivasa Narasimhan; David Held",
        "abstract": "To safely navigate unknown environments; robots must accurately perceive dynamic obstacles. Instead of directly measuring the scene depth with a LiDAR sensor; we explore the use of a much cheaper and higher resolution sensor: programmable light curtains. Light curtains are controllable depth sensors that sense only along a surface that a user selects. We use light curtains to estimate the safety envelope of a scene: a hypothetical surface that separates the robot from all obstacles. We show that generating light curtains that sense random locations (from a particular distribution) can quickly discover the safety envelope for scenes with unknown objects. Importantly; we produce theoretical safety guarantees on the probability of detecting an obstacle using random curtains. We combine random curtains with a machine learning based model that forecasts and tracks the motion of the safety envelope efficiently. Our method accurately estimates safety envelopes while providing probabilistic safety guarantees that can be used to certify the efficacy of a robot perception system to detect and avoid dynamic obstacles. We evaluate our approach in a simulated urban driving environment and a real-world environment with moving pedestrians using a light curtain device and show that we can estimate safety envelopes efficiently and effectively.",
        "bibtex": "@INPROCEEDINGS{Ancha-RSS-21, \r\n    AUTHOR    = {Siddharth Ancha AND Gaurav Pathak AND Srinivasa Narasimhan AND David Held}, \r\n    TITLE     = {{Active Safety Envelopes using Light Curtains with Probabilistic Guarantees}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.045} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p045.pdf",
        "supp": "",
        "pdf_size": 4697926,
        "gs_citation": 7,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14748876008234164440&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Carnegie Mellon University, Pittsburgh PA 15213, USA; Carnegie Mellon University, Pittsburgh PA 15213, USA; Carnegie Mellon University, Pittsburgh PA 15213, USA; Carnegie Mellon University, Pittsburgh PA 15213, USA",
        "aff_domain": "andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu",
        "email": "andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu;andrew.cmu.edu",
        "github": "",
        "project": "https://siddancha.github.io/projects/active-safety-envelopes-with-guarantees",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Carnegie Mellon University, Pittsburgh PA 15213, USA",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "3d4b893a30",
        "title": "Adaptive-Control-Oriented Meta-Learning for Nonlinear Systems",
        "site": "https://www.roboticsproceedings.org/rss17/p056.html",
        "author": "Spencer M. Richards; Navid Azizan; Jean-Jacques Slotine; Marco Pavone",
        "abstract": "Real-time adaptation is imperative to the control of robots operating in complex; dynamic environments. Adaptive control laws can endow even nonlinear systems with good trajectory tracking performance; provided that any uncertain dynamics terms are linearly parameterizable with known nonlinear features. However; it is often difficult to specify such features a priori; such as for aerodynamic disturbances on rotorcraft or interaction forces between a manipulator arm and various objects. In this paper; we turn to data-driven modeling with neural networks to learn; offline from past data; an adaptive controller with an internal parametric model of these nonlinear features. Our key insight is that we can better prepare the controller for deployment with control-oriented meta-learning of features in closed-loop simulation; rather than regression-oriented meta-learning of features to fit input-output data. Specifically; we meta-learn the adaptive controller with closed-loop tracking simulation as the base-learner and the average tracking error as the meta-objective. With a nonlinear planar rotorcraft subject to wind; we demonstrate that our adaptive controller outperforms other controllers trained with regression-oriented meta-learning when deployed in closed-loop for trajectory tracking control.",
        "bibtex": "@INPROCEEDINGS{Richards-RSS-21, \r\n    AUTHOR    = {Spencer M. Richards AND Navid Azizan AND Jean-Jacques Slotine AND Marco Pavone}, \r\n    TITLE     = {{Adaptive-Control-Oriented Meta-Learning for Nonlinear Systems}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.056} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p056.pdf",
        "supp": "",
        "pdf_size": 1173341,
        "gs_citation": 94,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11312547137591244577&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "Department of Aeronautics & Astronautics, Stanford University, California, U.S.A. + Department of Mechanical Engineering, Massachusetts Institute of Technology, Massachusetts, U.S.A.; Department of Aeronautics & Astronautics, Stanford University, California, U.S.A. + Department of Mechanical Engineering, Massachusetts Institute of Technology, Massachusetts, U.S.A.; Department of Mechanical Engineering, Massachusetts Institute of Technology, Massachusetts, U.S.A.; Department of Aeronautics & Astronautics, Stanford University, California, U.S.A.",
        "aff_domain": "stanford.edu;stanford.edu;mit.edu;mit.edu",
        "email": "stanford.edu;stanford.edu;mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0+1;1;0",
        "aff_unique_norm": "Department of Aeronautics & Astronautics, Stanford University, California, U.S.A.;Department of Mechanical Engineering, Massachusetts Institute of Technology, Massachusetts, U.S.A.",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": ";",
        "aff_campus_unique": "",
        "aff_country_unique_index": ";",
        "aff_country_unique": ""
    },
    {
        "id": "3599744f72",
        "title": "An Empowerment-based Solution to Robotic Manipulation Tasks with Sparse Rewards",
        "site": "https://www.roboticsproceedings.org/rss17/p001.html",
        "author": "Siyu Dai; Wei Xu; Andreas Hofmann; Brian C. Williams",
        "abstract": "In order to provide adaptive and user-friendly solutions to robotic manipulation; it is important that the agent can learn to accomplish tasks even if they are only provided with very sparse instruction signals. To address the issues reinforcement learning algorithms face when task rewards are sparse; this paper proposes an intrinsic motivation approach that can be easily integrated into any standard reinforcement learning algorithm and can allow robotic manipulators to learn useful manipulation skills with only sparse extrinsic rewards. Through integrating and balancing empowerment and curiosity; this approach shows superior performance compared to other state-of-the-art intrinsic exploration approaches during extensive empirical testing. Qualitative analysis also shows that when combined with diversity-driven intrinsic motivations; this approach can help manipulators learn a set of diverse skills which could potentially be applied to other more complicated manipulation tasks and accelerate their learning process.",
        "bibtex": "@INPROCEEDINGS{DaiS-RSS-21, \r\n    AUTHOR    = {Siyu Dai AND Wei Xu AND Andreas Hofmann AND Brian C. Williams}, \r\n    TITLE     = {{An Empowerment-based Solution to Robotic Manipulation Tasks with Sparse Rewards}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.001} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p001.pdf",
        "supp": "",
        "pdf_size": 2299321,
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2895743338026473181&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": "Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology; Horizon Robotics; Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology; Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology",
        "aff_domain": "mit.edu; ; ;",
        "email": "mit.edu; ; ;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology;Horizon Robotics",
        "aff_unique_dep": "Computer Science and Artificial Intelligence Laboratory;",
        "aff_unique_url": "https://www.csail.mit.edu;https://www.horizon-robotics.com/",
        "aff_unique_abbr": "MIT;Horizon Robotics",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Cambridge;",
        "aff_country_unique_index": "0;1;0;0",
        "aff_country_unique": "United States;China"
    },
    {
        "id": "fdd23a76c3",
        "title": "An End-to-End Differentiable Framework for Contact-Aware Robot Design",
        "site": "https://www.roboticsproceedings.org/rss17/p008.html",
        "author": "Jie Xu; Tao Chen; Lara Zlokapa; Michael Foshey; Wojciech Matusik; Shinjiro Sueda; Pulkit Agrawal",
        "abstract": "The current dominant paradigm for robotic manipulation involves two separate stages: manipulator design and control. Because the robot's morphology and how it can be controlled are intimately linked; joint optimization of design and control can significantly improve performance. Existing methods for co-optimization are limited and fail to explore a rich space of designs. The primary reason is the trade-off between the complexity of designs that is necessary for contact-rich tasks against the practical constraints of manufacturing; optimization; contact handling; etc. We overcome several of these challenges by building an end-to-end differentiable framework for contact-aware robot design. The two key components of this framework are: a novel deformation-based parameterization that allows for the design of articulated rigid robots with arbitrary; complex geometry; and a differentiable rigid body simulator that can handle contact-rich scenarios and computes analytical gradients for a full spectrum of kinematic and dynamic parameters. On multiple manipulation tasks; our framework outperforms existing methods that either only optimize for control or for design using alternate representations or co-optimize using gradient-free methods.",
        "bibtex": "@INPROCEEDINGS{Xu-RSS-21, \r\n    AUTHOR    = {Jie Xu AND Tao Chen AND Lara Zlokapa AND Michael Foshey AND Wojciech Matusik AND Shinjiro Sueda AND Pulkit Agrawal}, \r\n    TITLE     = {{An End-to-End Differentiable Framework for Contact-Aware Robot Design}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.008} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p008.pdf",
        "supp": "",
        "pdf_size": 13961600,
        "gs_citation": 116,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10228681771346036715&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "aff": "Massachusetts Institute of Technology†; Massachusetts Institute of Technology†; Massachusetts Institute of Technology†; Massachusetts Institute of Technology†; Massachusetts Institute of Technology†; Texas A&M University‡; Massachusetts Institute of Technology†",
        "aff_domain": ";;;;;;",
        "email": ";;;;;;",
        "github": "",
        "project": "http://diffhand.csail.mit.edu",
        "author_num": 7,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0;1;0",
        "aff_unique_norm": "Massachusetts Institute of Technology;Texas A&M University‡",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://web.mit.edu;",
        "aff_unique_abbr": "MIT;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "6be6aaa6be",
        "title": "Bayesian Deep Graph Matching for Correspondence Identification in Collaborative Perception",
        "site": "https://www.roboticsproceedings.org/rss17/p022.html",
        "author": "Peng Gao; Hao Zhang",
        "abstract": "Correspondence identification is essential for multi-robot collaborative perception; which aims to identify the same objects in order to ensure consistent references of the objects by a group of robots/agents in their own fields of view. Although recent deep learning methods have shown encouraging performance on correspondence identification; they suffer from two shortcomings; including the inability to address non-covisibility in collaborative perception that is caused by occlusion and limited fields of view of the agents; and the inability to quantify and reduce uncertainty to improve correspondence identification. To address both issues; we propose a novel uncertainty-aware deep graph matching method for correspondence identification in collaborative perception. Our method formulates correspondence identification as a deep graph matching problem; which identifies correspondences based upon graph representations that are constructed from robot observations. We propose new deep graph matching networks in the Bayesian framework to explicitly quantify uncertainty in identified correspondences. In addition; we design novel loss functions in order to explicitly reduce correspondence uncertainty and perceptual non-covisibility during learning. We evaluate our method in the robotics applications of collaborative assembly and multi-robot coordination using high-fidelity simulations and physical robots. Experiments have validated that; by addressing uncertainty and non-covisibility; our proposed approach achieves the state-of-the-art performance of correspondence identification.",
        "bibtex": "@INPROCEEDINGS{GaoP-RSS-21, \r\n    AUTHOR    = {Peng Gao AND Hao Zhang}, \r\n    TITLE     = {{Bayesian Deep Graph Matching for Correspondence Identification in Collaborative Perception}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.022} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p022.pdf",
        "supp": "",
        "pdf_size": 4190882,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1115809331296244746&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "Human-Centered Robotics Lab, Colorado School of Mines; Human-Centered Robotics Lab, Colorado School of Mines",
        "aff_domain": "mines.edu;mines.edu",
        "email": "mines.edu;mines.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Human-Centered Robotics Lab, Colorado School of Mines",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "9ebe1ca538",
        "title": "Blind Bipedal Stair Traversal via Sim-to-Real Reinforcement Learning",
        "site": "https://www.roboticsproceedings.org/rss17/p061.html",
        "author": "Jonah Siekmann; Kevin Green; John Warila; Alan Fern; Jonathan Hurst",
        "abstract": "Accurate and precise terrain estimation is a difficult problem for robot locomotion in real-world environments. Thus; it is useful to have systems that do not depend on accurate estimation to the point of fragility. In this paper; we explore the limits of such an approach by investigating the problem of traversing stair-like terrain without any external perception or terrain models on a bipedal robot. For such blind bipedal platforms; the problem appears difficult (even for humans) due to the surprise elevation changes. Our main contribution is to show that sim-to-real reinforcement learning (RL) can achieve robust locomotion over stair-like terrain on the bipedal robot Cassie using only proprioceptive feedback. Importantly; this only requires modifying an existing flat-terrain training RL framework to include stair-like terrain randomization; without any changes in reward function. To our knowledge; this is the first controller for a bipedal; human-scale robot capable of reliably traversing a variety of real-world stairs and other stair-like disturbances using only proprioception.",
        "bibtex": "@INPROCEEDINGS{Siekmann-RSS-21, \r\n    AUTHOR    = {Jonah Siekmann AND Kevin Green AND John Warila AND Alan Fern AND Jonathan Hurst}, \r\n    TITLE     = {{Blind Bipedal Stair Traversal via Sim-to-Real Reinforcement Learning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.061} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p061.pdf",
        "supp": "",
        "pdf_size": 5496038,
        "gs_citation": 231,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17705085848999476622&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "aff": "CoRIS Institute, Oregon State University + Agility Robotics; CoRIS Institute, Oregon State University; CoRIS Institute, Oregon State University; CoRIS Institute, Oregon State University; CoRIS Institute, Oregon State University + Agility Robotics",
        "aff_domain": "agilityrobotics.com;oregonstate.edu;oregonstate.edu;oregonstate.edu;oregonstate.edu",
        "email": "agilityrobotics.com;oregonstate.edu;oregonstate.edu;oregonstate.edu;oregonstate.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0;0;0;0+1",
        "aff_unique_norm": "CoRIS Institute, Oregon State University;Agility Robotics",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://www.agilityrobotics.com",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": ";",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "ce486f5c2e",
        "title": "Co-Design of Communication and Machine Inference for Cloud Robotics",
        "site": "https://www.roboticsproceedings.org/rss17/p046.html",
        "author": "Manabu Nakanoya; Sandeep Chinchali; Alexandros Anemogiannis; Akul Datta; Sachin Katti; Marco Pavone",
        "abstract": "Today; even the most compute-and-power constrained robots can measure complex; high data-rate video and LIDAR sensory streams. Often; such robots; ranging from low-power drones to space and subterranean rovers; need to transmit high-bitrate sensory data to a remote compute server if they are uncertain or cannot scalably run complex perception or mapping tasks locally. However; today's representations for sensory data are mostly designed for human; not robotic; perception and thus often waste precious compute or wireless network resources to transmit unimportant parts of a scene that are unnecessary for a high-level robotic task. This paper presents an algorithm to learn task-relevant representations of sensory data that are co-designed with a pre-trained robotic perception model's ultimate objective. Our algorithm aggressively compresses robotic sensory data by up to 11x more than competing methods. Further; it achieves high accuracy and robust generalization on diverse tasks including Mars terrain classification with low-power deep learning accelerators; neural motion planning; and environmental timeseries classification.",
        "bibtex": "@INPROCEEDINGS{Nakanoya-RSS-21, \r\n    AUTHOR    = {Manabu Nakanoya AND Sandeep Chinchali AND Alexandros Anemogiannis AND Akul Datta AND Sachin Katti AND Marco Pavone}, \r\n    TITLE     = {{Co-Design of Communication and Machine Inference for Cloud Robotics}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.046} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p046.pdf",
        "supp": "",
        "pdf_size": 2883652,
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7212189972885050830&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": ";;;;;",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "9db6513e69",
        "title": "Composable Energy Policies for Reactive Motion Generation and Reinforcement Learning",
        "site": "https://www.roboticsproceedings.org/rss17/p052.html",
        "author": "Julen Urain; Puze Liu; Anqi Li; Carlo D'Eramo; Jan Peters",
        "abstract": "Reactive motion generation problems are usually solved by computing actions as a sum of policies. However; these policies are independent of each other and thus; they can have conflicting behaviors when summing their contributions together. We introduce Composable Energy Policies (CEP); a novel framework for modular reactive motion generation. CEP computes the control action by optimization over the product of a set of stochastic policies. This product of policies will provide a high probability to those actions that satisfy all the components and low probability to the others. Optimizing over the product of the policies avoids the detrimental effect of conflicting behaviors between policies choosing an action that satisfies all the objectives.  Besides; we show that CEP naturally adapts to the Reinforcement Learning problem allowing us to integrate; in a hierarchical fashion; any distribution as prior; from multimodal distributions to non-smooth distributions and learn a new policy given them",
        "bibtex": "@INPROCEEDINGS{Urain-RSS-21, \r\n    AUTHOR    = {Julen Urain AND Puze Liu AND Anqi Li AND Carlo D'Eramo AND Jan Peters}, \r\n    TITLE     = {{Composable Energy Policies for Reactive Motion Generation and Reinforcement Learning }}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.052} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p052.pdf",
        "supp": "",
        "pdf_size": 2846038,
        "gs_citation": 34,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1241385405117237103&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": "IAS, TU Darmstadt; University of Washington; IAS, TU Darmstadt; IAS, TU Darmstadt; IAS, TU Darmstadt",
        "aff_domain": "robot-learning.de;cs.washington.edu;robot-learning.de;robot-learning.de;tu-darmstadt.de",
        "email": "robot-learning.de;cs.washington.edu;robot-learning.de;robot-learning.de;tu-darmstadt.de",
        "github": "",
        "project": "https://sites.google.com/view/composable-energy-policies/home",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;0;0",
        "aff_unique_norm": "IAS, TU Darmstadt;University of Washington",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://www.washington.edu",
        "aff_unique_abbr": ";UW",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "84dcf1ad90",
        "title": "Continuous Integration over SO(3) for IMU Preintegration",
        "site": "https://www.roboticsproceedings.org/rss17/p078.html",
        "author": "Cédric Le Gentil; Teresa A. Vidal-Calleja",
        "abstract": "This paper presents a novel method for continuous integration over the 3D rotation group SO(3). The key idea is to model the system's dynamics with Gaussian Processes (GPs) and learn the GP training data to match the system's instantaneous angular velocity measurements. This is formulated as the minimisation of a simple cost function that leverages the application of linear operators over GP kernels. The proposed integration method over SO(3) is applied to the preintegration of inertial data provided by a 6-DoF-Inertial Measurement Unit (IMU). Unlike standard integration that requires the recomputation of the integrals every time the estimate changes; preintegration combines the IMU readings into pseudo-measurements that are independent from the pose estimate and allows for efficient multi-modal sensor-fusion. The pseudo-measurements generated by the proposed method are named Unified Gaussian Preintegrated Measurements (UGPMs). UGPMs rely on GP regression and linear operators to analytically integrate the acceleration data. Moreover; a mechanism for IMU bias and time-shift correction is introduced to allow for seamless multi-modal state estimation. Over quantitative experiments; we show that the UGPMs outperform the current state-of-the-art preintegration methods.",
        "bibtex": "@INPROCEEDINGS{LeGentil-RSS-21, \r\n    AUTHOR    = {Cédric {Le Gentil} AND Teresa A. Vidal-Calleja}, \r\n    TITLE     = {{Continuous Integration over SO(3) for IMU Preintegration}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.078} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p078.pdf",
        "supp": "",
        "pdf_size": 823940,
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4150633223026891902&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "Centre for Autonomous Systems, University of Technology Sydney, Australia; Centre for Autonomous Systems, University of Technology Sydney, Australia",
        "aff_domain": "student.uts.edu.au;uts.edu.au",
        "email": "student.uts.edu.au;uts.edu.au",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Technology Sydney",
        "aff_unique_dep": "Centre for Autonomous Systems",
        "aff_unique_url": "https://www.uts.edu.au",
        "aff_unique_abbr": "UTS",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Sydney",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Australia"
    },
    {
        "id": "5e03c1d4f7",
        "title": "Convex Risk Bounded Continuous-Time Trajectory Planning in Uncertain Nonconvex Environments",
        "site": "https://www.roboticsproceedings.org/rss17/p069.html",
        "author": "Ashkan Jasour; Weiqiao Han; Brian C. Williams",
        "abstract": "In this paper; we address the trajectory planning problem in uncertain nonconvex static and dynamic environments that contain obstacles with probabilistic location; size; and geometry. To address this problem; we provide a risk bounded trajectory planning method that looks for continuous-time trajectories with guaranteed bounded risk over the planning time horizon. Risk is defined as the probability of collision with uncertain obstacles. Existing approaches to address risk bounded trajectory planning problems either are limited to Gaussian uncertainties and convex obstacles or rely on sampling-based methods that need uncertainty samples and time discretization. To address the risk bounded trajectory planning problem; we leverage the notion of risk contours to transform the risk bounded planning problem into a deterministic optimization problem. Risk contours are the set of all points in the uncertain environment with guaranteed bounded risk. The obtained deterministic optimization is; in general; nonlinear and nonconvex time-varying optimization. We provide convex methods based on sum-of-squares optimization to efficiently solve the obtained nonconvex time-varying optimization problem and obtain the continuous-time risk bounded trajectories without time discretization. The provided approach deals with arbitrary probabilistic uncertainties; nonconvex and nonlinear; static and dynamic obstacles; and is suitable for online trajectory planning problems.",
        "bibtex": "@INPROCEEDINGS{Jasour-RSS-21, \r\n    AUTHOR    = {Ashkan Jasour AND Weiqiao Han AND Brian C. Williams}, \r\n    TITLE     = {{Convex Risk Bounded Continuous-Time Trajectory Planning in Uncertain Nonconvex Environments}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.069} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p069.pdf",
        "supp": "",
        "pdf_size": 2133867,
        "gs_citation": 27,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3192681920317517682&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "aff": "MIT, Computer Science and Artificial Intelligence Laboratory; MIT, Computer Science and Artificial Intelligence Laboratory; MIT, Computer Science and Artificial Intelligence Laboratory",
        "aff_domain": "mit.edu;mit.edu;mit.edu",
        "email": "mit.edu;mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "MIT, Computer Science and Artificial Intelligence Laboratory",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "21cde0e90e",
        "title": "DiSECt: A Differentiable Simulation Engine for Autonomous Robotic Cutting",
        "site": "https://www.roboticsproceedings.org/rss17/p067.html",
        "author": "Eric Heiden; Miles Macklin; Yashraj S Narang; Dieter Fox; Animesh Garg; Fabio Ramos",
        "abstract": "Robotic cutting of soft materials is critical for applications such as food processing; household automation; and surgical manipulation. As in other areas of robotics; simulators can facilitate controller verification; policy learning; and dataset generation. Moreover; differentiable simulators can enable gradient-based optimization; which is invaluable for calibrating simulation parameters and optimizing controllers. In this work; we present DiSECt: the first differentiable simulator for cutting soft materials. The simulator augments the finite element method (FEM) with a continuous contact model based on signed distance fields (SDF); as well as a continuous damage model that inserts springs on opposite sides of the cutting plane and allows them to weaken until zero stiffness; enabling crack formation. Through various experiments; we evaluate the performance of the simulator. We first show that the simulator can be calibrated to match resultant forces and deformation fields from a state-of-the-art commercial solver and real-world cutting datasets; with generality across cutting velocities and object instances. We then show that Bayesian inference can be performed efficiently by leveraging the differentiability of the simulator; estimating posteriors over hundreds of parameters in a fraction of the time of derivative-free methods. Finally; we illustrate that control parameters in the simulation can be optimized to minimize cutting forces via lateral slicing motions. We publish videos and additional results on our project website at",
        "bibtex": "@INPROCEEDINGS{Heiden-RSS-21, \r\n    AUTHOR    = {Eric Heiden AND Miles Macklin AND Yashraj S Narang AND Dieter Fox AND Animesh Garg AND Fabio Ramos}, \r\n    TITLE     = {{DiSECt: A Differentiable Simulation Engine for Autonomous Robotic Cutting}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.067} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p067.pdf",
        "supp": "",
        "pdf_size": 18835060,
        "gs_citation": 113,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6433947881983490450&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": ";;;;;",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "",
        "project": "https://diff-cutting-sim.github.io",
        "author_num": 6,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "1715209dde",
        "title": "Dipper: A Dynamically Transitioning Aerial-Aquatic Unmanned Vehicle",
        "site": "https://www.roboticsproceedings.org/rss17/p048.html",
        "author": "Friedrich M Rockenbauer",
        "abstract": "The locomotion for many modern robotic systems is optimized for a single target domain - aerial; surface or underwater. In this work; we address the challenge of developing a robotic system capable of controlled motion in air and underwater. Further; we explore the particular challenge of dynamic transitions between air and water. We propose Dipper; an aerial-aquatic hybrid vehicle. Dipper is a light-weight fixed-wing UAV with actively swept wings. The bio-inspired system is not only capable of maneuvering efficiently during flight and underwater; but can also perform dynamic aerial-aquatic transitions. We describe the design; construction and testing of the Dipper prototype; and demonstrate repeatability and robustness especially during the transition phases.",
        "bibtex": "@INPROCEEDINGS{Rockenbauer-RSS-21, \r\n    AUTHOR    = {Friedrich M Rockenbauer AND Simon Jeger AND Liberto Beltran AND Maximilian Berger AND Marvin Harms AND Noah Kaufmann AND Marc Rauch AND Moritz Reinders AND Nicholas Lawrance AND Thomas Stastny AND Roland Siegwart}, \r\n    TITLE     = {{Dipper: A Dynamically Transitioning Aerial-Aquatic Unmanned Vehicle}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.048} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p048.pdf",
        "supp": "",
        "pdf_size": 29782303,
        "gs_citation": 70,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14043898005247606769&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://www.dipper.ethz.ch",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0d32abaa38",
        "title": "Discovering Generalizable Skills via Automated Generation of Diverse Tasks",
        "site": "https://www.roboticsproceedings.org/rss17/p010.html",
        "author": "Kuan Fang; Yuke Zhu; Silvio Savarese; Li Fei-Fei",
        "abstract": "The learning efficiency of an intelligent agent can be greatly improved by utilizing a useful set of skills. However; the design of robot skills can often be intractable in real-world applications due to the prohibitive amount of effort and expertise that it requires. In this work; we introduce Skill Learning In Diversified Environments (SLIDE); a method to discover generalizable skills via automated generation of a diverse set of tasks. As opposed to prior work on unsupervised discovery of skills which incentivizes the skills to produce different outcomes in the same environment; our method pairs each skill with a unique task produced by a trainable task generator. To encourage generalizable skills to emerge; our method trains each skill to specialize in the paired task and maximizes the diversity of the generated tasks. A task discriminator defined on the robot behaviors in the generated tasks is jointly trained to estimate the evidence lower bound of the diversity objective. The learned skills can then be composed in a hierarchical reinforcement learning algorithm to solve unseen target tasks. We demonstrate that the proposed method can effectively learn a variety of robot skills in two tabletop manipulation domains. Our results suggest that the learned skills can effectively improve the robot's performance in various unseen target tasks compared to existing reinforcement learning and skill learning methods.",
        "bibtex": "@INPROCEEDINGS{Fang-RSS-21, \r\n    AUTHOR    = {Kuan Fang AND Yuke Zhu AND Silvio Savarese AND Li Fei-Fei}, \r\n    TITLE     = {{Discovering Generalizable Skills via Automated Generation of Diverse Tasks}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.010} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p010.pdf",
        "supp": "",
        "pdf_size": 2026574,
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=821828555547976770&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "cdeb8713ff",
        "title": "Distributed Covariance Steering with Consensus ADMM for Stochastic Multi-Agent Systems",
        "site": "https://www.roboticsproceedings.org/rss17/p075.html",
        "author": "Augustinos D Saravanos; Alexandros Tsolovikos; Efstathios Bakolas; Evangelos Theodorou",
        "abstract": "In this paper; we address the problem of steering a team of agents under stochastic linear dynamics to prescribed final state means and covariances. The agents operate in a common environment where inter-agent constraints may also be present. In order for our method to be scalable to large-scale systems and computationally efficient; we approach the problem in a distributed control framework using the Alternating Direction Method of Multipliers (ADMM). Each agent solves its own covariance steering problem in parallel; while additional copy variables for its closest neighbors are introduced to ensure that the inter-agent constraints will be satisfied. The inclusion of these additional variables creates a requirement for consensus between original and copy variables that involve the same agent. For this reason; we employ a variation of ADMM for consensus optimization. Simulation results on multi-vehicle systems under uncertainty with collision avoidance constraints illustrate the effectiveness of our algorithm. The substantially improved scalability of our distributed approach with respect to the number of agents is also demonstrated; in comparison with an equivalent centralized scheme.",
        "bibtex": "@INPROCEEDINGS{Saravanos-RSS-21, \r\n    AUTHOR    = {Augustinos D Saravanos AND Alexandros Tsolovikos AND Efstathios Bakolas AND Evangelos Theodorou}, \r\n    TITLE     = {{Distributed Covariance Steering with Consensus ADMM for Stochastic Multi-Agent Systems}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.075} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p075.pdf",
        "supp": "",
        "pdf_size": 1122228,
        "gs_citation": 21,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18003697828786621881&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "Georgia Institute of Technology, GA, USA; The University of Texas at Austin, TX, USA; The University of Texas at Austin, TX, USA; Georgia Institute of Technology, GA, USA",
        "aff_domain": "gatech.edu; ; ; ",
        "email": "gatech.edu; ; ; ",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;0",
        "aff_unique_norm": "Georgia Institute of Technology;The University of Texas at Austin",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.gatech.edu;https://www.utexas.edu",
        "aff_unique_abbr": "Georgia Tech;UT Austin",
        "aff_campus_unique_index": "0;1;1;0",
        "aff_campus_unique": "Georgia;Austin",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "b0a971a3f3",
        "title": "Droplet: Towards Autonomous Underwater Assembly of Modular Structures",
        "site": "https://www.roboticsproceedings.org/rss17/p054.html",
        "author": "Samuel E Lensgraf; Amy Sniffen; Zachary Zitzewitz; Evan Honnold; Jennifer Jain; Weifu Wang; Alberto Quattrini Li; Devin Balkcom",
        "abstract": "This paper presents a first low-cost autonomous robotic system for underwater assembly of mortarless structures. The long-term goal is to enable the construction of large-scale underwater structures; such as retaining walls and artificial reefs. The approach follows the principle of co-design; the 2-DOF manipulator and blocks are designed to complement the localization and control strategies. The blocks and gripper are designed with a connector geometry that removes error during pickup of blocks and drop assembly. This error correction feature allows a simplification of localization and control; which are based on fiducial markers on custom platforms. We developed the proposed system on a low-cost heavily modified BlueROV2 autonomous vehicle — which we call Droplet — with a two-degree of freedom hand that can open and close a gripper and rotate over the yaw. We performed extensive experiments in the pool to evaluate each component and the system as a whole. Results showed a 100% success rate in dropping blocks in the presence of some localization and control errors and the assembly of several different 3D structures composed of up to eight blocks.",
        "bibtex": "@INPROCEEDINGS{Lensgraf-RSS-21, \r\n    AUTHOR    = {Samuel E Lensgraf AND Amy Sniffen AND Zachary Zitzewitz AND Evan Honnold AND Jennifer Jain AND Weifu Wang AND Alberto Quattrini Li AND Devin Balkcom}, \r\n    TITLE     = {{Droplet: Towards Autonomous Underwater Assembly of Modular Structures}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.054} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p054.pdf",
        "supp": "",
        "pdf_size": 27931200,
        "gs_citation": 11,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16194576752546126636&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": ";;;;;;;",
        "aff_domain": ";;;;;;;",
        "email": ";;;;;;;",
        "github": "",
        "project": "",
        "author_num": 8,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "76eae1dc62",
        "title": "Dual Online Stein Variational Inference for Control and Dynamics",
        "site": "https://www.roboticsproceedings.org/rss17/p068.html",
        "author": "Lucas Barcelos; Alexander Lambert; Rafael Oliveira; Paulo Borges; Byron Boots; Fabio Ramos",
        "abstract": "Model predictive control (MPC) schemes have a proven track record for delivering aggressive and robust performance in many challenging control tasks; coping with nonlinear system dynamics; constraints; and observational noise. Despite their success; these methods often rely on simple control distributions; which can limit their performance in highly uncertain and complex environments. MPC frameworks must be able to accommodate changing distributions over system parameters; based on the most recent measurements. In this paper; we devise an implicit variational inference algorithm able to estimate distributions over model parameters and control inputs on-the-fly. The method incorporates Stein Variational gradient descent to approximate the target distributions as a collection of particles; and performs updates based on a Bayesian formulation. This enables the approximation of complex multi-modal posterior distributions; typically occurring in challenging and realistic robot navigation tasks. We demonstrate our approach on both simulated and real-world experiments requiring real-time execution in the face of dynamically changing environments.",
        "bibtex": "@INPROCEEDINGS{Barcelos-RSS-21, \r\n    AUTHOR    = {Lucas Barcelos AND Alexander Lambert AND Rafael Oliveira AND Paulo Borges AND Byron Boots AND Fabio Ramos}, \r\n    TITLE     = {{Dual Online Stein Variational Inference for Control and Dynamics}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.068} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p068.pdf",
        "supp": "",
        "pdf_size": 3130457,
        "gs_citation": 35,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12686653294793733505&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "The University of Sydney‡; Georgia Institute of Technology; The University of Sydney; CSIRO; University of Washington; The University of Sydney+NVIDIA",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "https://github.com/lubaroli/dust",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2;3;4;2+5",
        "aff_unique_norm": "The University of Sydney‡;Georgia Institute of Technology;University of Sydney;Commonwealth Scientific and Industrial Research Organisation;University of Washington;NVIDIA Corporation",
        "aff_unique_dep": ";;;;;",
        "aff_unique_url": ";https://www.gatech.edu;https://www.sydney.edu.au;https://www.csiro.au;https://www.washington.edu;https://www.nvidia.com",
        "aff_unique_abbr": ";Georgia Tech;USYD;CSIRO;UW;NVIDIA",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;2;2;1;2+1",
        "aff_country_unique": ";United States;Australia"
    },
    {
        "id": "409c7caf25",
        "title": "EVPropNet: Detecting Drones By Finding Propellers For Mid-Air Landing And Following",
        "site": "https://www.roboticsproceedings.org/rss17/p074.html",
        "author": "Nitin J Sanket; Chahat Deep Singh; Chethan Parameshwara; Cornelia Fermüller; Guido de Croon; Yiannis Aloimonos",
        "abstract": "The rapid rise of accessibility of unmanned aerial vehicles or drones pose a threat to general security and confidentiality. Most of the commercially available or custom-built drones are multi-rotors and are comprised of multiple propellers. Since these propellers rotate at a high-speed; they are generally the fastest moving parts of an image and cannot be directly \"seen'' by a classical camera without severe motion blur. We utilize a class of sensors that are particularly suitable for such scenarios called event cameras; which have a high temporal resolution; low-latency; and high dynamic range.  In this paper; we model the geometry of a propeller and use it to generate simulated events which are used to train a deep neural network called EVPropNet to detect propellers from the data of an event camera. EVPropNet directly transfers to the real world without any fine-tuning or retraining. We present two applications of our network: (a) tracking and following an unmarked drone and (b) landing on a near-hover drone. We successfully evaluate and demonstrate the proposed approach in many real-world experiments with different propeller shapes and sizes. Our network can detect propellers at a rate of 85.1% even when 60% of the propeller is occluded and can run at upto 35Hz on a 2W power budget. To our knowledge; this is the first deep learning-based solution for detecting propellers (to detect drones). Finally; our applications also show an impressive success rate of 92% and 90% for the tracking and landing tasks respectively.",
        "bibtex": "@INPROCEEDINGS{Sanket-RSS-21, \r\n    AUTHOR    = {Nitin J Sanket AND Chahat Deep Singh AND Chethan Parameshwara AND Cornelia Fermüller AND Guido {de Croon} AND Yiannis Aloimonos}, \r\n    TITLE     = {{EVPropNet: Detecting Drones By Finding Propellers For Mid-Air Landing And Following}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.074} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p074.pdf",
        "supp": "",
        "pdf_size": 8307874,
        "gs_citation": 17,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16373826719122967440&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "Perception and Robotics Group, University of Maryland Institute for Advanced Computer Studies, University of Maryland, College Park; Perception and Robotics Group, University of Maryland Institute for Advanced Computer Studies, University of Maryland, College Park; Perception and Robotics Group, University of Maryland Institute for Advanced Computer Studies, University of Maryland, College Park; Perception and Robotics Group, University of Maryland Institute for Advanced Computer Studies, University of Maryland, College Park; Micro Air Vehicle Laboratory, Delft University of Technology; Perception and Robotics Group, University of Maryland Institute for Advanced Computer Studies, University of Maryland, College Park",
        "aff_domain": "umd.edu;umd.edu;umd.edu;umd.edu;tudelft.nl;umd.edu",
        "email": "umd.edu;umd.edu;umd.edu;umd.edu;tudelft.nl;umd.edu",
        "github": "",
        "project": "http://prg.cs.umd.edu/EVPropNet",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;1;0",
        "aff_unique_norm": "University of Maryland;Micro Air Vehicle Laboratory, Delft University of Technology",
        "aff_unique_dep": "Perception and Robotics Group, University of Maryland Institute for Advanced Computer Studies;",
        "aff_unique_url": "https://www.umd.edu;",
        "aff_unique_abbr": "UMD;",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "College Park;",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "a444224caa",
        "title": "Entropy-Guided Control Improvisation",
        "site": "https://www.roboticsproceedings.org/rss17/p051.html",
        "author": "Marcell J Vazquez-Chanlatte; Sebastian Junges; Daniel J Fremont; Sanjit Seshia",
        "abstract": "High level declarative constraints provide a powerful (and popular) way to define and construct control policies; however; most synthesis algorithms do not support specifying the degree of randomness (unpredictability) of the resulting controller. In many contexts; e.g.; patrolling; testing; behavior prediction; and planning on idealized models; predictable or biased controllers are undesirable.  To address these concerns; we introduce the Entropic Reactive Control Improvisation (ERCI) framework and algorithm that supports synthesizing control policies for stochastic games that are declaratively specified by (i) a hard constraint specifying what must occur (ii) a soft constraint specifying what typically occurs; and (iii) a randomization constraint specifying the unpredictability and variety of the controller; as quantified using causal entropy.  This framework; which extends the state-of-the-art by supporting arbitrary combinations of adversarial and probabilistic uncertainty in the environment; enables a flexible modeling formalism which we argue; theoretically and empirically; remains tractable.",
        "bibtex": "@INPROCEEDINGS{Vazquez-Chanlatte-RSS-21, \r\n    AUTHOR    = {Marcell J Vazquez-Chanlatte AND Sebastian Junges AND Daniel J Fremont AND Sanjit Seshia}, \r\n    TITLE     = {{Entropy-Guided Control Improvisation}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.051} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p051.pdf",
        "supp": "",
        "pdf_size": 554997,
        "gs_citation": 5,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12504020251919447055&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "University of California, Berkeley; University of California, Berkeley; University of California, Santa Cruz; University of California, Berkeley",
        "aff_domain": "berkeley.edu;berkeley.edu;ucsc.edu;berkeley.edu",
        "email": "berkeley.edu;berkeley.edu;ucsc.edu;berkeley.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;0",
        "aff_unique_norm": "University of California, Berkeley;University of California, Santa Cruz",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.berkeley.edu;https://www.ucsc.edu",
        "aff_unique_abbr": "UC Berkeley;UCSC",
        "aff_campus_unique_index": "0;0;1;0",
        "aff_campus_unique": "Berkeley;Santa Cruz",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "85764536fb",
        "title": "Error-Aware Policy Learning: Zero-Shot Generalization in Partially Observable Dynamic Environments",
        "site": "https://www.roboticsproceedings.org/rss17/p065.html",
        "author": "Visak C V Kumar; Sehoon Ha; C. Karen Liu",
        "abstract": "Simulation provides a safe and efficient way to generate useful data for learning complex robotic tasks. However; matching simulation and real-world dynamics can be quite challenging; especially for systems that have a large number of unobserved or unmeasurable parameters; which may lie in the robot dynamics itself or in the environment with which the robot interacts. We introduce a novel approach to tackle such a sim-to-real problem by developing policies capable of adapting to new environments; in a zero-shot manner. Key to our approach is an error-aware policy (EAP) that is explicitly made aware of the effect of unobservable factors during training. An EAP takes as input the predicted future state error in the target environment; which is provided by an error-prediction function; simultaneously trained with the EAP. We validate our approach on an assistive walking device trained to help the human user recover from external pushes. We show that a trained EAP for a hip-torque assistive device can be transferred to different human agents with unseen biomechanical characteristics. In addition; we show that our method can be applied to other standard RL control tasks.",
        "bibtex": "@INPROCEEDINGS{KumarV-RSS-21, \r\n    AUTHOR    = {Visak C V Kumar AND Sehoon Ha AND C. Karen Liu}, \r\n    TITLE     = {{Error-Aware Policy Learning: Zero-Shot Generalization in Partially Observable Dynamic Environments}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.065} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p065.pdf",
        "supp": "",
        "pdf_size": 826227,
        "gs_citation": 4,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17223814414643837082&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "School of Interactive Computing, Georgia Institute of Technology; School of Interactive Computing, Georgia Institute of Technology; Computer Science Department, Stanford University",
        "aff_domain": "gatech.edu;gatech.edu;cs.stanford.edu",
        "email": "gatech.edu;gatech.edu;cs.stanford.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Georgia Institute of Technology;Stanford University",
        "aff_unique_dep": "School of Interactive Computing;Computer Science Department",
        "aff_unique_url": "https://www.gatech.edu;https://www.stanford.edu",
        "aff_unique_abbr": "Georgia Tech;Stanford",
        "aff_campus_unique_index": "0;0;1",
        "aff_campus_unique": "Atlanta;Stanford",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "6b47b9956f",
        "title": "Falling Into Place: Drop Assembly of Interlocking Puzzles",
        "site": "https://www.roboticsproceedings.org/rss17/p055.html",
        "author": "Amy Sniffen; Zezhou Sun; Samuel E Lensgraf; Emily Whiting; Alberto Quattrini Li; Devin Balkcom",
        "abstract": "This paper explores a system for assembling structures by dropping block components into place. During and after assembly; the blocks are held together by geometric interlock; so that fasteners or mortar are only needed to bind the final block to one of its neighbors. Drop assembly is a promising strategy for assembly by swimming or flying robots; as it may allow structures to be built without requiring close contact with the existing structure. The current paper explores a mathematical model of interlock; and presents a particular block design that allows interlock to be achieved using only gravity. Proof-of-concept demonstrations of the system are presented using a low-cost and relatively low-precision robot arm. The paper finally analyzes some of the potential limitations of the approach; particularly including flexing of the structure due to manufacturing tolerance limitations.",
        "bibtex": "@INPROCEEDINGS{Sniffen-RSS-21, \r\n    AUTHOR    = {Amy Sniffen AND Zezhou Sun AND Samuel E Lensgraf AND Emily Whiting AND Alberto Quattrini Li AND Devin Balkcom}, \r\n    TITLE     = {{Falling Into Place: Drop Assembly of Interlocking Puzzles}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.055} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p055.pdf",
        "supp": "",
        "pdf_size": 70674331,
        "gs_citation": 1,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12067613251639567791&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "aff": "Dartmouth College∗; Boston University†; Dartmouth College∗; Boston University†; Dartmouth College∗; Dartmouth College∗",
        "aff_domain": ";;;;;",
        "email": ";;;;;",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;1;0;0",
        "aff_unique_norm": "Dartmouth College∗;Boston University",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://www.bu.edu",
        "aff_unique_abbr": ";BU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "c3ea587f9a",
        "title": "Fast and Feature-Complete Differentiable Physics Engine for Articulated Rigid Bodies with Contact Constraints",
        "site": "https://www.roboticsproceedings.org/rss17/p034.html",
        "author": "Keenon Werling; Dalton Omens; Jeongseok Lee; Ioannis Exarchos; C. Karen Liu",
        "abstract": "We present a fast and feature-complete differentiable physics engine; Nimble (",
        "bibtex": "@INPROCEEDINGS{Werling-RSS-21, \r\n    AUTHOR    = {Keenon Werling AND Dalton Omens AND Jeongseok Lee AND Ioannis Exarchos AND C. Karen Liu}, \r\n    TITLE     = {{Fast and Feature-Complete Differentiable Physics Engine for Articulated Rigid Bodies with Contact Constraints}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.034} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p034.pdf",
        "supp": "",
        "pdf_size": 1335625,
        "gs_citation": 146,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1926358635631551853&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Stanford University; Stanford University; Robotics AI, Amazon; Stanford University; Stanford University",
        "aff_domain": "stanford.edu;stanford.edu;amazon.com;stanford.edu;stanford.edu",
        "email": "stanford.edu;stanford.edu;amazon.com;stanford.edu;stanford.edu",
        "github": "",
        "project": "nimblephysics.org",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;0;0",
        "aff_unique_norm": "Stanford University;Robotics AI, Amazon",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.stanford.edu;",
        "aff_unique_abbr": "Stanford;",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Stanford;",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "f322c2db46",
        "title": "Fast and Memory Efficient Graph Optimization via ICM for Visual Place Recognition",
        "site": "https://www.roboticsproceedings.org/rss17/p091.html",
        "author": "Stefan Schubert; Peer Neubert; Peter Protzel",
        "abstract": "Visual place recognition is the task of finding same places in a set of database images for a given set of query images. This task becomes particularly challenging if the environmental condition changes between database and query; for example from day to night. In this paper; we build upon our recent work on graph optimization for place recognition; where a graph was used to model additional structural knowledge like sequences. A subsequent non-linear least squares optimization (NLSQ) improved the place recognition performance. While this approach achieves very high performance; it is quite slow and memory inefficient. This paper addresses the long runtime and the high memory usage in order to obtain the same or better place recognition performance faster on larger problems. We propose a novel graph optimization procedure that is based on Iterated Conditional Modes (ICM). In addition; we investigate a new cost function for an edge in the graph. Our novel ICM-based approach achieves 9.1msec maximum runtime per query; which is 260x faster than the minimum runtime with NLSQ. Moreover; with ICM we can optimize problems that are not feasible with NLSQ on a full graph due to memory limitations. To demonstrate the superior performance of our ICM-based method; we provide extensive experimental evaluations with the essence of 987 precision-recall curves: Our proposed ICM-based method is compared to the NLSQ-based method as well as to six sequence-based approaches from the literature on 21 sequence combinations from five datasets with four different image descriptors. Our experiments show that our ICM-based method with sequence-exploitation not only improves the NLSQ-based performance by 10% on average while being 385x faster and using more than 60x less memory. It also significantly outperforms all six sequence-based methods from the literature by at least 32% on average with the NetVLAD descriptor while using comparable runtime and memory. Code is available online.",
        "bibtex": "@INPROCEEDINGS{Schubert-RSS-21, \r\n    AUTHOR    = {Stefan Schubert AND Peer Neubert AND Peter Protzel}, \r\n    TITLE     = {{Fast and Memory Efficient Graph Optimization via ICM for Visual Place Recognition}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.091} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p091.pdf",
        "supp": "",
        "pdf_size": 1130981,
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6964474835944156873&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "Chemnitz University of Technology; Chemnitz University of Technology; Chemnitz University of Technology",
        "aff_domain": "etit.tu-chemnitz.de;etit.tu-chemnitz.de;etit.tu-chemnitz.de",
        "email": "etit.tu-chemnitz.de;etit.tu-chemnitz.de;etit.tu-chemnitz.de",
        "github": "",
        "project": "https://www.tu-chemnitz.de/etit/proaut/prstructure",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Chemnitz University of Technology",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.tu-chemnitz.de",
        "aff_unique_abbr": "TUC",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "2aba8569a3",
        "title": "Feature-Based SLAM: Why Simultaneous Localisation and Mapping?",
        "site": "https://www.roboticsproceedings.org/rss17/p009.html",
        "author": "Liang Zhao; Zhehua Mao; Shoudong Huang",
        "abstract": "In this paper; we first prove an interesting result for point feature based SLAM.",
        "bibtex": "@INPROCEEDINGS{Zhao-RSS-21, \r\n    AUTHOR    = {Liang Zhao AND Zhehua Mao AND Shoudong Huang}, \r\n    TITLE     = {{Feature-Based SLAM: Why Simultaneous Localisation and Mapping?}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.009} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p009.pdf",
        "supp": "",
        "pdf_size": 2864870,
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3109028537232512084&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "https://youtu.be/j1T8toqGtDE",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "768f2a7d88",
        "title": "Filter-Based Online System-Parameter Estimation for Multicopter UAVs",
        "site": "https://www.roboticsproceedings.org/rss17/p087.html",
        "author": "Christoph Böhm; Martin Scheiber; Stephan Weiss",
        "abstract": "Accurate system modeling and identification gain importance as tasks executed by autonomously acting unmanned aerial vehicles (UAVs) get more complex and demanding. This paper presents a Bayesian filter approach to online and continuously identify the system parameters; sensor suite calibration states; and vehicle navigation states in a holistic framework. Previous work only tackles subsets of the overall state vector during dedicated phases (e.g.; motionless; online during flight; post-processing). These works often introduce the artificial so-called body frame forcing assumptions on system states; such as the inertia matrix’s principal axes orientation. Our approach estimates the entire state vector in the (usually not precisely known) center of mass; eliminating several assumptions caused by the artificially introduced body frame in other work. Since our approach also estimates geometric states such as the rotor and sensor placements; no hand-made measures to the unknown center of mass are required – the system is fully self-calibrating. A detailed discussion on the system’s observability reveals additionally required (different) measurements for a theoretical and a real N-arm multicopter. We show that easy and precise hand-measurable quantities in real applications can provide the required information. Statistically relevant simulations in Gazebo/RotorS providing ground truth for all states yet having realistic physics validate all our findings.",
        "bibtex": "@INPROCEEDINGS{Bohm-RSS-21, \r\n    AUTHOR    = {Christoph Böhm AND Martin Scheiber AND Stephan Weiss}, \r\n    TITLE     = {{Filter-Based Online System-Parameter Estimation for Multicopter UAVs}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.087} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p087.pdf",
        "supp": "",
        "pdf_size": 1931564,
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12484712907068619316&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "University of Klagenfurt, Austria; University of Klagenfurt, Austria; University of Klagenfurt, Austria",
        "aff_domain": "ieee.org;ieee.org;ieee.org",
        "email": "ieee.org;ieee.org;ieee.org",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Klagenfurt",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.uni-klagenfurt.at",
        "aff_unique_abbr": "Uni Klagenfurt",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Austria"
    },
    {
        "id": "16d4b9180f",
        "title": "GIFT: Generalizable Interaction-aware Functional Tool Affordances without Labels",
        "site": "https://www.roboticsproceedings.org/rss17/p060.html",
        "author": "Dylan Turpin; Liquan Wang; Stavros Tsogkas; Sven Dickinson; Animesh Garg",
        "abstract": "Tool use requires reasoning about the fit between an object’s affordances and the demands of a task. Visual affordance learning can benefit from goal-directed interaction experience; but current techniques rely on human labels or expert demonstrations to generate this data. In this paper; we describe a method that grounds affordances in physical interactions instead; thus removing the need for human labels or expert policies. We use an efficient sampling-based method to generate successful trajectories that provide contact data; which are then used to reveal affordance representations. Our framework; GIFT; operates in two phases: first; we discover visual affordances from goal-directed interaction with a set of procedurally generated tools; second; we train a model to predict new instances of the discovered affordances on novel tools in a self-supervised fashion. In our experiments; we show that GIFT can leverage a sparse keypoint representation to predict grasp and interaction points to accommodate multiple tasks; such as hooking; reaching; and hammering. GIFT outperforms baselines on all tasks and matches a human oracle on two of three tasks using novel tools.",
        "bibtex": "@INPROCEEDINGS{Turpin-RSS-21, \r\n    AUTHOR    = {Dylan Turpin AND Liquan Wang AND Stavros Tsogkas AND Sven Dickinson AND Animesh Garg}, \r\n    TITLE     = {{GIFT: Generalizable Interaction-aware Functional Tool Affordances without Labels}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.060} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p060.pdf",
        "supp": "",
        "pdf_size": 5241320,
        "gs_citation": 35,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7624518271116619405&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "University of Toronto + Vector Institute + Samsung AI Center Toronto; University of Toronto + Vector Institute + Samsung AI Center Toronto; University of Toronto + Samsung AI Center Toronto; University of Toronto + Vector Institute + Samsung AI Center Toronto; University of Toronto + Vector Institute + Nvidia",
        "aff_domain": "cs.toronto.edu;cs.toronto.edu;cs.toronto.edu;cs.toronto.edu;cs.toronto.edu",
        "email": "cs.toronto.edu;cs.toronto.edu;cs.toronto.edu;cs.toronto.edu;cs.toronto.edu",
        "github": "",
        "project": "www.pair.toronto.edu/gift-tools-rss21",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1+2;0+1+2;0+2;0+1+2;0+1+3",
        "aff_unique_norm": "University of Toronto;Vector Institute;Samsung AI Center;NVIDIA Corporation",
        "aff_unique_dep": ";;AI Center;",
        "aff_unique_url": "https://www.utoronto.ca;https://vectorinstitute.ai/;https://www.samsung.com/global/innovation/ai-research/;https://www.nvidia.com",
        "aff_unique_abbr": "U of T;Vector Institute;Samsung AI;NVIDIA",
        "aff_campus_unique_index": "1;1;1;1;",
        "aff_campus_unique": ";Toronto",
        "aff_country_unique_index": "0+0+0;0+0+0;0+0;0+0+0;0+0+1",
        "aff_country_unique": "Canada;United States"
    },
    {
        "id": "5d74fa674b",
        "title": "GROUNDED: The Localizing Ground Penetrating Radar Evaluation Dataset",
        "site": "https://www.roboticsproceedings.org/rss17/p080.html",
        "author": "Teddy Ort; Igor Gilitschenski; Daniela Rus",
        "abstract": "Mapping and localization using surface features is prone to failure due to environment changes such as inclement weather. Recently; Localizing Ground Penetrating Radar (LGPR) has been proposed as an alternative means of localizing using underground features that are stable over time and less affected by surface conditions. However; due to the lack of commercially available LGPR sensors; the wider research community has been largely unable to replicate this work or build new and innovative solutions. We present GROUNDED an open dataset of LGPR scans collected in a variety of environments and weather conditions. By labeling this data with ground truth localization from an RTK-GPS / Inertial Navigation System; and carefully calibrating and time synchronizing the radar scans with ground truth positions; camera imagery; and Lidar data; we enable researchers to build novel localization solutions that are resilient to changing surface conditions. We include 108 individual runs totalling 450 km of driving with LGPR; GPS; Odometry; Camera; and Lidar measurements. We also present two new evaluation benchmarks for 1) Localizing in Weather and 2) Multi-lane Mapping; to enable comparisons of future work supported by the dataset. The dataset can be accessed at",
        "bibtex": "@INPROCEEDINGS{Ort-RSS-21, \r\n    AUTHOR    = {Teddy Ort AND Igor Gilitschenski AND Daniela Rus}, \r\n    TITLE     = {{GROUNDED: The Localizing Ground Penetrating Radar Evaluation Dataset}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.080} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p080.pdf",
        "supp": "",
        "pdf_size": 8369049,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16944237551447554917&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "aff": "Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology; Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology; Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology",
        "aff_domain": "mit.edu;mit.edu;mit.edu",
        "email": "mit.edu;mit.edu;mit.edu",
        "github": "",
        "project": "http://lgprdata.com",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "Computer Science and Artificial Intelligence Laboratory",
        "aff_unique_url": "https://www.csail.mit.edu",
        "aff_unique_abbr": "MIT",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Cambridge",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "1326ff5889",
        "title": "Generalized Comprehensive Motion Theory for High-Order Differential Dynamics",
        "site": "https://www.roboticsproceedings.org/rss17/p032.html",
        "author": "Vincent Samy; Ko Ayusawa; Eiichi Yoshida",
        "abstract": "We address the problem of calculating complex Jacobian matrices that can arise from optimization problems. An example is the inverse optimal control in human motion analysis which has a cost function that depends on the second order time-derivative of torque ̈τ. Thus; its gradient decomposed to; among other; the Jacobian δ ̈τ/δq. We propose a new concept called N-order Comprehensive Motion Transformation Matrix (N-CMTM) to provide an exact analytical solution of several Jacobians. The computational complexity of the basic Jacobian and its N-order time-derivatives computed from the N-CMTM is experimentally shown to be linear to the number of joints Nj. The N-CMTM is based on well-known spatial algebra which makes it available for any type of robots. Moreover; it can be used along classical algorithms. The computational complexity of the construction of the N-CMTM itself is experimentally shown to be N².",
        "bibtex": "@INPROCEEDINGS{Samy-RSS-21, \r\n    AUTHOR    = {Vincent Samy AND Ko Ayusawa AND Eiichi Yoshida}, \r\n    TITLE     = {{Generalized Comprehensive Motion Theory for High-Order Differential Dynamics}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.032} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p032.pdf",
        "supp": "",
        "pdf_size": 578021,
        "gs_citation": 1,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13187459025157013929&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0b42057383",
        "title": "Get to the Point: Learning Lidar Place Recognition and Metric Localisation Using Overhead Imagery",
        "site": "https://www.roboticsproceedings.org/rss17/p003.html",
        "author": "Tim Y. Tang; Daniele De Martini; Paul Newman",
        "abstract": "This paper is about localising a robot in overhead images using lidar.  Specifically; we show how to solve both place recognition and metric localisation of a lidar using only publicly available overhead imagery as a map proxy.  This is in contrast to current approaches that rely on prior sensor maps.  To handle the drastic modality difference (overhead image vs. on the ground lidar); our method learns a representation that purposely and suitably transforms a given overhead image into a collection of 2D points; allowing for direct comparison against lidar scans.  After both modalities are expressed as points; point-based methods can then be leveraged to learn the registration and place recognition task.  Our method is the first to learn the place recognition of a lidar using only overhead imagery; and outperforms prior work for metric localisation with large initial pose offsets.",
        "bibtex": "@INPROCEEDINGS{Tang-RSS-21, \r\n    AUTHOR    = {Tim Y. Tang AND Daniele {De Martini} AND Paul Newman}, \r\n    TITLE     = {{Get to the Point: Learning Lidar Place Recognition and Metric Localisation Using Overhead Imagery}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.003} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p003.pdf",
        "supp": "",
        "pdf_size": 3318927,
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14233349373112303505&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "Mobile Robotics Group, Oxford Robotics Institute, University of Oxford; Mobile Robotics Group, Oxford Robotics Institute, University of Oxford; Mobile Robotics Group, Oxford Robotics Institute, University of Oxford",
        "aff_domain": "robots.ox.ac.uk;robots.ox.ac.uk;robots.ox.ac.uk",
        "email": "robots.ox.ac.uk;robots.ox.ac.uk;robots.ox.ac.uk",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Mobile Robotics Group, Oxford Robotics Institute, University of Oxford",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "a463be42ff",
        "title": "HJB-RL: Initializing Reinforcement Learning with Optimal Control Policies Applied to Autonomous Drone Racing",
        "site": "https://www.roboticsproceedings.org/rss17/p062.html",
        "author": "Keiko Nagami; Mac Schwager",
        "abstract": "In this work we present a planning and control method for a quadrotor in an autonomous drone race. Our method combines the advantages of both model-based optimal control and model-free deep reinforcement learning. We consider a single drone racing on a track marked by a series of gates; through which it must maneuver in minimum time. Firstly we solve the discretized Hamilton-Jacobi-Bellman (HJB) equation to produce a closed-loop policy for a simplified; reduced order model of the drone. Next; we train a deep network policy in a supervised fashion to mimic the HJB policy. Finally; we further train this network using policy gradient reinforcement learning on the full drone dynamics model with a low-level feedback controller in the loop. This gives a deep network policy for controlling the drone to pass through a single gate. In a race course; this policy is applied successively to each new oncoming gate to guide the drone through the course. The resulting policy completes a high-fidelity AirSim drone race with 12 gates in 34.89s (on average); outracing a model-based HJB policy by 33.20s; a supervised learning policy by 1.24s; and a trajectory planning policy by 12.99s; while a model-free RL policy was never able to complete the race.",
        "bibtex": "@INPROCEEDINGS{Nagami-RSS-21, \r\n    AUTHOR    = {Keiko Nagami AND Mac Schwager}, \r\n    TITLE     = {{HJB-RL: Initializing Reinforcement Learning with Optimal Control Policies Applied to Autonomous Drone Racing}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.062} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p062.pdf",
        "supp": "",
        "pdf_size": 5358792,
        "gs_citation": 21,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4953060960423827029&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "Department of Aeronautics and Astronautics, Stanford University; Department of Aeronautics and Astronautics, Stanford University",
        "aff_domain": "stanford.edu;stanford.edu",
        "email": "stanford.edu;stanford.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Stanford University",
        "aff_unique_dep": "Department of Aeronautics and Astronautics",
        "aff_unique_url": "https://www.stanford.edu",
        "aff_unique_abbr": "Stanford",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Stanford",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "56acbb1bf6",
        "title": "Hamiltonian-based Neural ODE Networks on the SE(3) Manifold For Dynamics Learning and Control",
        "site": "https://www.roboticsproceedings.org/rss17/p086.html",
        "author": "Thai P Duong; Nikolay A Atanasov",
        "abstract": "Accurate models of robot dynamics are critical for safe and stable control and generalization to novel operational conditions. Hand-designed models; however; may be insufficiently accurate; even after careful parameter tuning. This motivates the use of machine learning techniques to approximate the robot dynamics over a training set of state-control trajectories. The dynamics of many robots; including ground; aerial; and underwater vehicles; are described in terms of their SE(3) pose and generalized velocity; and satisfy conservation of energy principles. This paper proposes a Hamiltonian formulation over the SE(3) manifold of the structure of a neural ordinary differential equation (ODE) network to approximate the dynamics of a rigid body. In contrast to a black-box ODE network; our formulation guarantees total energy conservation by construction. We develop energy shaping and damping injection control for the learned; potentially under-actuated SE(3) Hamiltonian dynamics to enable a unified approach for stabilization and trajectory tracking with various platforms; including pendulum; rigid-body; and quadrotor systems.",
        "bibtex": "@INPROCEEDINGS{Duong-RSS-21, \r\n    AUTHOR    = {Thai P Duong AND Nikolay A Atanasov}, \r\n    TITLE     = {{Hamiltonian-based Neural ODE Networks on the SE(3) Manifold For Dynamics Learning and Control}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.086} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p086.pdf",
        "supp": "",
        "pdf_size": 1043115,
        "gs_citation": 64,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18357693838006864723&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Department of Electrical and Computer Engineering, University of California, San Diego; Department of Electrical and Computer Engineering, University of California, San Diego",
        "aff_domain": "ucsd.edu;ucsd.edu",
        "email": "ucsd.edu;ucsd.edu",
        "github": "",
        "project": "https://thaipduong.github.io/SE3HamDL/",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of California, San Diego",
        "aff_unique_dep": "Department of Electrical and Computer Engineering",
        "aff_unique_url": "https://www.ucsd.edu",
        "aff_unique_abbr": "UCSD",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "San Diego",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "87a8a77194",
        "title": "Hierarchical Neural Dynamic Policies",
        "site": "https://www.roboticsproceedings.org/rss17/p023.html",
        "author": "Shikhar Bahl; Abhinav Gupta; Deepak Pathak",
        "abstract": "We tackle the problem of generalization to unseen configurations for dynamic tasks in the real world while learning from high-dimensional image input. The family of nonlinear dynamical system-based methods have successfully demonstrated dynamic robot behaviors but have difficulty in generalizing to unseen configurations as well as learning from image inputs. Recent works approach this issue by using deep network policies and reparameterize actions to embed the structure of dynamical systems but still struggle in domains with diverse configurations of image goals; and hence; find it difficult to generalize. In this paper; we address this dichotomy by leveraging embedding the structure of dynamical systems in a hierarchical deep policy learning framework; called Hierarchical Neural Dynamical Policies (H-NDPs). Instead of fitting deep dynamical systems to diverse data directly; H-NDPs form a curriculum by learning local dynamical system-based policies on small regions in state-space and then distill them into a global dynamical system-based policy that operates only from high-dimensional images. H-NDPs additionally provide smooth trajectories; a strong safety benefit in the real world. We perform extensive experiments on dynamic tasks both in the real world (digit writing; scooping; and pouring) and simulation (catching; throwing; picking). We show that H-NDPs are easily integrated with both imitation as well as reinforcement learning setups and achieve state-of-the-art results. Video results at",
        "bibtex": "@INPROCEEDINGS{Bahl-RSS-21, \r\n    AUTHOR    = {Shikhar Bahl AND Abhinav Gupta AND Deepak Pathak}, \r\n    TITLE     = {{Hierarchical Neural Dynamic Policies}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.023} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p023.pdf",
        "supp": "",
        "pdf_size": 5994210,
        "gs_citation": 30,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15299433960069429486&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "6e83743c44",
        "title": "INVIGORATE: Interactive Visual Grounding and Grasping in Clutter",
        "site": "https://www.roboticsproceedings.org/rss17/p020.html",
        "author": "Hanbo Zhang",
        "abstract": "This paper presents INVIGORATE; a robot system that interacts with humans through natural language and grasps a specified object in clutter. The objects may occlude; obstruct; or even stack on top of one another. INVIGORATE embodies several challenges: (i) infer the target object among other occluding objects; from input language expressions and RGB images; (ii) infer object blocking relationships (OBRs) from the images; and (iii) synthesize a multi-step plan to ask questions that disambiguate the target object and to grasp it successfully. We train separate neural networks for object detection; for visual grounding; for question generation; and for OBR detection and grasping. They allow for unrestricted object categories and language expressions; subject to the training datasets. However; errors in visual perception and ambiguity in human languages are inevitable and negatively impact the robot’s performance. To overcome these uncertainties; we build a partially observable Markov decision process (POMDP) that integrates the learned neural network modules. Through approximate POMDP planning; the robot tracks the history of observations and asks disambiguation questions in order to achieve a near-optimal sequence of actions that identify and grasp the target object. INVIGORATE combines the benefits of model-based POMDP planning and data-driven deep learning. Preliminary experiments with INVIGORATE on a Fetch robot show significant benefits of this integrated approach to object grasping in clutter with natural language interactions. A demonstration video is available online:",
        "bibtex": "@INPROCEEDINGS{ZhangLu-RSS-21, \r\n    AUTHOR    = {Hanbo Zhang AND Yunfan Lu AND Cunjun Yu AND David Hsu AND Xuguang Lan AND Nanning Zheng}, \r\n    TITLE     = {{INVIGORATE: Interactive Visual Grounding and Grasping in Clutter}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.020} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p020.pdf",
        "supp": "",
        "pdf_size": 9853404,
        "gs_citation": 77,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17172215551949213610&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://youtu.be/zYakh80SGcU",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "712d46ab7e",
        "title": "Inexact Loops in Robotics Problems",
        "site": "https://www.roboticsproceedings.org/rss17/p004.html",
        "author": "Erik Nelson",
        "abstract": "Loops are pervasive in robotics problems; appearing in mapping and localization; where one is interested in finding loop closure constraints to better approximate robot poses or other estimated quantities; as well as planning and prediction; where one is interested in the homotopy classes of the space through which a robot is moving. We generalize the standard topological definition of a loop to cases where a trajectory passes close to itself; but doesn't necessarily touch; giving a definition that is more practical for real robotics problems. This relaxation leads to new and useful properties of inexact loops; such as their ability to be partitioned into topologically connected sets closely matching the concept of a \"loop closure\"; and the existence of simple and nonsimple loops. Building from these ideas; we introduce several ways to measure properties and quantities of inexact loops on a trajectory; such as the trajectory's \"loop area\" and \"loop density'\"; and use them to compare strategies for sampling representative inexact loops to build constraints in mapping and localization problems.",
        "bibtex": "@INPROCEEDINGS{Nelson-RSS-21, \r\n    AUTHOR    = {Erik Nelson}, \r\n    TITLE     = {{Inexact Loops in Robotics Problems}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.004} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p004.pdf",
        "supp": "",
        "pdf_size": 5171874,
        "gs_citation": 0,
        "gs_cited_by_link": "https://scholar.google.com/scholar?q=related:fOqj9sjGF2wJ:scholar.google.com/&scioq=Inexact+Loops+in+Robotics+Problems&hl=en&as_sdt=0,33",
        "gs_version_total": 5,
        "aff": "Nuro, Inc.",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Nuro, Inc.",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.nuro.ai",
        "aff_unique_abbr": "Nuro",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "4544eb9bd3",
        "title": "Inferring Objectives in Continuous Dynamic Games from Noise-Corrupted Partial State Observations",
        "site": "https://www.roboticsproceedings.org/rss17/p030.html",
        "author": "Lasse Peters; David Fridovich-Keil; Vicenç Rubies-Royo; Claire Tomlin; Cyrill Stachniss",
        "abstract": "Robots and autonomous systems must interact with one another and their environment to provide high-quality services to their users.  Dynamic game theory provides an expressive theoretical framework for modeling scenarios involving multiple agents with differing objectives interacting over time.  A core challenge when formulating a dynamic game is designing objectives for each agent that capture desired behavior.  In this paper; we propose a method for inferring parametric objective models of multiple agents based on observed interactions.  Our inverse game solver jointly optimizes player objectives and continuous-state estimates by coupling them through Nash equilibrium constraints.  Hence; our method is able to directly maximize the observation likelihood rather than other non-probabilistic surrogate criteria.  Our method does not require full observations of game states or player strategies to identify player objectives.  Instead; it robustly recovers this information from noisy; partial state observations.  As a byproduct of estimating player objectives; our method computes a Nash equilibrium trajectory corresponding to those objectives.  Thus; it is suitable for downstream trajectory forecasting tasks.  We demonstrate our method in several simulated traffic scenarios.  Results show that it reliably estimates player objectives from a short sequence of noise-corrupted partial state observations.  Furthermore; using the estimated objectives; our method makes accurate predictions of each player's trajectory.",
        "bibtex": "@INPROCEEDINGS{Peters-RSS-21, \r\n    AUTHOR    = {Lasse Peters AND David Fridovich-Keil AND Vicenç Rubies-Royo AND Claire Tomlin AND Cyrill Stachniss}, \r\n    TITLE     = {{Inferring Objectives in Continuous Dynamic Games from Noise-Corrupted Partial State Observations}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.030} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p030.pdf",
        "supp": "",
        "pdf_size": 1821986,
        "gs_citation": 44,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11111295750694934750&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "University of Bonn, Germany; University of Texas, Austin, USA; University of California, Berkeley, USA; University of California, Berkeley, USA; University of Bonn, Germany",
        "aff_domain": "igg.uni-bonn.de;igg.uni-bonn.de;utexas.edu;berkeley.edu;berkeley.edu",
        "email": "igg.uni-bonn.de;igg.uni-bonn.de;utexas.edu;berkeley.edu;berkeley.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2;2;0",
        "aff_unique_norm": "University of Bonn;University of Texas at Austin;University of California, Berkeley",
        "aff_unique_dep": ";;",
        "aff_unique_url": "https://www.uni-bonn.de;https://www.utexas.edu;https://www.berkeley.edu",
        "aff_unique_abbr": "UBonn;UT Austin;UC Berkeley",
        "aff_campus_unique_index": "1;2;2",
        "aff_campus_unique": ";Austin;Berkeley",
        "aff_country_unique_index": "0;1;1;1;0",
        "aff_country_unique": "Germany;United States"
    },
    {
        "id": "009513df75",
        "title": "Jerk-limited Real-time Trajectory Generation with Arbitrary Target States",
        "site": "https://www.roboticsproceedings.org/rss17/p015.html",
        "author": "Lars Berscheid; Torsten Kroeger",
        "abstract": "We present Ruckig; an algorithm for Online Trajectory Generation (OTG) respecting third-order constraints and complete kinematic target states. Given any initial state of a system with multiple Degrees of Freedom (DoFs); Ruckig calculates a time-optimal trajectory to an arbitrary target state defined by its position; velocity; and acceleration limited by velocity; acceleration; and jerk constraints. The proposed algorithm and implementation allows three contributions: (1) To the best of our knowledge; we derive the first time-optimal OTG algorithm for arbitrary; multi-dimensional target states; in particular including non-zero target acceleration. (2) This is the first open-source prototype of time-optimal OTG with limited jerk and complete time synchronization for multiple DoFs. (3) Ruckig allows for directional velocity and acceleration limits; enabling robots to better use their dynamical resources. We evaluate the robustness and real-time capability of the proposed algorithm on a test suite with over 1 000 000 000 random trajectories as well as in real-world applications.",
        "bibtex": "@INPROCEEDINGS{Berscheid-RSS-21, \r\n    AUTHOR    = {Lars Berscheid AND Torsten Kroeger}, \r\n    TITLE     = {{Jerk-limited Real-time Trajectory Generation with Arbitrary Target States}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.015} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p015.pdf",
        "supp": "",
        "pdf_size": 1176521,
        "gs_citation": 104,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8497373311002567525&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 2,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "37b7f53b73",
        "title": "Language Conditioned Imitation Learning Over Unstructured Data",
        "site": "https://www.roboticsproceedings.org/rss17/p047.html",
        "author": "Corey Lynch",
        "abstract": "Natural language is perhaps the most flexible and intuitive way for humans to communicate tasks to a robot. Prior work in imitation learning typically requires each task be specified with a task id or goal image—something that is often impractical in open-world environments. On the other hand; previous approaches in instruction following allow agent behavior to be guided by language; but typically assume structure in the observations; actuators; or language that limit their applicability to complex settings like robotics. In this work; we present a method for incorporating free-form natural language conditioning into imitation learning. Our approach learns perception from pixels; natural language understanding; and multitask continuous control end-to-end as a single neural network. Unlike prior work in imitation learning; our method is able to incorporate unlabeled and unstructured demonstration data (i.e. no task or language labels). We show this dramatically improves language conditioned performance; while reducing the cost of language annotation to less than 1% of total data. At test time; a single language conditioned visuomotor policy trained with our method can perform a wide variety of robotic manipulation skills in a 3D environment; specified only with natural language descriptions of each task (e.g. \"open the drawer...now pick up the block...now press the green button...\") (see video). To scale up the number of instructions an agent can follow; we propose combining text conditioned policies with large pretrained neural language models. We find this allows a policy to be robust to many out-of-distribution synonym instructions; without requiring new demonstrations. See videos of a human typing live text commands to our agent at",
        "bibtex": "@INPROCEEDINGS{Lynch-RSS-21, \r\n    AUTHOR    = {Corey Lynch AND Pierre Sermanet}, \r\n    TITLE     = {{Language Conditioned Imitation Learning Over Unstructured Data}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.047} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p047.pdf",
        "supp": "",
        "pdf_size": 5405884,
        "gs_citation": 276,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4884515606115291888&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://groundinglanguage.github.io",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "abd422f345",
        "title": "Learned Visual Navigation for Under-Canopy Agricultural Robots",
        "site": "https://www.roboticsproceedings.org/rss17/p019.html",
        "author": "Arun Narenthiran Sivakumar; Sahil Modi; Mateus Valverde Gasparino; Che Ellis; Andres Eduardo Baquero Velasquez; Girish Chowdhary; Saurabh Gupta",
        "abstract": "This paper describes a system for visually guided autonomous navigation of under-canopy farm robots. Low-cost under-canopy robots can drive between crop rows under the plant canopy and accomplish tasks that are infeasible for over-the-canopy drones or larger agricultural equipment. However; autonomously navigating them under the canopy presents a number of challenges: unreliable GPS and LiDAR; high cost of sensing; challenging farm terrain; clutter due to leaves and weeds; and large variability in appearance over the season and across crop types. We address these challenges by building a modular system that leverages machine learning for robust and generalizable perception from monocular RGB images from low-cost cameras; and model predictive control for accurate control in challenging terrain. Our system; CropFollow; is able to autonomously drive 485 meters per intervention on average; outperforming a state-of-the-art LiDAR based system (286 meters per intervention) in extensive field testing spanning over 25 km.",
        "bibtex": "@INPROCEEDINGS{Sivakumar-RSS-21, \r\n    AUTHOR    = {Arun Narenthiran Sivakumar AND Sahil Modi AND Mateus Valverde Gasparino AND Che Ellis AND Andres Eduardo {Baquero Velasquez} AND Girish Chowdhary AND Saurabh Gupta}, \r\n    TITLE     = {{Learned Visual Navigation for Under-Canopy Agricultural Robots}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.019} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p019.pdf",
        "supp": "",
        "pdf_size": 2767642,
        "gs_citation": 76,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16270340081440794620&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": "Department of Agricultural and Biological Engineering, University of Illinois at Urbana-Champaign (UIUC) + Department of Computer Science, UIUC; Department of Computer Science, UIUC; Department of Agricultural and Biological Engineering, University of Illinois at Urbana-Champaign (UIUC); EarthSense Inc.; Department of Agricultural and Biological Engineering, University of Illinois at Urbana-Champaign (UIUC); Department of Agricultural and Biological Engineering, University of Illinois at Urbana-Champaign (UIUC) + Department of Computer Science, UIUC; Department of Electrical and Computer Engineering, UIUC",
        "aff_domain": "illinois.edu; ; ; ; ;illinois.edu; ",
        "email": "illinois.edu; ; ; ; ;illinois.edu; ",
        "github": "",
        "project": "https://ansivakumar.github.io/learned-visual-navigation/",
        "author_num": 7,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;1;0;2;0;0+1;1",
        "aff_unique_norm": "Department of Agricultural and Biological Engineering, University of Illinois at Urbana-Champaign (UIUC);University of Illinois at Urbana-Champaign;EarthSense Inc.",
        "aff_unique_dep": ";Department of Computer Science;",
        "aff_unique_url": ";https://www.cs.uiuc.edu;",
        "aff_unique_abbr": ";UIUC;",
        "aff_campus_unique_index": "1;1;1;1",
        "aff_campus_unique": ";Urbana-Champaign",
        "aff_country_unique_index": "1;1;1;1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "2d0be1c8af",
        "title": "Learning Generalizable Robotic Reward Functions from “In-The-Wild” Human Videos",
        "site": "https://www.roboticsproceedings.org/rss17/p012.html",
        "author": "Annie S. Chen; Suraj Nair; Chelsea Finn",
        "abstract": "We are motivated by the goal of generalist robots that can complete a wide range of tasks across many environments. Critical to this is the robot's ability to acquire some metric of task success or reward; which is necessary for reinforcement learning; planning; or knowing when to ask for help. For a general-purpose robot operating in the real world; this reward function must also be able to generalize broadly across environments; tasks; and objects; while depending only on on-board sensor observations (e.g. RGB images). While deep learning on large and diverse datasets has shown promise as a path towards such generalization in computer vision and natural language; collecting high quality datasets of robotic interaction at scale remains an open challenge. In contrast; “in-the-wild” videos of humans (e.g. YouTube) contain an extensive collection of people doing interesting tasks across a diverse range of settings. In this work; we propose a simple approach; Domain-agnostic Video Discriminator (DVD); that learns multitask reward functions by training a discriminator to classify whether two videos are performing the same task; and can generalize by virtue of learning from a small amount of robot data with a broad dataset of human videos. We find that by leveraging diverse human datasets; this reward function (a) can generalize zero shot to unseen environments; (b) generalize zero shot to unseen tasks; and (c) can be combined with visual model predictive control to solve robotic manipulation tasks on a real WidowX200 robot in an unseen environment from a single human demo.",
        "bibtex": "@INPROCEEDINGS{ChenA-RSS-21, \r\n    AUTHOR    = {Annie S. Chen AND Suraj Nair AND Chelsea Finn}, \r\n    TITLE     = {{Learning Generalizable Robotic Reward Functions from “In-The-Wild” Human Videos}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.012} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p012.pdf",
        "supp": "",
        "pdf_size": 4524800,
        "gs_citation": 134,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12912717599306725070&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "d8199d65f7",
        "title": "Learning Instance-Level N-Ary Semantic Knowledge At Scale For Robots Operating in Everyday Environments",
        "site": "https://www.roboticsproceedings.org/rss17/p035.html",
        "author": "Weiyu Liu; Dhruva Bansal; Angel Daruna; Sonia Chernova",
        "abstract": "Robots operating in everyday environments need to effectively perceive; model; and infer semantic properties of objects. Existing knowledge reasoning frameworks only model binary relations between an object's class label and its semantic properties; unable to collectively reason about object properties detected by different perception algorithms and grounded in diverse sensory modalities. We bridge the gap between multimodal perception and knowledge reasoning by introducing an n-ary representation that models complex; inter-related object properties. To tackle the problem of collecting n-ary semantic knowledge at scale; we propose a transformer neural network that directly generalizes knowledge from observations of object instances. The learned model can reason at different levels of abstraction; effectively predicting unknown properties of objects in different environmental contexts given different amounts of observed information. We quantitatively validate our approach against five prior methods on LINK; a unique dataset we contribute that contains 1457 situated object instances with 15 multimodal properties types and 200 total properties. Compared to the prior state of the art Markov Logic Network; our model obtains a 10% improvement in predicting unknown properties of novel object instances while reducing training and inference time by 150 times. Additionally; we apply our work to a mobile manipulation robot; demonstrating its ability to leverage n-ary reasoning to retrieve objects and actively detect object properties.",
        "bibtex": "@INPROCEEDINGS{Liu-RSS-21, \r\n    AUTHOR    = {Weiyu Liu AND Dhruva Bansal AND Angel Daruna AND Sonia Chernova}, \r\n    TITLE     = {{Learning Instance-Level N-Ary Semantic Knowledge At Scale For Robots Operating in Everyday Environments}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.035} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p035.pdf",
        "supp": "",
        "pdf_size": 9165077,
        "gs_citation": 23,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6839012386806997553&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia; Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia; Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia; Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia",
        "aff_domain": "gatech.edu;gatech.edu;gatech.edu;gatech.edu",
        "email": "gatech.edu;gatech.edu;gatech.edu;gatech.edu",
        "github": "https://github.com/wliu88/LINK",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Institute for Robotics and Intelligent Machines, Georgia Institute of Technology, Atlanta, Georgia",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "b3a68392f9",
        "title": "Learning Proofs of Motion Planning Infeasibility",
        "site": "https://www.roboticsproceedings.org/rss17/p064.html",
        "author": "Sihui Li; Neil Dantam",
        "abstract": "We present a learning-based approach to prove infeasibility of kinematic motion planning problems. Sampling-based motion planners are effective in high-dimensional spaces but are only probabilistically complete. Consequently; these planners cannot provide a definite answer if no plan exists; which is important for high-level scenarios; such as task-motion planning. We propose a combination of bidirectional sampling-based planning (such as RRT-connect) and machine learning to construct an infeasibility proof alongside the two search trees. An infeasibility proof is a closed manifold in the obstacle region of the configuration space that separates the start and goal into disconnected components of the free configuration space. We train the manifold using common machine learning techniques and then triangulate the manifold into a polytope to prove containment in the obstacle region. Under assumptions about learning hyper-parameters and robustness of configuration space optimization; the output is either an infeasibility proof or a motion plan. We demonstrate proof construction for 3-DOF and 4-DOF manipulators and show improvement over previous algorithms.",
        "bibtex": "@INPROCEEDINGS{LiSihui-RSS-21, \r\n    AUTHOR    = {Sihui Li AND Neil Dantam}, \r\n    TITLE     = {{Learning Proofs of Motion Planning Infeasibility}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.064} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p064.pdf",
        "supp": "",
        "pdf_size": 4323263,
        "gs_citation": 23,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7109752164243403034&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Department of Computer Science, Colorado School of Mines, Golden, Colorado 80401; Department of Computer Science, Colorado School of Mines, Golden, Colorado 80401",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Department of Computer Science, Colorado School of Mines, Golden, Colorado 80401",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "e34f2c7bbf",
        "title": "Learning Riemannian Manifolds for Geodesic Motion Skills",
        "site": "https://www.roboticsproceedings.org/rss17/p082.html",
        "author": "Hadi Beik-Mohammadi; Søren Hauberg; Georgios Arvanitidis; Gerhard Neumann; Leonel Rozo",
        "abstract": "For robots to work alongside humans and perform in unstructured environments; they must learn new motion skills and adapt them to unseen situations on the fly. This demands learning models that capture relevant motion patterns; while offering enough flexibility to adapt the encoded skills to new requirements; such as dynamic obstacle avoidance. We introduce a Riemannian manifold perspective on this problem; and propose to learn a Riemannian manifold from human demonstrations on which geodesics are natural motion skills. We realize this with a variational autoencoder (VAE) over the space of position and orientations of the robot end-effector. Geodesic motion skills let a robot plan movements from and to arbitrary points on the data manifold. They also provide a straightforward method to avoid obstacles by redefining the ambient metric in an online fashion.Moreover; geodesics naturally exploit the manifold resulting from multiple-solution settings to design motions that were not demonstrated previously. We test our learning framework usinga7-DoF robotic manipulator; where the robot satisfactorily learns and reproduces realistic skills featuring elaborated motion patterns; avoids previously–unseen obstacles; and generates novel movements in multiple-solution settings.",
        "bibtex": "@INPROCEEDINGS{Beik-Mohammadi-RSS-21, \r\n    AUTHOR    = {Hadi Beik-Mohammadi AND Søren Hauberg AND Georgios Arvanitidis AND Gerhard Neumann AND Leonel Rozo}, \r\n    TITLE     = {{Learning Riemannian Manifolds for Geodesic Motion Skills}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.082} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p082.pdf",
        "supp": "",
        "pdf_size": 8723322,
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14817774971198976315&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "Bosch Center for Artificial Intelligence (BCAI), Renningen, Germany + Autonomous Learning Robots Lab, Karlsruhe Institute of Technology (KIT), Karlsruhe, Germany; Section for Cognitive Systems, Technical University of Denmark (DTU), Lyngby, Denmark; Max Planck Institute for Intelligent Systems (MPI-IS), Tübingen, Germany; Autonomous Learning Robots Lab, Karlsruhe Institute of Technology (KIT), Karlsruhe, Germany; Bosch Center for Artificial Intelligence (BCAI), Renningen, Germany",
        "aff_domain": "de.bosch.com;dtu.dk;tuebingen.mpg.de;kit.edu;de.bosch.com",
        "email": "de.bosch.com;dtu.dk;tuebingen.mpg.de;kit.edu;de.bosch.com",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;2;3;1;0",
        "aff_unique_norm": "Bosch Center for Artificial Intelligence;Autonomous Learning Robots Lab, Karlsruhe Institute of Technology (KIT), Karlsruhe, Germany;Section for Cognitive Systems, Technical University of Denmark (DTU), Lyngby, Denmark;Max Planck Institute for Intelligent Systems (MPI-IS), Tübingen, Germany",
        "aff_unique_dep": "Artificial Intelligence;;;",
        "aff_unique_url": "https://www.bosch-ai.com;;;",
        "aff_unique_abbr": "BCAI;;;",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Renningen;",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Germany;"
    },
    {
        "id": "759f157add",
        "title": "Lyapunov-stable neural-network control",
        "site": "https://www.roboticsproceedings.org/rss17/p063.html",
        "author": "Hongkai Dai; Benoit Landry; Lujie Yang; Marco Pavone; Russ Tedrake",
        "abstract": "Deep learning has had a far reaching impact in robotics. Specifically; deep reinforcement learning algorithms have been highly effective in synthesizing neural-network controllers for a wide range of tasks. However; despite this empirical success; these controllers still lack theoretical guarantees on their performance; such as Lyapunov stability (i.e.; all trajectories of the closed-loop system are guaranteed to converge to a goal state under the control policy). This is in stark contrast to traditional model-based controller design; where principled approaches (like LQR) can synthesize stable controllers with provable guarantees. To address this gap; we propose a generic method to synthesize a Lyapunov-stable neural-network controller; together with a neural-network Lyapunov function to simultaneously certify its stability. Our approach formulates the Lyapunov condition verification as a mixed-integer linear program (MIP). Our MIP verifier either certifies the Lyapunov condition; or generates counter examples that can help improve the candidate controller and the Lyapunov function. We also present an optimization program to compute an inner approximation of the region of attraction for the closed-loop system. We apply our approach to robots including an inverted pendulum; a 2D and a 3D quadrotor; and showcase that our neural-network controller outperforms a baseline LQR controller. The code is open sourced at",
        "bibtex": "@INPROCEEDINGS{DaiH-RSS-21, \r\n    AUTHOR    = {Hongkai Dai AND Benoit Landry AND Lujie Yang AND Marco Pavone AND Russ Tedrake}, \r\n    TITLE     = {{Lyapunov-stable neural-network control}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.063} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p063.pdf",
        "supp": "",
        "pdf_size": 3553405,
        "gs_citation": 158,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14947966020888089039&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Toyota Research Institute; Stanford University; Massachusetts Institute of Technology; Stanford University; Toyota Research Institute + Massachusetts Institute of Technology",
        "aff_domain": "tri.global;stanford.edu;mit.edu;stanford.edu;tri.global",
        "email": "tri.global;stanford.edu;mit.edu;stanford.edu;tri.global",
        "github": "https://github.com/StanfordASL/neural-network-lyapunov",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2;1;0+2",
        "aff_unique_norm": "Toyota Research Institute;Stanford University;Massachusetts Institute of Technology",
        "aff_unique_dep": ";;",
        "aff_unique_url": "https://www.tri.global;https://www.stanford.edu;https://web.mit.edu",
        "aff_unique_abbr": "TRI;Stanford;MIT",
        "aff_campus_unique_index": "1;1;",
        "aff_campus_unique": ";Stanford",
        "aff_country_unique_index": "0;0;0;0;0+0",
        "aff_country_unique": "United States"
    },
    {
        "id": "67b2e52f7f",
        "title": "MAGIC: Learning Macro-Actions for Online POMDP Planning",
        "site": "https://www.roboticsproceedings.org/rss17/p041.html",
        "author": "Yiyuan Lee; Panpan Cai; David Hsu",
        "abstract": "The partially observable Markov decision process (POMDP) is a principled general framework for robot decision making under uncertainty; but POMDP planning suffers from high computational complexity; when long-term planning is required. While temporally-extended macro-actions help to cut down the effective planning horizon and significantly improve computational efficiency; how do we acquire good macro-actions? This paper proposes Macro-Action Generator-Critic (MAGIC); which performs offline learning of macro-actions optimized for online POMDP planning. Specifically; MAGIC learns a macro-action generator end-to-end; using an online planner's performance as the feedback. During online planning; the generator generates on the fly situation-aware macro-actions conditioned on the robot's belief and the environment context. We evaluated MAGIC on several long-horizon planning tasks both in simulation and on a real robot. The experimental results show that the learned macro-actions offer significant benefits in online planning performance; compared with primitive actions and handcrafted macro-actions.",
        "bibtex": "@INPROCEEDINGS{Lee-RSS-21, \r\n    AUTHOR    = {Yiyuan Lee AND Panpan Cai AND David Hsu}, \r\n    TITLE     = {{MAGIC: Learning Macro-Actions for Online POMDP Planning }}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.041} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p041.pdf",
        "supp": "",
        "pdf_size": 5896364,
        "gs_citation": 26,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3865044859276815383&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 6,
        "aff": "School of Computing, National University of Singapore; School of Computing, National University of Singapore; School of Computing, National University of Singapore",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "National University of Singapore",
        "aff_unique_dep": "School of Computing",
        "aff_unique_url": "https://www.nus.edu.sg",
        "aff_unique_abbr": "NUS",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "Singapore"
    },
    {
        "id": "78feb27673",
        "title": "MQA: Answering the Question via Robotic Manipulation",
        "site": "https://www.roboticsproceedings.org/rss17/p044.html",
        "author": "Yuhong Deng",
        "abstract": "In this paper; we propose a novel task; Manipulation Question Answering (MQA); where the robot performs manipulation actions to change the environment in order to answer a given question. To solve this problem; a framework consisting of a QA module and a manipulation module is proposed. For the QA module; we adopt the method for the Visual Question Answering (VQA) task. For the manipulation module; a Deep Q Network (DQN) model is designed to generate manipulation actions for the robot to interact with the environment. We consider the situation where the robot continuously manipulating objects inside a bin until the answer to the question is found. Besides; a novel dataset that contains a variety of object models; scenarios and corresponding question-answer pairs is established in a simulation environment. Extensive experiments have been conducted to validate the effectiveness of the proposed framework.",
        "bibtex": "@INPROCEEDINGS{DengGuo-RSS-21, \r\n    AUTHOR    = {Yuhong Deng AND Di Guo AND Xiaofeng Guo AND Naifu Zhang AND Huaping Liu AND Fuchun Sun}, \r\n    TITLE     = {{MQA: Answering the Question via Robotic Manipulation}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.044} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p044.pdf",
        "supp": "",
        "pdf_size": 5808737,
        "gs_citation": 26,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=107255310468195621&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "89c60b94f7",
        "title": "Manipulator-Independent Representations for Visual Imitation",
        "site": "https://www.roboticsproceedings.org/rss17/p002.html",
        "author": "Yuxiang Zhou; Yusuf Aytar; Konstantinos Bousmalis",
        "abstract": "Imitation learning is an effective tool for robotic learning tasks where specifying a reinforcement learning (RL) reward is not feasible or where the exploration problem is particularly difficult. Imitation; typically behavior cloning or inverse RL; derive a policy from a collection of first-person action-state trajectories. This is contrary to how humans and other animals imitate: we observe a behavior; even from other species; understand its perceived effect on the state of the environment; and figure out what actions our body can perform to reach a similar outcome. In this work; we explore the possibility of third-person visual imitation of manipulation trajectories; only from vision and without access to actions; demonstrated by embodiments different to the ones of our imitating agent. Specifically; we investigate what would be an appropriate representation method with which an RL agent can visually track trajectories of complex manipulation behavior —non-planar with multiple-object interactions— demonstrated by experts with different embodiments. We present a way to train manipulator-independent representations (MIR) that primarily focus on the change in the environment and have all the characteristics that make them suitable for cross-embodiment visual imitation with RL: domain-invariant; temporally smooth; and actionable. We show that with our proposed method our agents are able to imitate; with complex robot control; trajectories from a variety of embodiments and with significant visual and dynamics differences; e.g. simulation-to-reality gap.",
        "bibtex": "@INPROCEEDINGS{Zhou-RSS-21, \r\n    AUTHOR    = {Yuxiang Zhou AND Yusuf Aytar AND Konstantinos Bousmalis}, \r\n    TITLE     = {{Manipulator-Independent Representations for Visual Imitation}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.002} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p002.pdf",
        "supp": "",
        "pdf_size": 4012006,
        "gs_citation": 20,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10310684639165451096&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "DeepMind, London, UK; DeepMind, London, UK; DeepMind, London, UK",
        "aff_domain": "deepmind.com;deepmind.com;deepmind.com",
        "email": "deepmind.com;deepmind.com;deepmind.com",
        "github": "",
        "project": "https://sites.google.com/view/mir4vi",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "DeepMind",
        "aff_unique_dep": "",
        "aff_unique_url": "https://deepmind.com",
        "aff_unique_abbr": "DeepMind",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "London",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United Kingdom"
    },
    {
        "id": "33ff52f85a",
        "title": "Modeling Human Helpfulness with Individual and Contextual Factors for Robot Planning",
        "site": "https://www.roboticsproceedings.org/rss17/p016.html",
        "author": "Amal Nanavati; Christoforos Mavrogiannis; Kevin Weatherwax; Leila Takayama; Maya Cakmak; Siddhartha Srinivasa",
        "abstract": "Robots deployed in human-populated spaces often need human help to effectively complete their tasks. Yet; a robot that asks for help too frequently or at the wrong times may cause annoyance; and a robot that asks too infrequently may be unable to complete its tasks. In this paper; we present a model of humans' helpfulness towards a robot in an office environment; learnt from online user study data. Our key insight is that effectively planning for a task that involves bystander help requires disaggregating individual and contextual factors and explicitly reasoning about uncertainty over individual factors. Our model incorporates the individual factor of latent helpfulness and the contextual factors of human busyness and robot frequency of asking. We integrate the model into a Bayes-Adaptive Markov Decision Process (BAMDP) framework and run a user study that compares it to baseline models that do not incorporate individual or contextual factors. The results show that our model significantly outperforms baseline models by a factor of 1.5X; and it does so by asking for help more effectively: asking 1.2X times less while still receiving more human help on average.",
        "bibtex": "@INPROCEEDINGS{Nanavati-RSS-21, \r\n    AUTHOR    = {Amal Nanavati AND Christoforos Mavrogiannis AND Kevin Weatherwax AND Leila Takayama AND Maya Cakmak AND Siddhartha Srinivasa}, \r\n    TITLE     = {{Modeling Human Helpfulness with Individual and Contextual Factors for Robot Planning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.016} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p016.pdf",
        "supp": "",
        "pdf_size": 1445125,
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8926537061608222206&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "University of Washington; University of Washington; University of California, Santa Cruz; University of California, Santa Cruz; University of Washington; University of Washington",
        "aff_domain": "cs.washington.edu;cs.washington.edu;ucsc.edu;ucsc.edu;cs.washington.edu;cs.washington.edu",
        "email": "cs.washington.edu;cs.washington.edu;ucsc.edu;ucsc.edu;cs.washington.edu;cs.washington.edu",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;1;0;0",
        "aff_unique_norm": "University of Washington;University of California, Santa Cruz",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.washington.edu;https://www.ucsc.edu",
        "aff_unique_abbr": "UW;UCSC",
        "aff_campus_unique_index": "1;1",
        "aff_campus_unique": ";Santa Cruz",
        "aff_country_unique_index": "0;0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "2f133450a6",
        "title": "Move Beyond Trajectories: Distribution Space Coupling for Crowd Navigation",
        "site": "https://www.roboticsproceedings.org/rss17/p053.html",
        "author": "Muchen Sun; Francesca Baldini; Peter Trautman; Todd Murphey",
        "abstract": "Cooperatively avoiding collision is a critical functionality for robots navigating in dense human crowds; failure of which could lead to either overaggressive or overcautious behavior. A necessary condition for cooperative collision avoidance is to couple the prediction of the agents' trajectories with the planning of the robot's trajectory. However; it is unclear that trajectory based cooperative collision avoidance captures the correct agent attributes. In this work we migrate from trajectory based coupling to a formalism that couples agent preference distributions. In particular; we show that preference distributions (probability density functions representing agents' intentions) can capture higher order statistics of agent behaviors; such as willingness to cooperate. Thus; coupling in distribution space exploits more information about inter-agent cooperation than coupling in trajectory space. We thus introduce a general objective for coupled prediction and planning in distribution space; and propose an iterative best response optimization method based on variational analysis with guaranteed sufficient decrease. Based on this analysis; we develop a sampling-based motion planning framework called DistNav that runs in real time on a laptop CPU. We evaluate our approach on challenging scenarios from both real world datasets and simulation environments; and benchmark against a wide variety of model based and machine learning based approaches. The safety and efficiency statistics of our approach outperform all other models. Finally; we find that DistNav is competitive with human safety and efficiency performance.",
        "bibtex": "@INPROCEEDINGS{SunM-RSS-21, \r\n    AUTHOR    = {Muchen Sun AND Francesca Baldini AND Peter Trautman AND Todd Murphey}, \r\n    TITLE     = {{Move Beyond Trajectories: Distribution Space Coupling for Crowd Navigation}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.053} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p053.pdf",
        "supp": "",
        "pdf_size": 3510149,
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10811394008310069624&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "Department of Mechanical Engineering, Northwestern University; Honda Research Institute + California Institute of Technology; Honda Research Institute; Department of Mechanical Engineering, Northwestern University",
        "aff_domain": "u.northwestern.edu;caltech.edu;honda-ri.com;northwestern.edu",
        "email": "u.northwestern.edu;caltech.edu;honda-ri.com;northwestern.edu",
        "github": "",
        "project": "https://sites.google.com/view/distnav/",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1+2;1;0",
        "aff_unique_norm": "Northwestern University;Honda Research Institute;California Institute of Technology",
        "aff_unique_dep": "Department of Mechanical Engineering;;",
        "aff_unique_url": "https://www.northwestern.edu;https://www.honda-ri.com;https://www.caltech.edu",
        "aff_unique_abbr": "NU;HRI;Caltech",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Pasadena",
        "aff_country_unique_index": "0;1+0;1;0",
        "aff_country_unique": "United States;Japan"
    },
    {
        "id": "a7d296cd0b",
        "title": "Moving sidewinding forward: optimizing contact patterns for limbless robots via geometric mechanics",
        "site": "https://www.roboticsproceedings.org/rss17/p031.html",
        "author": "Baxi Chong; Tianyu Wang; Bo Lin; Shengkai Li; Howie Choset; Grigoriy Blekherman; Daniel Goldman",
        "abstract": "Contact planning is crucial to the locomotion performance of limbless robots. Typically; the pattern by which contact is made and broken between the mechanism and its environment determines the motion of the robot. The design of these patterns; often called contact patterns; is a difficult problem. In previous work; the prescription of contact patterns was derived from observations of biological systems or determined empirically from black-box optimization algorithms. However; such heuristic-based contact pattern prescription is only applicable to specific mechanisms; and is challenging to generalize. For example; the stable and effective contact pattern prescribed for a 12-link limbless robot can be neither stable nor effective for a 6-link limbless robot. In this paper; using a geometric motion planning scheme; we develop a framework to design; optimize; and analyze contact patterns to generate effective motion in the desired directions. Inspired by prior work in geometric mechanics; we separate the configuration space into a shape space (the internal joint angles); a contact state space; and a position space; then we optimize the function that couples the contact state space and the shape space. Our framework provides physical insights into the contact pattern design and reveals principles of empirically derived contact pattern prescriptions. Applying this framework; we can not only control the direction of motion of a 12-link limbless robot by modulating the contact patterns; but also design effective sidewinding gaits for robots with fewer motors (e.g.; a 6-link robot). We test our designed gaits by robophysical experiments and obtain excellent agreement. We expect our scheme can be broadly applicable to robots which make/break contact.",
        "bibtex": "@INPROCEEDINGS{Chong-RSS-21, \r\n    AUTHOR    = {Baxi Chong AND Tianyu Wang AND Bo Lin AND Shengkai Li AND Howie Choset AND Grigoriy Blekherman AND Daniel Goldman}, \r\n    TITLE     = {{Moving sidewinding forward: optimizing contact patterns for limbless robots via geometric mechanics}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.031} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p031.pdf",
        "supp": "",
        "pdf_size": 1356971,
        "gs_citation": 12,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2951759422405182247&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": ";;;;;;",
        "aff_domain": ";;;;;;",
        "email": ";;;;;;",
        "github": "",
        "project": "",
        "author_num": 7,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "18f2b77fb7",
        "title": "NeRP: Neural Rearrangement Planning for Unknown Objects",
        "site": "https://www.roboticsproceedings.org/rss17/p072.html",
        "author": "Ahmed H Qureshi; Arsalan Mousavian; Chris Paxton; Michael Yip; Dieter Fox",
        "abstract": "Robots will be expected to manipulate a wide variety of objects in complex and arbitrary ways as they become more widely used in human environments. As such; the rearrangement of objects has been noted to be an important benchmark for AI capabilities in recent years. We propose NeRP (Neural Rearrangement Planning); a deep learning based approach for multi-step neural object rearrangement planning which works with never-before-seen objects; that is trained on simulation data; and generalizes to the real world. We compare NeRP to several naive and model-based baselines; demonstrating that our approach is measurably better and can efficiently arrange unseen objects in fewer steps and with less planning time. Finally; we demonstrate it on several challenging rearrangement problems in the real world.",
        "bibtex": "@INPROCEEDINGS{Qureshi-RSS-21, \r\n    AUTHOR    = {Ahmed H Qureshi AND Arsalan Mousavian AND Chris Paxton AND Michael Yip AND Dieter Fox}, \r\n    TITLE     = {{NeRP: Neural Rearrangement Planning for Unknown Objects}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.072} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p072.pdf",
        "supp": "",
        "pdf_size": 8624364,
        "gs_citation": 84,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10428032768771659707&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "aff": "NVIDIA + University of California San Diego; NVIDIA; NVIDIA; University of California San Diego; NVIDIA + University of Washington",
        "aff_domain": "ucsd.edu;nvidia.com;nvidia.com;ucsd.edu;nvidia.com",
        "email": "ucsd.edu;nvidia.com;nvidia.com;ucsd.edu;nvidia.com",
        "github": "",
        "project": "https://youtu.be/CJb1IzH94e",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0;0;1;0+2",
        "aff_unique_norm": "NVIDIA Corporation;University of California, San Diego;University of Washington",
        "aff_unique_dep": ";;",
        "aff_unique_url": "https://www.nvidia.com;https://ucsd.edu;https://www.washington.edu",
        "aff_unique_abbr": "NVIDIA;UCSD;UW",
        "aff_campus_unique_index": "1;1;",
        "aff_campus_unique": ";San Diego",
        "aff_country_unique_index": "0+0;0;0;0;0+0",
        "aff_country_unique": "United States"
    },
    {
        "id": "48de7025b9",
        "title": "NeuroBEM: Hybrid Aerodynamic Quadrotor Model",
        "site": "https://www.roboticsproceedings.org/rss17/p042.html",
        "author": "Leonard Bauersfeld",
        "abstract": "Quadrotors are extremely agile; so much in fact; that classic first-principle-models come to their limits. Aerodynamic effects; while insignificant at low speeds; become the dominant model defect during high speeds or agile maneuvers. Accurate modeling is needed to design robust high-performance control systems and enable flying close to the platform's physical limits. We propose a hybrid approach fusing first principles and learning to model quadrotors and their aerodynamic effects with unprecedented accuracy. First principles fail to capture such aerodynamic effects; rendering traditional approaches inaccurate when used for simulation or controller tuning. Data-driven approaches try to capture aerodynamic effects with blackbox modeling; such as neural networks; however; they struggle to robustly generalize to arbitrary flight conditions. Our hybrid approach unifies and outperforms both first-principles blade-element momentum theory and learned residual dynamics.  It is evaluated in one of the world's largest motion-capture systems; using autonomous-quadrotor-flight data at speeds up to 65 km/h. The resulting model captures the aerodynamic thrust; torques; and parasitic effects with astonishing accuracy; outperforming existing models with 50% reduced prediction errors; and shows strong generalization capabilities beyond the training set.",
        "bibtex": "@INPROCEEDINGS{Bauersfeld-RSS-21, \r\n    AUTHOR    = {Leonard Bauersfeld AND Elia Kaufmann AND Philipp Foehn AND Sihao Sun AND Davide Scaramuzza}, \r\n    TITLE     = {{NeuroBEM: Hybrid Aerodynamic Quadrotor Model}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.042} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p042.pdf",
        "supp": "",
        "pdf_size": 7989182,
        "gs_citation": 130,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5221915642642385583&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "http://rpg.ifi.uzh.ch/NeuroBEM.html",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "48abd438a9",
        "title": "On Minimizing the Number of Running Buffers for Tabletop Rearrangement",
        "site": "https://www.roboticsproceedings.org/rss17/p033.html",
        "author": "Kai Gao; Siwei Feng; Jingjin Yu",
        "abstract": "For tabletop rearrangement problems with overhand grasps; storage space outside the tabletop workspace; or buffers; can temporarily hold objects which greatly facilitates the resolution of a given rearrangement task. This brings forth the natural question of how many running buffers are required so that certain classes of tabletop rearrangement problems are feasible. In this work; we examine the problem for both the labeled (where each object has a specific goal pose) and the unlabeled (where goal poses of objects are interchangeable) settings. On the structural side; we observe that finding the minimum number of running buffers (MRB) can be carried out on a dependency graph abstracted from a problem instance; and show that computing MRB on dependency graphs is NP-hard. We then prove that under both labeled and unlabeled settings; even for uniform cylindrical objects; the number of required running buffers may grow unbounded as the number of objects to be rearranged increases; we further show that the bound for the unlabeled case is tight. On the algorithmic side; we develop highly effective algorithms for finding MRB for both labeled and unlabeled tabletop rearrangement problems; scalable to over a hundred objects under very high object density. Employing these algorithms; empirical evaluations show that random labeled and unlabeled instances; which more closely mimics real-world setups; have much smaller MRB.",
        "bibtex": "@INPROCEEDINGS{GaoK-RSS-21, \r\n    AUTHOR    = {Kai Gao AND Siwei Feng AND Jingjin Yu}, \r\n    TITLE     = {{On Minimizing the Number of Running Buffers for Tabletop Rearrangement}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.033} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p033.pdf",
        "supp": "",
        "pdf_size": 741182,
        "gs_citation": 17,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5831415586686243148&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "aff": "Department of Computer Science, Rutgers, the State University of New Jersey, Piscataway, NJ, USA; Department of Computer Science, Rutgers, the State University of New Jersey, Piscataway, NJ, USA; Department of Computer Science, Rutgers, the State University of New Jersey, Piscataway, NJ, USA",
        "aff_domain": "rutgers.edu;rutgers.edu;rutgers.edu",
        "email": "rutgers.edu;rutgers.edu;rutgers.edu",
        "github": "github.com/rutgers-arc-lab/running-buffer",
        "project": "youtu.be/hbD-cumF_H4",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Rutgers, the State University of New Jersey",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://rutgers.edu",
        "aff_unique_abbr": "Rutgers",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Piscataway",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "5797d4d6f2",
        "title": "On complementing end-to-end human behavior predictors with planning",
        "site": "https://www.roboticsproceedings.org/rss17/p037.html",
        "author": "Liting Sun; Xiaogang Jia; Anca Dragan",
        "abstract": "High capacity end-to-end approaches for human motion (behavior) prediction have the ability to represent subtle nuances in human behavior; but struggle with robustness to out of distribution inputs and tail events. Planning-based prediction; on the other hand; can reliably output decent-but-not-great predictions: it is much more stable in the face of distribution shift (as we verify in this work); but it has high inductive bias; missing important aspects that drive human decisions; and ignoring cognitive biases that make human behavior suboptimal. In this work; we analyze one family of approaches that strive to get the best of both worlds: use the end-to-end predictor on common cases; but do not rely on it for tail events / out-of-distribution inputs — switch to the planning-based predictor there. We contribute an analysis of different approaches for detecting when to make this switch; using an autonomous driving domain. We find that promising approaches based on ensembling or generative modeling of the training distribution might not be reliable; but that there very simple methods which can perform surprisingly well — including training a classifier to pick up on tell-tale issues in predicted trajectories.",
        "bibtex": "@INPROCEEDINGS{SunL-RSS-21, \r\n    AUTHOR    = {Liting Sun AND Xiaogang Jia AND Anca Dragan}, \r\n    TITLE     = {{On complementing end-to-end human behavior predictors with planning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.037} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p037.pdf",
        "supp": "",
        "pdf_size": 15957158,
        "gs_citation": 22,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1932381241691736694&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "aff": "University of California, Berkeley; University of California, Berkeley; University of California, Berkeley",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of California, Berkeley",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.berkeley.edu",
        "aff_unique_abbr": "UC Berkeley",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Berkeley",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "51deaf1539",
        "title": "On the Importance of Environments in Human-Robot Coordination",
        "site": "https://www.roboticsproceedings.org/rss17/p038.html",
        "author": "Matthew Fontaine",
        "abstract": "When studying robots collaborating with humans; much of the focus has been on robot policies that coordinate fluently with human teammates in collaborative tasks. However; less emphasis has been placed on the effect of the environment on coordination behaviors. To thoroughly explore environments that result in diverse behaviors; we propose a framework for procedural generation of environments that are (1) stylistically similar to human-authored environments; (2) guaranteed to be solvable by the human-robot team; and (3) diverse with respect to coordination measures. We analyze the procedurally generated environments in the Overcooked benchmark domain via simulation and an online user study. Results show that the environments result in qualitatively different emerging behaviors and statistically significant differences in collaborative fluency metrics; even when the robot runs the same planning algorithm.",
        "bibtex": "@INPROCEEDINGS{FontaineB-RSS-21, \r\n    AUTHOR    = {Matthew Fontaine AND Ya-Chuan Hsu AND Yulun Zhang AND Bryon Tjanaka AND Stefanos Nikolaidis}, \r\n    TITLE     = {{On the Importance of Environments in Human-Robot Coordination}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.038} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p038.pdf",
        "supp": "",
        "pdf_size": 1906225,
        "gs_citation": 64,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2107265862774774365&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "9baf8c6062",
        "title": "Optimal Pose and Shape Estimation for Category-level 3D Object Perception",
        "site": "https://www.roboticsproceedings.org/rss17/p025.html",
        "author": "Jingnan Shi; Heng Yang; Luca Carlone",
        "abstract": "We consider a category-level perception problem; where one is given 3D sensor data picturing an object of a given category (e.g.; a car); and has to reconstruct the pose and shape of the object despite intra-class variability (i.e.; different car models have different shapes). We consider an active shape model; where—for an object category— we are given a library of potential CAD models describing objects in that category; and we adopt a standard formulation where pose and shape estimation are formulated as a non-convex optimization. Our first contribution is to provide the first certifiably optimal solver for pose and shape estimation. In particular; we show that rotation estimation can be decoupled from the estimation of the object translation and shape; and we demonstrate that (i) the optimal object rotation can be computed via a tight (small-size) semidefinite relaxation; and (ii) the translation and shape parameters can be computed in closed-form given the rotation. Our second contribution is to add an outlier rejection layer to our solver; hence making it robust to a large number of misdetections. Towards this goal; we wrap our optimal solver in a robust estimation scheme based on graduated non-convexity. To further enhance robustness to outliers; we also develop the first graph-theoretic formulation to prune outliers in category-level perception; which removes outliers via convex hull and maximum clique computations; the resulting approach is robust to 70 − 90% outliers. Our third contribution is an extensive experimental evaluation. Besides providing an ablation study on a simulated dataset and on the PASCAL3D+ dataset; we combine our solver with a deep-learned keypoint detector; and show that the resulting approach improves over the state of the art in vehicle pose estimation in the ApolloScape driving datasets.",
        "bibtex": "@INPROCEEDINGS{Shi-RSS-21, \r\n    AUTHOR    = {Jingnan Shi AND Heng Yang AND Luca Carlone}, \r\n    TITLE     = {{Optimal Pose and Shape Estimation for Category-level 3D Object Perception}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.025} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p025.pdf",
        "supp": "",
        "pdf_size": 37191038,
        "gs_citation": 27,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4136299456378648150&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "Laboratory for Information & Decision Systems (LIDS); Laboratory for Information & Decision Systems (LIDS); Laboratory for Information & Decision Systems (LIDS)",
        "aff_domain": "mit.edu;mit.edu;mit.edu",
        "email": "mit.edu;mit.edu;mit.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Massachusetts Institute of Technology",
        "aff_unique_dep": "Laboratory for Information & Decision Systems",
        "aff_unique_url": "http://lids.mit.edu",
        "aff_unique_abbr": "LIDS",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Cambridge",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "95f534f7a9",
        "title": "PROMPT: Probabilistic Motion Primitives based Trajectory Planning",
        "site": "https://www.roboticsproceedings.org/rss17/p058.html",
        "author": "Tobias Loew; Tirthankar Bandyopadhyay; Jason Williams; Paulo Borges",
        "abstract": "We present a novel approach to motion planning for autonomous ground vehicles by formulating motion primitives as probabilistic distributions of trajectories (aka probabilistic motion primitives - ProMP) and performing stochastic optimisation on them for finding an optimal path.  We show that compared to the traditional approach of using discrete motion primitives or direct stochastic optimisation of the whole path; incorporating ProMPs enables higher quality of paths by enabling constraint conditioning; combination and blending of probability distributions.  We present two motion planners utilizing this approach: feasibility-based trajectory sampling (PROMPT-S) and stochastic gradient-based trajectory optimisation (PROMPT-O).  We show simulation results of our approach outperforming state-of-the-art optimisation as well as discrete motion primitives-based planners.  We additionally illustrate the versatility of our approach by showing PROMPT's ability to handle significantly skewed motion primitives; e.g; as induced by steering failure in AGVs as well as the composition of motion primitives to perform complex maneuvers. Finally; we demonstrate the practicality of these planners by implementing them on a real self-driving vehicle navigating on structured and unstructured off-road terrains.",
        "bibtex": "@INPROCEEDINGS{Loew-RSS-21, \r\n    AUTHOR    = {Tobias Loew AND Tirthankar Bandyopadhyay AND Jason Williams AND Paulo Borges}, \r\n    TITLE     = {{PROMPT: Probabilistic Motion Primitives based Trajectory Planning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.058} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p058.pdf",
        "supp": "",
        "pdf_size": 5861899,
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7467759895562855573&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "Robotics and Autonomous Systems Group, CSIRO, Pullenvale, QLD 4069 + Idiap Research Institute, Martigny, Switzerland; Robotics and Autonomous Systems Group, CSIRO, Pullenvale, QLD 4069; Robotics and Autonomous Systems Group, CSIRO, Pullenvale, QLD 4069; Robotics and Autonomous Systems Group, CSIRO, Pullenvale, QLD 4069",
        "aff_domain": "idiap.ch;csiro.au;data61.csiro.au;csiro.au",
        "email": "idiap.ch;csiro.au;data61.csiro.au;csiro.au",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0;0;0",
        "aff_unique_norm": "Robotics and Autonomous Systems Group, CSIRO, Pullenvale, QLD 4069;Idiap Research Institute",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://www.idiap.ch",
        "aff_unique_abbr": ";Idiap",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Martigny",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";Switzerland"
    },
    {
        "id": "18acdfc649",
        "title": "Planning Multimodal Exploratory Actions for Online Robot Attribute Learning",
        "site": "https://www.roboticsproceedings.org/rss17/p005.html",
        "author": "Xiaohan Zhang; Jivko Sinapov; Shiqi Zhang",
        "abstract": "Robots frequently need to perceive object attributes; such as \"red;\" \"heavy;\" and \"empty;\" using multimodal exploratory actions; such as \"look;\" \"lift;\" and \"shake.\" Robot attribute learning algorithms aim to learn an observation model for each perceivable attribute given an exploratory action. Once the attribute models are learned; they can be used to identify attributes of new objects; answering questions; such as \"Is this object red and empty?\" Attribute learning and identification are being treated as two separate problems in the literature. In this paper; we first define a new problem called online robot attribute learning (On-RAL); where the robot works on attribute learning and attribute identification simultaneously. Then we develop an algorithm called information-theoretic reward shaping (ITRS) that actively addresses the trade-off between exploration and exploitation in On-RAL problems. ITRS was compared with competitive robot attribute learning baselines; and experimental results demonstrate ITRS' superiority in learning efficiency and identification accuracy.",
        "bibtex": "@INPROCEEDINGS{ZhangX-RSS-21, \r\n    AUTHOR    = {Xiaohan Zhang AND Jivko Sinapov AND Shiqi Zhang}, \r\n    TITLE     = {{Planning Multimodal Exploratory Actions for Online Robot Attribute Learning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.005} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p005.pdf",
        "supp": "",
        "pdf_size": 2554065,
        "gs_citation": 4,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3301165768588068686&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "State University of New York at Binghamton; Tufts University; State University of New York at Binghamton",
        "aff_domain": "binghamton.edu;tufts.edu;binghamton.edu",
        "email": "binghamton.edu;tufts.edu;binghamton.edu",
        "github": "",
        "project": "https://sites.google.com/view/on-ral",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "State University of New York at Binghamton;Tufts University",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.binghamton.edu;https://www.tufts.edu",
        "aff_unique_abbr": "SUNY Binghamton;Tufts",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Binghamton;",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "6da7751ee8",
        "title": "Policy Transfer across Visual and Dynamics Domain Gaps via Iterative Grounding",
        "site": "https://www.roboticsproceedings.org/rss17/p006.html",
        "author": "Grace Zhang; Linghan Zhong; Youngwoon Lee; Joseph J Lim",
        "abstract": "The ability to transfer a policy from one environment to another is a promising avenue for efficient robot learning in realistic settings where task supervision is not available. This can allow us to take advantage of environments well suited for training; such as simulators or laboratories; to learn a policy for a real robot in a home or office. To succeed; such policy transfer must overcome both the visual domain gap (e.g. different illumination or background) and the dynamics domain gap (e.g. different robot calibration or modelling error) between source and target environments. However; prior policy transfer approaches either cannot handle a large domain gap or can only address one type of domain gap at a time. In this paper; we propose a novel policy transfer method with iterative \"environment grounding\"; IDAPT; that alternates between (1) directly minimizing both visual and dynamics domain gaps by grounding the source environment in the target environment domains; and (2) training a policy on the grounded source environment. This iterative training progressively aligns the domains between the two environments and adapts the policy to the target environment. Once trained; the policy can be directly executed on the target environment. The empirical results on locomotion and robotic manipulation tasks demonstrate that our approach can effectively transfer a policy across visual and dynamics domain gaps with minimal supervision and interaction with the target environment. Videos and code are available at",
        "bibtex": "@INPROCEEDINGS{ZhangG-RSS-21, \r\n    AUTHOR    = {Grace Zhang AND Linghan Zhong AND Youngwoon Lee AND Joseph J Lim}, \r\n    TITLE     = {{Policy Transfer across Visual and Dynamics Domain Gaps via Iterative Grounding}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.006} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p006.pdf",
        "supp": "",
        "pdf_size": 16235712,
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11536836150651255021&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "USC; USC; USC + NA VER AI Lab; USC + NA VER AI Lab",
        "aff_domain": "usc.edu;usc.edu;usc.edu;usc.edu",
        "email": "usc.edu;usc.edu;usc.edu;usc.edu",
        "github": "",
        "project": "https://clvrai.com/idapt",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0+1;0+1",
        "aff_unique_norm": "University of Southern California;NAVER Corporation",
        "aff_unique_dep": ";AI Lab",
        "aff_unique_url": "https://www.usc.edu;https://www.naver.com",
        "aff_unique_abbr": "USC;NAVER",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Los Angeles;",
        "aff_country_unique_index": "0;0;0+1;0+1",
        "aff_country_unique": "United States;South Korea"
    },
    {
        "id": "d29b7d2822",
        "title": "Potential iLQR: A Potential-Minimizing Controller for Planning Multi-Agent Interactive Trajectories",
        "site": "https://www.roboticsproceedings.org/rss17/p084.html",
        "author": "Talha Kavuncu; Ayberk Yaraneri; Negar Mehr",
        "abstract": "Many robotic applications involve interactions between multiple agents where an agent's decisions affect the behavior of other agents. Such behaviors can be captured by the equilibria of differential games which provide an expressive framework for modeling the agents' mutual influence. However; finding the equilibria of differential games is in general challenging as it involves solving a set of coupled optimal control problems. In this work; we propose to leverage the special structure of multi-agent interactions to generate interactive trajectories by simply solving a single optimal control problem; namely; the optimal control problem associated with minimizing the potential function of the differential game. Our key insight is that for a certain class of multi-agent interactions; the underlying differential game is indeed a potential differential game for which equilibria can be found by solving a single optimal control problem. We introduce such an optimal control problem and build on single-agent trajectory optimization methods to develop a computationally tractable and scalable algorithm for planning multi-agent interactive trajectories. We will demonstrate the performance of our algorithm in simulation and show that our algorithm outperforms the state-of-the-art game solvers. To further show the real-time capabilities of our algorithm; we will demonstrate the application of our proposed algorithm in a set of experiments involving interactive trajectories for two quadcopters.",
        "bibtex": "@INPROCEEDINGS{Kavuncu-RSS-21, \r\n    AUTHOR    = {Talha Kavuncu AND Ayberk Yaraneri AND Negar Mehr}, \r\n    TITLE     = {{Potential iLQR: A Potential-Minimizing Controller for Planning Multi-Agent Interactive Trajectories}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.084} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p084.pdf",
        "supp": "",
        "pdf_size": 22330846,
        "gs_citation": 38,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15599507284440799388&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": "Aerospace Engineering, UIUC; Aerospace Engineering, UIUC; Aerospace Engineering, UIUC",
        "aff_domain": "illinois.edu;illinois.edu;illinois.edu",
        "email": "illinois.edu;illinois.edu;illinois.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Aerospace Engineering, UIUC",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "ea6a04e36b",
        "title": "Probabilistic Discriminative Models address the Tactile Perceptual Aliasing Problem",
        "site": "https://www.roboticsproceedings.org/rss17/p057.html",
        "author": "John Lloyd; Yijiong Lin; Nathan Lepora",
        "abstract": "In this paper; our aim is to highlight Tactile Perceptual Aliasing as a problem when using deep neural networks and other discriminative models. Perceptual aliasing will arise wherever a physical variable extracted from tactile data is subject to ambiguity between stimuli that are physically distinct. Here we address this problem using a probabilistic discriminative model implemented as a 5-component mixture density network comprised of a deep neural network that predicts the parameters of a Gaussian mixture model. We show that discriminative regression models such as deep neural networks and Gaussian process regression perform poorly on aliased data; with accurate predictions only when the sources of aliasing are removed. In contrast; the mixture density network identifies aliased data with improved prediction accuracy. The uncertain predictions of the model form patterns that are consistent with the various sources of perceptual ambiguity. In our view; perceptual aliasing will become an unavoidable issue for robot touch as the field progresses to training robots that act in uncertain and unstructured environments; such as with deep reinforcement learning.",
        "bibtex": "@INPROCEEDINGS{Lloyd-RSS-21, \r\n    AUTHOR    = {John Lloyd AND Yijiong Lin AND Nathan Lepora}, \r\n    TITLE     = {{Probabilistic Discriminative Models address the Tactile Perceptual Aliasing Problem}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.057} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p057.pdf",
        "supp": "",
        "pdf_size": 2579788,
        "gs_citation": 3,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8331282581258638520&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Department of Engineering Mathematics and Bristol Robotics Laboratory, University of Bristol, U.K.; Department of Engineering Mathematics and Bristol Robotics Laboratory, University of Bristol, U.K.; Department of Engineering Mathematics and Bristol Robotics Laboratory, University of Bristol, U.K.",
        "aff_domain": "bristol.ac.uk;bristol.ac.uk;bristol.ac.uk",
        "email": "bristol.ac.uk;bristol.ac.uk;bristol.ac.uk",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Department of Engineering Mathematics and Bristol Robotics Laboratory, University of Bristol, U.K.",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "f536cf9fa6",
        "title": "Provably Safe and Efficient Motion Planning with Uncertain Human Dynamics",
        "site": "https://www.roboticsproceedings.org/rss17/p050.html",
        "author": "Shen Li; Nadia Figueroa; Ankit Shah; Julie A. Shah",
        "abstract": "Ensuring human safety without unnecessarily impacting task efficiency during human-robot interactive manipulation tasks is a critical challenge. In this work; we formally define human physical safety as collision avoidance or safe impact in the event of a collision. We developed a motion planner that theoretically guarantees safety; with a high probability; under the uncertainty in human dynamic models. Our two-pronged definition of safety is able to unlock the planner's potential in finding efficient plans even when collision avoidance is nearly impossible. The improved efficiency is empirically demonstrated in both a simulated goal-reaching domain and a real-world robot-assisted dressing domain. We provide a unified view of two approaches to safe human-robot interaction: human-aware motion planners that use predictive human models and reactive controllers that compliantly handle collisions.",
        "bibtex": "@INPROCEEDINGS{Li-RSS-21, \r\n    AUTHOR    = {Shen Li AND Nadia Figueroa AND Ankit Shah AND Julie A. Shah}, \r\n    TITLE     = {{Provably Safe and Efficient Motion Planning with Uncertain Human Dynamics}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.050} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p050.pdf",
        "supp": "",
        "pdf_size": 6103196,
        "gs_citation": 29,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6813455888653435878&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "Computer Science and Artificial Intelligence Laboratory (CSAIL), Massachusetts Institute of Technology, Cambridge, MA 02139, USA; Computer Science and Artificial Intelligence Laboratory (CSAIL), Massachusetts Institute of Technology, Cambridge, MA 02139, USA; Computer Science and Artificial Intelligence Laboratory (CSAIL), Massachusetts Institute of Technology, Cambridge, MA 02139, USA; Computer Science and Artificial Intelligence Laboratory (CSAIL), Massachusetts Institute of Technology, Cambridge, MA 02139, USA",
        "aff_domain": "csail.mit.edu;csail.mit.edu;csail.mit.edu;csail.mit.edu",
        "email": "csail.mit.edu;csail.mit.edu;csail.mit.edu;csail.mit.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Computer Science and Artificial Intelligence Laboratory (CSAIL), Massachusetts Institute of Technology, Cambridge, MA 02139, USA",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "9498396a35",
        "title": "Proximal and Sparse Resolution of Constrained Dynamic Equations",
        "site": "https://www.roboticsproceedings.org/rss17/p017.html",
        "author": "Justin Carpentier; Rohan Budhiraja; Nicolas Mansard",
        "abstract": "Control of robots with kinematic constraints like loop-closure constraints or interactions with the environment requires solving the underlying constrained dynamics equations of motion. Several approaches have been proposed so far in the literature to solve these constrained optimization problems; for instance by either taking advantage in part of the sparsity of the kinematic tree or by considering an explicit formulation of the constraints in the problem resolution. Yet; not all the constraints allow an explicit formulation and in general; approaches of the state of the art suffer from singularity issues; especially in the context of redundant or singular constraints. In this paper; we propose a unified approach to solve forward dynamics equations involving constraints in an efficient; generic and robust manner. To this aim; we first (i) propose a proximal formulation of the constrained dynamics which converges to an optimal solution in the least-square sense even in the presence of singularities.Based on this proximal formulation; we introduce (ii) a sparse Cholesky factorization of the underlying Karush–Kuhn–Tucker matrix related to the constrained dynamics; which exploits at best the sparsity of the kinematic structure of the robot. We also show (iii) that it is possible to extract from this factorization the Cholesky decomposition associated to the so-called Operational Space Inertia Matrix; inherent to task-based control frameworks or physic simulations. These new formulation and factorization;implemented within the Pinocchio library; are benchmark on various robotic platforms; ranging from classic robotic arms or quadrupeds to humanoid robots with closed kinematic chains; and show how they significantly outperform alternative solutions of the state of the art by a factor 2 or more.",
        "bibtex": "@INPROCEEDINGS{Carpentier-RSS-21, \r\n    AUTHOR    = {Justin Carpentier AND Rohan Budhiraja AND Nicolas Mansard}, \r\n    TITLE     = {{Proximal and Sparse Resolution of Constrained Dynamic Equations}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.017} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p017.pdf",
        "supp": "",
        "pdf_size": 7206730,
        "gs_citation": 53,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17641207995866631873&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "Inria, ´Ecole normale supérieure, CNRS, PSL Research University; Inria Paris; LAAS-CNRS, ANITI, University of Toulouse",
        "aff_domain": "inria.fr;inria.fr;laas.fr",
        "email": "inria.fr;inria.fr;laas.fr",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1",
        "aff_unique_norm": "Inria;LAAS-CNRS, ANITI, University of Toulouse",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.inria.fr;",
        "aff_unique_abbr": "Inria;",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Paris",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "France;"
    },
    {
        "id": "c8e51ee530",
        "title": "RMA: Rapid Motor Adaptation for Legged Robots",
        "site": "https://www.roboticsproceedings.org/rss17/p011.html",
        "author": "Ashish Kumar; Zipeng Fu; Deepak Pathak; Jitendra Malik",
        "abstract": "Successful real-world deployment of legged robots would require them to",
        "bibtex": "@INPROCEEDINGS{KumarA-RSS-21, \r\n    AUTHOR    = {Ashish Kumar AND Zipeng Fu AND Deepak Pathak AND Jitendra Malik}, \r\n    TITLE     = {{RMA: Rapid Motor Adaptation for Legged Robots}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.011} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p011.pdf",
        "supp": "",
        "pdf_size": 15949909,
        "gs_citation": 643,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10719514148749074367&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "UC Berkeley; Carnegie Mellon University; Carnegie Mellon University; UC Berkeley + Facebook",
        "aff_domain": "berkeley.edu;cmu.edu;cmu.edu;berkeley.edu",
        "email": "berkeley.edu;cmu.edu;cmu.edu;berkeley.edu",
        "github": "https://github.com/ashish-kmr/rma-legged-robots",
        "project": "https://ashish-kmr.github.io/rma-legged-robots/",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;0+2",
        "aff_unique_norm": "University of California, Berkeley;Carnegie Mellon University;Facebook, Inc.",
        "aff_unique_dep": ";;",
        "aff_unique_url": "https://www.berkeley.edu;https://www.cmu.edu;https://www.facebook.com",
        "aff_unique_abbr": "UC Berkeley;CMU;FB",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Berkeley;",
        "aff_country_unique_index": "0;0;0;0+0",
        "aff_country_unique": "United States"
    },
    {
        "id": "d9c24d5d25",
        "title": "RMP2: A Structured Composable Policy Class for Robot Learning",
        "site": "https://www.roboticsproceedings.org/rss17/p092.html",
        "author": "Anqi Li",
        "abstract": "We consider the problem of learning motion policies for acceleration-based robotics systems with a structured policy class. We leverage a multi-task control framework called RMPflow which has been successfully applied in many robotics problems. Using RMPflow as a structured policy class in learning has several benefits; such as sufficient expressiveness; the flexibility to inject different levels of prior knowledge as well as the ability to transfer policies between robots. However; implementing a system for end-to-end learning of RMPflow policies faces several computational challenges. In this work; we re-examine the RMPflow algorithm and propose a more practical alternative; called RMP2; that uses modern automatic differentiation tools (such as TensorFlow and PyTorch) to compute RMPflow policies. Our new design retains the strengths of RMPflow while bringing in advantages from automatic differentiation; including 1) simple programming interfaces to designing complex transformations; 2) support of general directed acyclic graph (DAG) transformation structures; 3) end-to-end differentiability for policy learning; 4) improved computational efficiency. Because of these features; RMP2 can be treated as a structured policy class for efficient robot learning that is suitable for encoding domain knowledge. Our experiments show that using the structured policy class given by RMP2 can improve policy performance and safety in reinforcement learning tasks for goal reaching in cluttered space. The video for our experimental results can be found at",
        "bibtex": "@INPROCEEDINGS{LiA-RSS-21, \r\n    AUTHOR    = {Anqi Li AND Ching-An Cheng AND Muhammad Asif Rana AND Man Xie AND Karl {Van Wyk} AND Nathan Ratliff AND Byron Boots}, \r\n    TITLE     = {{RMP2: A Structured Composable Policy Class for Robot Learning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.092} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p092.pdf",
        "supp": "",
        "pdf_size": 1230688,
        "gs_citation": 21,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9339415389788012564&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "https://github.com/UWRobotLearning/rmp2",
        "project": "https://youtu.be/dliQ-jsYhgI",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "7cd605a127",
        "title": "Radar Odometry Combining Probabilistic Estimation and Unsupervised Feature Learning",
        "site": "https://www.roboticsproceedings.org/rss17/p029.html",
        "author": "Keenan Burnett",
        "abstract": "This paper presents a radar odometry method that combines probabilistic trajectory estimation and deep learned features without needing groundtruth pose information. The feature network is trained unsupervised; using only the on-board radar data. With its theoretical foundation based on a data likelihood objective; our method leverages a deep network for processing rich radar data; and a non-differentiable classic estimator for probabilistic inference. We provide extensive experimental results on both the publicly available Oxford Radar RobotCar Dataset and an additional 100 km of driving collected in an urban setting. Our sliding-window implementation of radar odometry outperforms most hand-crafted methods and approaches the current state of the art without requiring a groundtruth trajectory for training. We also demonstrate the effectiveness of radar odometry under adverse weather conditions. Code for this project can be found at:",
        "bibtex": "@INPROCEEDINGS{Burnett-RSS-21, \r\n    AUTHOR    = {Keenan Burnett AND David J. Yoon AND Angela P Schoellig AND Tim Barfoot}, \r\n    TITLE     = {{Radar Odometry Combining Probabilistic Estimation and Unsupervised Feature Learning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.029} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p029.pdf",
        "supp": "",
        "pdf_size": 4282849,
        "gs_citation": 70,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4107190929195214503&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "https://github.com/utiasASRL/hero radar odometry",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "c78aef0dfb",
        "title": "Real-Time Multi-View 3D Human Pose Estimation using Semantic Feedback to Smart Edge Sensors",
        "site": "https://www.roboticsproceedings.org/rss17/p040.html",
        "author": "Simon Bultmann; Sven Behnke",
        "abstract": "We present a novel method for estimation of 3D human poses from a multi-camera setup; employing distributed smart edge sensors coupled with a backend through a semantic feedback loop.  2D joint detection for each camera view is performed locally on a dedicated embedded inference processor.  Only the semantic skeleton representation is transmitted over the network and raw images remain on the sensor board.  3D poses are recovered from 2D joints on a central backend; based on triangulation and a body model which incorporates prior knowledge of the human skeleton.  A feedback channel from backend to individual sensors is implemented on a semantic level.  The allocentric 3D pose is backprojected into the sensor views where it is fused with 2D joint detections.  The local semantic model on each sensor can thus be improved by incorporating global context information.  The whole pipeline is capable of real-time operation.  We evaluate our method on three public datasets; where we achieve state-of-the-art results and show the benefits of our feedback architecture; as well as in our own setup for multi-person experiments. Using the feedback signal improves the 2D joint detections and in turn the estimated 3D poses.",
        "bibtex": "@INPROCEEDINGS{Bultmann -RSS-21, \r\n    AUTHOR    = {Simon Bultmann AND Sven Behnke}, \r\n    TITLE     = {{Real-Time Multi-View 3D Human Pose Estimation using Semantic Feedback to Smart Edge Sensors}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.040} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p040.pdf",
        "supp": "",
        "pdf_size": 10207571,
        "gs_citation": 43,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5197333706096838600&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "University of Bonn, Germany; University of Bonn, Germany",
        "aff_domain": "ais.uni-bonn.de;cs.uni-bonn.de",
        "email": "ais.uni-bonn.de;cs.uni-bonn.de",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Bonn",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.uni-bonn.de",
        "aff_unique_abbr": "UBonn",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "dbba5138fd",
        "title": "Rearrangement on Lattices with Swaps: Optimality Structures and Efficient Algorithms",
        "site": "https://www.roboticsproceedings.org/rss17/p014.html",
        "author": "Jingjin Yu",
        "abstract": "We propose and study a class of multi-object rearrangement problems in which a robotic manipulator; capable of carrying an item and making item swaps; is tasked to sort items stored in lattices in a time-optimal manner. We systematically analyze the intrinsic optimality structure; which is fairly rich and intriguing; under different levels of item distinguishability (fully labeled; where each item has a unique label; or partially labeled; where multiple items may be of the same type) and different lattice dimensions. Focusing on the most practical setting of one and two dimensions; we develop efficient (low polynomial time) algorithms that optimally perform rearrangements on 1D lattices under both fully- and partially-labeled settings. On the other hand; we prove that rearrangement on 2D and higher dimensional lattices becomes computationally intractable to optimally solve. Despite their NP-hardness; we are able to again develop efficient algorithms for 2D fully- and partially-labeled settings that are asymptotically optimal; in expectation; assuming that the initial configuration is randomly selected. Simulation studies confirm the effectiveness of our algorithms in comparison to greedy best-first approaches.  Source code of Python implementation:",
        "bibtex": "@INPROCEEDINGS{Yu-RSS-21, \r\n    AUTHOR    = {Jingjin Yu}, \r\n    TITLE     = {{Rearrangement on Lattices with Swaps: Optimality Structures and Efficient Algorithms}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.014} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p014.pdf",
        "supp": "",
        "pdf_size": 904890,
        "gs_citation": 8,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16810004962690470944&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "Department of Computer Science, Rutgers, the State University of New Jersey, Piscataway, NJ, USA",
        "aff_domain": "cs.rutgers.edu",
        "email": "cs.rutgers.edu",
        "github": "github.com/rutgers-arc-lab/lattice-rearrangement",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Rutgers, the State University of New Jersey",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://rutgers.edu",
        "aff_unique_abbr": "Rutgers",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Piscataway",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "079079cc11",
        "title": "Resolving Conflict in Decision-Making for Autonomous Driving",
        "site": "https://www.roboticsproceedings.org/rss17/p049.html",
        "author": "Jack Geary; Subramanian Ramamoorthy; Henry Gouk",
        "abstract": "Recent work on decision-making and planning for autonomous driving has made use of game theoretic methods to model interaction between agents. We demonstrate that methods based on the Stackelberg game formulation of this problem are susceptible to an issue that we refer to as Conflict. Our results show that when Conflict occurs; it can cause sub-optimal and potentially dangerous behaviour. In response; we develop a theoretical framework for analysing the extent to which such methods are impacted by Conflict; and apply this framework to several existing approaches modelling interaction between agents. Moreover; we propose Augmented Altruism; a novel approach to modelling interaction between players in a Stackelberg game; and show that it is less prone to Conflict than previous techniques. Finally; we investigate the behavioural assumptions that underpin our approach by performing experiments with human participants. The results show that our model approximates human decision-making more accurately than existing game-theoretic models of interactive driving.",
        "bibtex": "@INPROCEEDINGS{Geary-RSS-21, \r\n    AUTHOR    = {Jack Geary AND Subramanian Ramamoorthy AND Henry Gouk}, \r\n    TITLE     = {{Resolving Conflict in Decision-Making for Autonomous Driving}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.049} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p049.pdf",
        "supp": "",
        "pdf_size": 1095018,
        "gs_citation": 12,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1264925924786998057&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "School of Informatics, University of Edinburgh, UK; School of Informatics, University of Edinburgh, UK + Five AI Ltd., UK; School of Informatics, University of Edinburgh, UK",
        "aff_domain": "ed.ac.uk;ed.ac.uk;ed.ac.uk",
        "email": "ed.ac.uk;ed.ac.uk;ed.ac.uk",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0+1;0",
        "aff_unique_norm": "University of Edinburgh;Five AI Ltd.",
        "aff_unique_dep": "School of Informatics;",
        "aff_unique_url": "https://www.ed.ac.uk;",
        "aff_unique_abbr": "Edinburgh;",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Edinburgh;",
        "aff_country_unique_index": "0;0+0;0",
        "aff_country_unique": "United Kingdom"
    },
    {
        "id": "f7d92d50f6",
        "title": "Robust Multi-Modal Policies for Industrial Assembly via Reinforcement Learning and Demonstrations: A Large-Scale Study",
        "site": "https://www.roboticsproceedings.org/rss17/p088.html",
        "author": "Jianlan Luo",
        "abstract": "Over the past several years there has been a considerable research investment into learning-based approaches to industrial assembly; but despite significant progress these techniques have yet to be adopted by industry. We argue that it is the prohibitively large design space for Deep Reinforcement Learning (DRL); rather than algorithmic limitations per se; that are truly responsible for this lack of adoption. Pushing these techniques into the industrial mainstream requires an industry-oriented paradigm which differs significantly from the academic mindset. In this paper we define criteria for industry-oriented DRL; and perform a thorough comparison according to these criteria of one family of learning approaches; DRL from demonstration; against a professional industrial integrator on the recently established NIST assembly benchmark. We explain the design choices; representing several years of investigation; which enabled our DRL system to consistently outperform the integrator baseline in terms of both speed and reliability.  Finally; we conclude with a competition between our DRL system and a human on a challenge task of insertion into a randomly moving target. This study suggests that DRL is capable of outperforming not only established engineered approaches; but the human motor system as well; and that there remains significant room for improvement. Videos can be found on our project website:",
        "bibtex": "@INPROCEEDINGS{Luo-RSS-21, \r\n    AUTHOR    = {Jianlan Luo AND Oleg Sushkov AND Rugile Pevceviciute AND Wenzhao Lian AND Chang Su AND Mel Vecerik AND Ning Ye AND Stefan Schaal AND Jonathan Scholz}, \r\n    TITLE     = {{Robust Multi-Modal Policies for Industrial Assembly via Reinforcement Learning and Demonstrations: A Large-Scale Study}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.088} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p088.pdf",
        "supp": "",
        "pdf_size": 7639709,
        "gs_citation": 82,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=132832326690436079&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://sites.google.com/view/shield-nist",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "2fdf7d233b",
        "title": "Robust Value Iteration for Continuous Control Tasks",
        "site": "https://www.roboticsproceedings.org/rss17/p007.html",
        "author": "Michael Lutter; Shie Mannor; Jan Peters; Dieter Fox; Animesh Garg",
        "abstract": "When transferring a control policy from simulation to a physical system; this policy needs to be robust to variations in the dynamics to perform well. Commonly; the optimal policy overfits to the approximate model and the corresponding state-distribution. Therefore; the policy fails when transferred to the physical system.  In this paper; we are presenting robust value iteration. This approach uses dynamic programming to compute the optimal value function on the compact state domain and incorporates adversarial perturbations of the system dynamics. The adversarial perturbations cause the resulting optimal policy to be robust to changes in the dynamics. Utilizing the continuous time perspective of reinforcement learning; we derive the optimal perturbations for the states; actions; observations and model parameters in closed-form. The resulting algorithm does not require discretization of states or actions. Therefore; the optimal adversarial perturbations can be efficiently incorporated in the min-max value function update.  We apply the resulting algorithm to the physical Furuta Pendulum and cartpole. By changing the masses of the systems we evaluate the quantitative and qualitative performance across different model parameters. We show that robust value iteration is more robust compared to deep reinforcement learning algorithm and the non-robust version of the algorithm.",
        "bibtex": "@INPROCEEDINGS{Lutter-RSS-21, \r\n    AUTHOR    = {Michael Lutter AND Shie Mannor AND Jan Peters AND Dieter Fox AND Animesh Garg}, \r\n    TITLE     = {{Robust Value Iteration for Continuous Control Tasks}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.007} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p007.pdf",
        "supp": "",
        "pdf_size": 9056695,
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11290797567140541419&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 4,
        "aff": "Nvidia; TU Darmstadt; Technion; University of Washington; University of Toronto + Vector Institute",
        "aff_domain": "nvidia.com;technion.ac.il;cs.tu-darmstadt.de;cs.washington.edu;cs.toronto.edu",
        "email": "nvidia.com;technion.ac.il;cs.tu-darmstadt.de;cs.washington.edu;cs.toronto.edu",
        "github": "",
        "project": "https://sites.google.com/view/rfvi",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2;3;4+5",
        "aff_unique_norm": "NVIDIA Corporation;Technische Universität Darmstadt;Technion - Israel Institute of Technology;University of Washington;University of Toronto;Vector Institute",
        "aff_unique_dep": ";;;;;",
        "aff_unique_url": "https://www.nvidia.com;https://www.tu-darmstadt.de;https://www.technion.ac.il/en/;https://www.washington.edu;https://www.utoronto.ca;https://vectorinstitute.ai/",
        "aff_unique_abbr": "NVIDIA;TU Darmstadt;Technion;UW;U of T;Vector Institute",
        "aff_campus_unique_index": "1;",
        "aff_campus_unique": ";Darmstadt",
        "aff_country_unique_index": "0;1;2;0;3+3",
        "aff_country_unique": "United States;Germany;Israel;Canada"
    },
    {
        "id": "ff7f4bc774",
        "title": "STEP: Stochastic Traversability Evaluation and Planning for Risk-Aware Off-road Navigation",
        "site": "https://www.roboticsproceedings.org/rss17/p021.html",
        "author": "David D. Fan",
        "abstract": "Although ground robotic autonomy has gained widespread usage in structured and controlled environments; autonomy in unknown and off-road terrain remains a difficult problem. Extreme; off-road; and unstructured environments such as undeveloped wilderness; caves; and rubble pose unique and challenging problems for autonomous navigation. To tackle these problems we propose an approach for assessing traversability and planning a safe; feasible; and fast trajectory in real-time. Our approach; which we name STEP (Stochastic Traversability Evaluation and Planning); relies on: 1) rapid uncertainty-aware mapping and traversability evaluation; 2) tail risk assessment using the Conditional Value-at-Risk (CVaR); and 3) efficient risk and constraint-aware kinodynamic motion planning using sequential quadratic programming-based (SQP) model predictive control (MPC). We analyze our method in simulation and validate its efficacy on wheeled and legged robotic platforms exploring extreme terrains including an abandoned subway and an underground lava tube.",
        "bibtex": "@INPROCEEDINGS{Fan-RSS-21, \r\n    AUTHOR    = {David D. Fan AND Kyohei Otsu AND Yuki Kubo AND Anushri Dixit AND Joel Burdick AND Ali-akbar Agha-mohammadi}, \r\n    TITLE     = {{STEP: Stochastic Traversability Evaluation and Planning for Risk-Aware Off-road Navigation}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.021} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p021.pdf",
        "supp": "",
        "pdf_size": 8173761,
        "gs_citation": 152,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5765758215536181982&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://youtu.be/N97cv4eH5c8",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "d68a4697a6",
        "title": "Safe Occlusion-Aware Autonomous Driving via Game-Theoretic Active Perception",
        "site": "https://www.roboticsproceedings.org/rss17/p066.html",
        "author": "Zixu Zhang; Jaime F Fisac",
        "abstract": "Autonomous vehicles interacting with other traffic participants heavily rely on the perception and prediction of other agents' behaviors to plan safe trajectories. However; as occlusions limit the vehicle's perception ability; reasoning about potential hazards beyond the field-of-view is one of the most challenging issues in developing autonomous driving systems. This paper introduces a novel analytical approach that poses the problem of safe trajectory planning under occlusions as a hybrid zero-sum dynamic game between the autonomous vehicle (evader); and an initially hidden traffic participant (pursuer). Due to occlusions; the pursuer's state is initially unknown to the evader and may later be discovered by the vehicle's sensors. The analysis yields optimal strategies for both players as well as the set of initial conditions from which the autonomous vehicle is guaranteed to avoid collisions. We leverage this theoretical result to develop a novel trajectory planning framework that provides worst-case safety guarantees while minimizing conservativeness by accounting for the autonomous vehicle's ability to actively avoid other road users as soon as they are detected in future observations. Our framework is agnostic to the driving environment and suitable for various motion planners. We demonstrate our algorithm on challenging urban and highway driving scenarios using the open-source CARLA simulator.",
        "bibtex": "@INPROCEEDINGS{Zhan-RSS-21, \r\n    AUTHOR    = {Zixu Zhang AND Jaime F Fisac}, \r\n    TITLE     = {{Safe Occlusion-Aware Autonomous Driving via Game-Theoretic Active Perception}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.066} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p066.pdf",
        "supp": "",
        "pdf_size": 4703956,
        "gs_citation": 71,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18168781309228302753&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Department of Electrical and Computer Engineering, Princeton University, Princeton, NJ 08544; Department of Electrical and Computer Engineering, Princeton University, Princeton, NJ 08544",
        "aff_domain": "princeton.edu;princeton.edu",
        "email": "princeton.edu;princeton.edu",
        "github": "",
        "project": "https://saferobotics.princeton.edu/research/occlusion_hybrid_game",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Department of Electrical and Computer Engineering, Princeton University, Princeton, NJ 08544",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "474d517da4",
        "title": "Safe Policies for Factored Partially Observable Stochastic Games",
        "site": "https://www.roboticsproceedings.org/rss17/p079.html",
        "author": "Steven Carr; Nils Jansen; Sudarshanan Bharadwaj; Matthijs T. J. Spaan; Ufuk Topcu",
        "abstract": "We study planning problems where a controllable agent operates under partial observability and interacts with an uncontrollable opponent; also referred to as the adversary. The agent has two distinct objectives: To maximize an expected value and to adhere to a safety specification. Multi-objective partially observable stochastic games (POSGs) formally model such problems. Yet; even for a single objective; the task of computing suitable policies for POSGs is theoretically hard and computationally intractable in practice. Using a factored state-space representation; we define a decoupling scheme for the POSG state space that—under certain assumptions on the observability and the reward structure—separates the state components relevant for the reward from those relevant for safety. This decoupling affects the possibility to compute provably safe and reward-optimal policies in a tractable two-stage approach. In particular; on the fully observable components related to safety; we exactly compute the set of policies that captures all possible safe choices against the opponent. We restrict the agent's behavior to these safe policies and project the POSG to a partially observable Markov decision process (POMDP). Any reward-maximal policy for the POMDP is then guaranteed to be safe and reward-maximal for the POSG.  We showcase our approach's feasibility using high-fidelity simulations of two case studies that concern UAV path planning and autonomous driving. Moreover; to demonstrate the practical applicability; we design a physical experiment involving a robot decision making problem under energy constraints that is motivated by a paired helicopter with NASA's Perseverance Mars rover.",
        "bibtex": "@INPROCEEDINGS{Carr-RSS-21, \r\n    AUTHOR    = {Steven Carr AND Nils Jansen AND Sudarshanan Bharadwaj AND Matthijs T. J. Spaan AND Ufuk Topcu}, \r\n    TITLE     = {{Safe Policies for Factored Partially Observable Stochastic Games}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.079} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p079.pdf",
        "supp": "",
        "pdf_size": 18353413,
        "gs_citation": 8,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1451310003622284492&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "aff": "The University of Texas at Austin, Texas, USA; Radboud University, Nijmegen, The Netherlands; The University of Texas at Austin, Texas, USA; Delft University of Technology, The Netherlands; The University of Texas at Austin, Texas, USA",
        "aff_domain": "utexas.edu;science.ru.nl;utexas.edu;tudelft.nl;utexas.edu",
        "email": "utexas.edu;science.ru.nl;utexas.edu;tudelft.nl;utexas.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0;2;0",
        "aff_unique_norm": "The University of Texas at Austin;Radboud University;Delft University of Technology",
        "aff_unique_dep": ";;",
        "aff_unique_url": "https://www.utexas.edu;https://www.ru.nl;https://www.tudelft.nl",
        "aff_unique_abbr": "UT Austin;RU;TUDelft",
        "aff_campus_unique_index": "0;1;0;0",
        "aff_campus_unique": "Austin;Nijmegen;",
        "aff_country_unique_index": "0;1;0;1;0",
        "aff_country_unique": "United States;Netherlands"
    },
    {
        "id": "b876d94a91",
        "title": "Safe Reinforcement Learning via Statistical Model Predictive Shielding",
        "site": "https://www.roboticsproceedings.org/rss17/p026.html",
        "author": "Osbert Bastani; Shuo Li",
        "abstract": "Reinforcement learning is a promising approach to solving hard robotics tasks. An important challenge is ensuring safety—e.g.; that a walking robot does not fall over or an autonomous car does not crash into an obstacle. We build on an approach that composes the learned policy with a backup policy—it uses the learned policy on the interior of the region where the backup policy is guaranteed to be safe; and switches to the backup policy on the boundary of this region. The key challenge is checking when the backup policy is guaranteed to be safe. Our algorithm; statistical model predictive shielding (SMPS); uses sampling-based verification and linear systems analysis to perform this check. We prove that SMPS ensures safety with high probability; and empirically evaluate its performance on several benchmarks.",
        "bibtex": "@INPROCEEDINGS{Bastani -RSS-21, \r\n    AUTHOR    = {Osbert Bastani AND Shuo Li}, \r\n    TITLE     = {{Safe Reinforcement Learning via Statistical Model Predictive Shielding}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.026} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p026.pdf",
        "supp": "",
        "pdf_size": 973729,
        "gs_citation": 48,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16136113220783326575&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 5,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "04d3700aaf",
        "title": "Safety and Liveness Guarantees through Reach-Avoid Reinforcement Learning",
        "site": "https://www.roboticsproceedings.org/rss17/p077.html",
        "author": "Kai-Chieh Hsu",
        "abstract": "Reach-avoid optimal control problems; in which the system must reach certain goal conditions while staying clear of unacceptable failure modes; are central to safety and liveness assurance for autonomous robotic systems; but their exact solutions are intractable for complex dynamics and environments. Recent successes in the use of reinforcement learning methods to approximately solve optimal control problems with performance objectives make their application to certification problems attractive; however; the Lagrange-type objective (cumulative costs or rewards over time) used in reinforcement learning is not suitable to encode temporal logic requirements. Recent work has shown promise in extending the reinforcement learning machinery to safety-type problems; whose objective is not a sum but a minimum over time. In this work; we generalize the reinforcement learning formulation to handle all optimal control problems in the reach-avoid category. We derive a time-discounted reach-avoid Bellman backup with contraction mapping properties and prove that the resulting reach-avoid Q-learning algorithm converges under analogous conditions to the traditional Lagrange-type problem; yielding an arbitrarily tight conservative approximation to the reach-avoid set. We further demonstrate the use of this formulation with deep reinforcement learning methods; by treating their approximate solutions as untrusted oracles in a supervisory control framework. We evaluate our proposed framework on a range of nonlinear systems; validating the results against analytic and numerical solutions; and through Monte Carlo simulation in previously intractable problems.  Our results open the door to a range of learning-based methods for safe-and-live autonomous behavior; with applications across robotics and automation.",
        "bibtex": "@INPROCEEDINGS{Hsu-RSS-21, \r\n    AUTHOR    = {Kai-Chieh Hsu AND Vicenç Rubies-Royo AND Claire Tomlin AND Jaime F Fisac}, \r\n    TITLE     = {{Safety and Liveness Guarantees through Reach-Avoid Reinforcement Learning}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.077} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p077.pdf",
        "supp": "",
        "pdf_size": 1754714,
        "gs_citation": 89,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16787396119060881901&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "dccc8d75fd",
        "title": "Sampling-Based Motion Planning on Sequenced Manifolds",
        "site": "https://www.roboticsproceedings.org/rss17/p039.html",
        "author": "Peter Englert; Isabel M Rayas Fernández; Ragesh Kumar Ramachandran; Gaurav Sukhatme",
        "abstract": "We address the problem of planning robot motions in constrained configuration spaces where the constraints change throughout the motion. The problem is formulated as a fixed sequence of intersecting manifolds; which the robot needs to traverse in order to solve the task. We specify a class of sequential motion planning problems that fulfill a particular property of the change in the free configuration space when transitioning between manifolds. For this problem class; the algorithm Planning on Sequenced Manifolds (PSM*) is developed which searches for optimal intersection points between manifolds by using RRT* in an inner loop with a novel steering strategy. We provide a theoretical analysis regarding PSM*s probabilistic completeness and asymptotic optimality. Further; we evaluate its planning performance on multi-robot object transportation tasks.",
        "bibtex": "@INPROCEEDINGS{Englert-RSS-21, \r\n    AUTHOR    = {Peter Englert AND Isabel M {Rayas Fernández} AND Ragesh Kumar Ramachandran AND Gaurav Sukhatme}, \r\n    TITLE     = {{Sampling-Based Motion Planning on Sequenced Manifolds}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.039} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p039.pdf",
        "supp": "",
        "pdf_size": 4952844,
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2484868908832273705&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "Robotic Embedded Systems Laboratory, University of Southern California, Los Angeles, CA; Robotic Embedded Systems Laboratory, University of Southern California, Los Angeles, CA; Robotic Embedded Systems Laboratory, University of Southern California, Los Angeles, CA; Robotic Embedded Systems Laboratory, University of Southern California, Los Angeles, CA + Amazon Scholar",
        "aff_domain": "usc.edu;usc.edu;usc.edu;usc.edu",
        "email": "usc.edu;usc.edu;usc.edu;usc.edu",
        "github": "https://github.com/etpr/sequential-manifold-planning",
        "project": "https://www.youtube.com/watch?v=Q8kbILTRxfU",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0+1",
        "aff_unique_norm": "University of Southern California;Amazon",
        "aff_unique_dep": "Robotic Embedded Systems Laboratory;Amazon Scholar",
        "aff_unique_url": "https://www.usc.edu;https://www.amazon.com",
        "aff_unique_abbr": "USC;Amazon",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Los Angeles;",
        "aff_country_unique_index": "0;0;0;0+0",
        "aff_country_unique": "United States"
    },
    {
        "id": "44360e4b44",
        "title": "Scale invariant robot behavior with fractals",
        "site": "https://www.roboticsproceedings.org/rss17/p059.html",
        "author": "Sam Kriegman; Amir Mohammadi Nasab; Douglas Blackiston; Hannah Steele; Michael Levin; Rebecca Kramer-Bottiglio; Josh Bongard",
        "abstract": "Robots deployed at orders of magnitude different size scales; and that retain the same desired behavior at any of those scales; would greatly expand the environments in which the robots could operate. However it is currently not known whether such robots exist; and; if they do; how to design them. Since self similar structures in nature often exhibit self similar behavior at different scales; we hypothesize that there may exist robot designs that have the same property. Here we demonstrate that this is indeed the case for some; but not all; modular soft robots: there are robot designs that exhibit a desired behavior at a small size scale; and if copies of that robot are attached together to realize the same design at higher scales; those larger robots exhibit similar behavior. We show how to find such designs in simulation using an evolutionary algorithm. Further; when fractal attachment is not assumed and attachment geometries must thus be evolved along with the design of the base robot unit; scale invariant behavior is not achieved; demonstrating that structural self similarity; when combined with appropriate designs; is a useful path to realizing scale invariant robot behavior. We validate our findings by demonstrating successful transferal of self similar structure and behavior to pneumatically-controlled soft robots. Finally; we show that biobots can spontaneously exhibit self similar attachment geometries; thereby suggesting that self similar behavior via self similar structure may be realizable across a wide range of robot platforms in future.",
        "bibtex": "@INPROCEEDINGS{Kriegman-RSS-21, \r\n    AUTHOR    = {Sam Kriegman AND Amir {Mohammadi Nasab} AND Douglas Blackiston AND Hannah Steele AND Michael Levin AND Rebecca Kramer-Bottiglio AND Josh Bongard}, \r\n    TITLE     = {{Scale invariant robot behavior with fractals}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.059} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p059.pdf",
        "supp": "",
        "pdf_size": 7421336,
        "gs_citation": 15,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=153542803143977630&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 5,
        "aff": ";;;;;;",
        "aff_domain": ";;;;;;",
        "email": ";;;;;;",
        "github": "",
        "project": "",
        "author_num": 7,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "90f3dc0d82",
        "title": "Semantic Abstraction-Guided Motion Planning for scLTL Missions in Unknown Environments",
        "site": "https://www.roboticsproceedings.org/rss17/p090.html",
        "author": "Kush Grover; Fernando S Barbosa; Jana Tumova; Jan Kretinsky",
        "abstract": "Complex mission specifications can be often specified through temporal logics; such as Linear Temporal Logic and its syntactically co-safe fragment; scLTL. Finding trajectories that satisfy such specifications becomes hard if the robot is to fulfil the mission in an initially unknown environment; where neither locations of regions or objects of interest in the environment nor the obstacle space are known a priori. We propose an algorithm that; while exploring the environment; learns important semantic dependencies in the form of a semantic abstraction; and uses it to bias the growth of an Rapidly-exploring random graph towards faster mission completion. Our approach leads to finding trajectories that are much shorter than those found by the sequential approach; which first explores and then plans. Simulations comparing our solution to the sequential approach; carried out in 100 randomized office-like environments; show more than 50% reduction in the trajectory length.",
        "bibtex": "@INPROCEEDINGS{Grover-RSS-21, \r\n    AUTHOR    = {Kush Grover AND Fernando S Barbosa AND Jana Tumova AND Jan Kretinsky}, \r\n    TITLE     = {{Semantic Abstraction-Guided Motion Planning for scLTL Missions in Unknown Environments}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.090} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p090.pdf",
        "supp": "",
        "pdf_size": 4475524,
        "gs_citation": 11,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15432241653070410024&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Technical University of Munich, Germany; KTH Royal Institute of Technology, Stockholm, Sweden; KTH Royal Institute of Technology, Stockholm, Sweden; Technical University of Munich, Germany",
        "aff_domain": "tum.de;kth.se;kth.se;tum.de",
        "email": "tum.de;kth.se;kth.se;tum.de",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;0",
        "aff_unique_norm": "Technical University of Munich;KTH Royal Institute of Technology",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.tum.de;https://www.kth.se",
        "aff_unique_abbr": "TUM;KTH",
        "aff_campus_unique_index": "1;1",
        "aff_campus_unique": ";Stockholm",
        "aff_country_unique_index": "0;1;1;0",
        "aff_country_unique": "Germany;Sweden"
    },
    {
        "id": "9885783019",
        "title": "Skill-based Shared Control",
        "site": "https://www.roboticsproceedings.org/rss17/p028.html",
        "author": "Christopher E Mower; Joao Moura; Sethu Vijayakumar",
        "abstract": "Performing a number of motion patterns — referred to as skills — (e.g.; wave; spiral; sweeping motions) during teleoperation is an integral part of many industrial processes such as spraying; welding; and wiping (cleaning; polishing). Maintaining these motions whilst simultaneously avoiding obstacles and traversing complex terrain requires expert operators. In this work; we propose a novel skill-based shared control framework for incorporating the notion of skill assistance to aid novice operators to sustain these motion patterns whilst adhering to environmental constraints. Our shared control method uses streaming joystick data to estimate the model parameters that provide a description of the operator's intention. We introduce a novel parametrization for state and control that combines skill and underlying trajectory models; leveraging a special type of curve known as Clothoids. This new parameterization allows for efficient computation of skill-based short term horizon plans; enabling the use of a Model Predictive Control (MPC) loop. We perform experiments on a hardware mock-up; validating the effectiveness of our method to recognize a switch of intended skill; and showing an improved quality of output motion; even under dynamically changing obstacles. See our accompanying video here:",
        "bibtex": "@INPROCEEDINGS{Mower-RSS-21, \r\n    AUTHOR    = {Christopher E Mower AND Joao Moura AND Sethu Vijayakumar}, \r\n    TITLE     = {{Skill-based Shared Control}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.028} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p028.pdf",
        "supp": "",
        "pdf_size": 2271189,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7272184768841437127&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "9fb88cb6a7",
        "title": "Surprisingly Robust In-Hand Manipulation: An Empirical Study",
        "site": "https://www.roboticsproceedings.org/rss17/p089.html",
        "author": "Aditya Bhatt",
        "abstract": "We present in-hand manipulation skills on a dexterous; compliant; anthropomorphic hand. Even though these skills were derived in a simplistic manner; they exhibit surprising robustness to variations in shape; size; weight; and placement of the manipulated object. They are also very insensitive to variation of execution speeds; ranging from highly dynamic to quasi-static. The robustness of the skills leads to compositional properties that enable extended and robust manipulation programs. To explain the surprising robustness of the in-hand manipulation skills; we performed a detailed; empirical analysis of the skills' performance. From this analysis; we identify three principles for skill design: 1) Exploiting the hardware's innate ability to drive hard-to-model contact dynamics. 2) Taking actions to constrain these interactions; funneling the system into a narrow set of possibilities. 3) Composing such action sequences into complex manipulation programs. We believe that these principles constitute an important foundation for robust robotic in-hand manipulation; and possibly for manipulation in general.",
        "bibtex": "@INPROCEEDINGS{Bhatt-RSS-21, \r\n    AUTHOR    = {Aditya Bhatt AND Adrian Sieler AND Steffen Puhlmann AND Oliver Brock}, \r\n    TITLE     = {{Surprisingly Robust In-Hand Manipulation: An Empirical Study}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.089} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p089.pdf",
        "supp": "",
        "pdf_size": 10164079,
        "gs_citation": 89,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2428672448398688252&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "2b6bbb8d06",
        "title": "Synergies Between Affordance and Geometry: 6-DoF Grasp Detection via Implicit Representations",
        "site": "https://www.roboticsproceedings.org/rss17/p024.html",
        "author": "Zhenyu Jiang; Yifeng Zhu; Maxwell Svetlik; Kuan Fang; Yuke Zhu",
        "abstract": "Grasp detection in clutter requires the robot to reason about the 3D scene from incomplete and noisy perception. In this work; we draw insight that 3D reconstruction and grasp learning are two intimately connected tasks; both of which require a fine-grained understanding of local geometry details. We thus propose to utilize the synergies between grasp affordance and 3D reconstruction through multi-task learning of a shared representation. Our model takes advantage of deep implicit functions; a continuous and memory-efficient representation; to enable differentiable training of both tasks. We train the model on self-supervised grasp trials data in simulation. Evaluation is conducted on a clutter removal task; where the robot clears cluttered objects by grasping them one at a time. The experimental results in simulation and on the real robot have demonstrated that the use of implicit neural representations and joint learning of grasp affordance and 3D reconstruction have led to state-of-the-art grasping results. Our method outperforms baselines by over 10% in terms of grasp success rate.",
        "bibtex": "@INPROCEEDINGS{Jiang-RSS-21, \r\n    AUTHOR    = {Zhenyu Jiang AND Yifeng Zhu AND Maxwell Svetlik AND Kuan Fang AND Yuke Zhu}, \r\n    TITLE     = {{Synergies Between Affordance and Geometry: 6-DoF Grasp Detection via Implicit Representations}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.024} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p024.pdf",
        "supp": "",
        "pdf_size": 2254571,
        "gs_citation": 169,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2124389784002565016&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "The University of Texas at Austin; The University of Texas at Austin; The University of Texas at Austin; Stanford University; The University of Texas at Austin",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "https://sites.google.com/view/rpl-giga2021",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;1;0",
        "aff_unique_norm": "University of Texas at Austin;Stanford University",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.utexas.edu;https://www.stanford.edu",
        "aff_unique_abbr": "UT Austin;Stanford",
        "aff_campus_unique_index": "0;0;0;1;0",
        "aff_campus_unique": "Austin;Stanford",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "d0b2f4b0b9",
        "title": "TARE: A Hierarchical Framework for Efficiently Exploring Complex 3D Environments",
        "site": "https://www.roboticsproceedings.org/rss17/p018.html",
        "author": "Chao Cao; Hongbiao Zhu; Howie Choset; Ji Zhang",
        "abstract": "We present a method for autonomous exploration in complex three-dimensional (3D) environments. Our method demonstrates exploration faster than the current state-of-the-art using a hierarchical framework — one level maintains data densely and computes a detailed path within a local planning horizon; while another level maintains data sparsely and computes a coarse path at the global scale. Such a framework shares the insight that detailed processing is most effective close to the robot; and gains computational speed by trading-off computation of details far away from the robot. The method optimizes an overall exploration path with respect to the length of the path. In addition; the path in the local area is kinodynamically feasible for the vehicle to follow at a high speed. In experiments; our systems autonomously explore indoor and outdoor environments at a high degree of complexity; with ground and aerial robots. The method produces 80% more exploration efficiency; defined as the average explored volume per second through a run; and consumes less than 50% of computation compared to the state-of-the-art.",
        "bibtex": "@INPROCEEDINGS{Cao-RSS-21, \r\n    AUTHOR    = {Chao Cao AND Hongbiao Zhu AND Howie Choset AND Ji Zhang}, \r\n    TITLE     = {{TARE: A Hierarchical Framework for Efficiently Exploring Complex 3D Environments}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.018} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p018.pdf",
        "supp": "",
        "pdf_size": 5809097,
        "gs_citation": 157,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12972128417111393806&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "Robotics Institute at Carnegie Mellon University; Robotics Institute at Carnegie Mellon University; Robotics Institute at Carnegie Mellon University; Robotics Institute at Carnegie Mellon University",
        "aff_domain": "cmu.edu;cmu.edu;cmu.edu;cmu.edu",
        "email": "cmu.edu;cmu.edu;cmu.edu;cmu.edu",
        "github": "",
        "project": "www.cmu-exploration.com",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Pittsburgh",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "326eeb0fa2",
        "title": "Toward Certifiable Motion Planning for Medical Steerable Needles",
        "site": "https://www.roboticsproceedings.org/rss17/p081.html",
        "author": "Mengyu Fu; Oren Salzman; Ron Alterovitz",
        "abstract": "Medical steerable needles can move along 3D curvilinear trajectories to avoid anatomical obstacles and reach clinically significant targets inside the human body. Automating steerable needle procedures can enable physicians and patients to harness the full potential of steerable needles by maximally leveraging their steerability to safely and accurately reach targets for medical procedures such as biopsies and localized therapy delivery for cancer. For the automation of medical procedures to be clinically accepted; it is critical from a patient care; safety; and regulatory perspective to certify the correctness and effectiveness of the motion planning algorithms involved in procedure automation. In this paper; we take an important step toward creating a certifiable motion planner for steerable needles. We introduce the first motion planner for steerable needles that offers a guarantee; under clinically appropriate assumptions; that it will; in finite time; compute an exact; obstacle-avoiding motion plan to a specified target; or notify the user that no such plan exists. We present an efficient; resolution-complete motion planner for steerable needles based on a novel adaptation of multi-resolution planning. Compared to state-of-the-art steerable needle motion planners (none of which provide any completeness guarantees); we demonstrate that our new resolution-complete motion planner computes plans faster and with a higher success rate.",
        "bibtex": "@INPROCEEDINGS{Fu-RSS-21, \r\n    AUTHOR    = {Mengyu Fu AND Oren Salzman AND Ron Alterovitz}, \r\n    TITLE     = {{Toward Certifiable Motion Planning for Medical Steerable Needles}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.081} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p081.pdf",
        "supp": "",
        "pdf_size": 5861416,
        "gs_citation": 19,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=386503952953846805&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "aff": "Department of Computer Science, University of North Carolina at Chapel Hill, Chapel Hill, NC 27599, USA; Computer Science Department, Technion - Israel Institute of Technology, Israel; Department of Computer Science, University of North Carolina at Chapel Hill, Chapel Hill, NC 27599, USA",
        "aff_domain": "cs.unc.edu;cs.technion.ac.il;cs.unc.edu",
        "email": "cs.unc.edu;cs.technion.ac.il;cs.unc.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "Department of Computer Science, University of North Carolina at Chapel Hill, Chapel Hill, NC 27599, USA;Technion - Israel Institute of Technology",
        "aff_unique_dep": ";Computer Science Department",
        "aff_unique_url": ";https://www.technion.ac.il",
        "aff_unique_abbr": ";Technion",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1",
        "aff_country_unique": ";Israel"
    },
    {
        "id": "d4029ef2cf",
        "title": "Towards finding the shortest-paths for 3D rigid bodies",
        "site": "https://www.roboticsproceedings.org/rss17/p085.html",
        "author": "Weifu Wang; Ping Li",
        "abstract": "In this work; we analyze and present an algorithm to find shortest-paths for generic rigid bodies. We derived the necessary conditions for optimality using Lagrange multipliers; and compared it to the conditions derived from Pontraygin's Maximum Principle. We derived the equations of the necessary conditions using geometric Jacobian; drawing inspiration from the similarity between the rigid-body systems and the arm-like systems. In the previous work, the analysis focused on finding shortest-paths to reach goals in positions only. This work extends the analysis to find the shortest-path to reach a goal with complete configuration in 3D. We show that the algorithm is resolution complete even when the orientations are included. To overcome the complexity of 3D orientations; we describe the system using three points in the robot frame; and show that this parameter system is redundant but can derive the same necessary conditions as those derived using the minimum parameters (configuration). We used a 3D Dubins system to demonstrate the correctness of the analysis and the algorithm.",
        "bibtex": "@INPROCEEDINGS{WangW-RSS-21, \r\n    AUTHOR    = {Weifu Wang AND Ping Li}, \r\n    TITLE     = {{Towards finding the shortest-paths for 3D rigid bodies}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.085} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p085.pdf",
        "supp": "",
        "pdf_size": 414937,
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1744970736233435704&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "Cognitive Computing Lab, Baidu Research, No.10 Xibeiwang East Road, Beijing 100193, China; Cognitive Computing Lab, Baidu Research, 10900 NE 8th St. Bellevue, Washington 98004, USA",
        "aff_domain": "baidu.com;baidu.com",
        "email": "baidu.com;baidu.com",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Baidu Research",
        "aff_unique_dep": "Cognitive Computing Lab",
        "aff_unique_url": "https://research.baidu.com",
        "aff_unique_abbr": "Baidu",
        "aff_campus_unique_index": "0;1",
        "aff_campus_unique": "Beijing;Bellevue",
        "aff_country_unique_index": "0;1",
        "aff_country_unique": "China;United States"
    },
    {
        "id": "75aff5d9aa",
        "title": "Untangling Dense Non-Planar Knots by Learning Manipulation Features and Recovery Policies",
        "site": "https://www.roboticsproceedings.org/rss17/p013.html",
        "author": "Priya Sundaresan",
        "abstract": "Robot manipulation for untangling 1D deformable structures such as ropes; cables; and wires is challenging due to their infinite dimensional configuration space; complex dynamics; and tendency to self-occlude. Analytical controllers often fail in the presence of dense configurations; due to the difficulty of grasping between adjacent cable segments. We present two algorithms that enhance robust cable untangling; LOKI and SPiDERMan; which operate alongside HULK; a high-level planner from prior work. LOKI uses a learned model of manipulation features to refine a coarse grasp keypoint prediction to a precise; optimized location and orientation; while SPiDERMan uses a learned model to sense task progress and apply recovery actions. We evaluate these algorithms in physical cable untangling experiments with 336 knots and over 1500 actions on real cables using the da Vinci surgical robot. We find that the combination of HULK; LOKI; and SPiDERMan is able to untangle dense overhand; figure-eight; double-overhand; square; bowline; granny; stevedore; and triple-overhand knots. The composition of these methods successfully untangles a cable from a dense initial configuration in 68.3% of 60 physical experiments and achieves 50% higher success rates than baselines from prior work. Supplementary material; code; and videos can be found at",
        "bibtex": "@INPROCEEDINGS{SundaresanGrannen-RSS-21, \r\n    AUTHOR    = {Priya Sundaresan AND Jennifer Grannen AND Brijen Thananjeyan AND Ashwin Balakrishna AND Jeffrey Ichnowski AND Ellen Novoseller AND Minho Hwang AND Michael Laskey AND Joseph Gonzalez AND Ken Goldberg}, \r\n    TITLE     = {{Untangling Dense Non-Planar Knots by Learning Manipulation Features and Recovery Policies}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.013} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p013.pdf",
        "supp": "",
        "pdf_size": 13753598,
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=72618820396929773&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "https://tinyurl.com/rssuntangling",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "37af17e9a7",
        "title": "Variational Inference MPC using Tsallis Divergence",
        "site": "https://www.roboticsproceedings.org/rss17/p073.html",
        "author": "Ziyi Wang",
        "abstract": "In this paper; we provide a generalized framework for Variational Inference-Stochastic Optimal Control by using the non-extensive Tsallis divergence. By incorporating the deformed exponential function into the optimality likelihood function; a novel Tsallis Variational Inference-Model Predictive Control algorithm is derived; which includes prior works such as Variational Inference-Model Predictive Control; Model Predictive Path Integral Control; Cross Entropy Method; and Stein Variational Inference Model Predictive Control as special cases. The proposed algorithm allows for effective control of the cost/reward transform and is characterized by superior performance in terms of mean and variance reduction of the associated cost. The aforementioned features are supported by a theoretical and numerical analysis on the level of risk sensitivity of the proposed algorithm as well as simulation experiments on 5 different robotic systems with 3 different policy parameterizations.",
        "bibtex": "@INPROCEEDINGS{WangZ-RSS-21, \r\n    AUTHOR    = {Ziyi Wang AND Oswin So AND Jason Gibson AND Bogdan Vlahov AND Manan Gandhi AND Guan-Horng Liu AND Evangelos Theodorou}, \r\n    TITLE     = {{Variational Inference MPC using Tsallis Divergence}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.073} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p073.pdf",
        "supp": "",
        "pdf_size": 1375908,
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8119430548403434289&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "06595c217b",
        "title": "Vector Semantic Representations as Descriptors for Visual Place Recognition",
        "site": "https://www.roboticsproceedings.org/rss17/p083.html",
        "author": "Peer Neubert; Stefan Schubert; Kenny Schlegel; Peter Protzel",
        "abstract": "Place recognition is the task of recognizing the current scene from a database of known places. The currently dominant algorithmic paradigm is to use (deep learning based) holistic feature vectors to describe each place and use fast vector query methods to find matchings. We propose a novel type of image descriptor; Vector Semantic Representations (VSR); that encodes the spatial semantic layout from a semantic segmentation together with appearance properties in a; for example; 4;096 dimensional vector for place recognition. We leverage operations from the established class of Vector Symbolic Architectures to combine symbolic (e.g. class label) and numeric (e.g. feature map response) information in a common vector representation. We evaluate the proposed semantic descriptor on 13 standard mobile robotic place recognition datasets and compare to six descriptors from the literature. VSR is on par with the best compared descriptor (NetVLAD) in terms of mean average precision and superior in terms of recall and worst-case average precision. This makes the approach particularly interesting for candidate selection. For a more detailed investigation; we discuss and evaluate recall integrity as additional criterion. Further; we demonstrate that the semantic descriptor is particularly well suited for combination with existing appearance descriptors indicating that semantics provide complementary information for image matching.",
        "bibtex": "@INPROCEEDINGS{Neubert-RSS-21, \r\n    AUTHOR    = {Peer Neubert AND Stefan Schubert AND Kenny Schlegel AND Peter Protzel}, \r\n    TITLE     = {{Vector Semantic Representations as Descriptors for Visual Place Recognition}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.083} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p083.pdf",
        "supp": "",
        "pdf_size": 2151832,
        "gs_citation": 37,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6910814421404918824&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "aff": "Chemnitz University of Technology, Germany; Chemnitz University of Technology, Germany; Chemnitz University of Technology, Germany; Chemnitz University of Technology, Germany",
        "aff_domain": "etit.tu-chemnitz.de;etit.tu-chemnitz.de;etit.tu-chemnitz.de;etit.tu-chemnitz.de",
        "email": "etit.tu-chemnitz.de;etit.tu-chemnitz.de;etit.tu-chemnitz.de;etit.tu-chemnitz.de",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Chemnitz University of Technology, Germany",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "0de0979161",
        "title": "Vision-driven Compliant Manipulation for Reliable; High-Precision Assembly Tasks",
        "site": "https://www.roboticsproceedings.org/rss17/p070.html",
        "author": "Andrew S. Morgan",
        "abstract": "Highly constrained manipulation tasks continue to be challenging for autonomous robots as they require high levels of precision; typically less than 1mm; which is often incompatible with what can be achieved by traditional perception systems. This paper demonstrates that the combination of state-of-the-art object tracking with passively adaptive mechanical hardware can be leveraged to complete precision manipulation tasks with tight; industrially-relevant tolerances (0.25mm). The proposed control method closes the loop through vision by tracking the relative 6D pose of objects in the relevant workspace. It adjusts the control reference of both the compliant manipulator and the hand to complete object insertion tasks via within-hand manipulation. Contrary to previous efforts for insertion; our method does not require expensive force sensors; precision manipulators; or time-consuming; online learning; which is data hungry. Instead; this effort leverages mechanical compliance and utilizes an object-agnostic manipulation model of the hand learned offline; off-the-shelf motion planning; and an RGBD-based object tracker trained solely with synthetic data. These features allow the proposed system to easily generalize and transfer to new tasks and environments. This paper describes in detail the system components and showcases its efficacy with extensive experiments involving tight tolerance peg-in-hole insertion tasks of various geometries as well as open-world constrained placement tasks.",
        "bibtex": "@INPROCEEDINGS{Morgan -RSS-21, \r\n    AUTHOR    = {Andrew S. Morgan AND Bowen Wen AND Junchi Liang AND Abdeslam Boularias AND Aaron M. Dollar AND Kostas Bekris}, \r\n    TITLE     = {{Vision-driven Compliant Manipulation for Reliable; High-Precision Assembly Tasks}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.070} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p070.pdf",
        "supp": "",
        "pdf_size": 7918712,
        "gs_citation": 72,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8840645313536137825&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0a9ba338ff",
        "title": "i3dLoc: Image-to-range Cross-domain Localization Robust to Inconsistent Environmental Conditions",
        "site": "https://www.roboticsproceedings.org/rss17/p027.html",
        "author": "Peng Yin; Lingyun Xu; Ji Zhang; Howie Choset; Sebastian Scherer",
        "abstract": "We present a method for localizing a single camera with respect to a point cloud map in indoor and outdoor scenes. The problem is challenging because correspondences of local invariant features are inconsistent across the domains between image and 3D. The problem is even more challenging as the method must handle various environmental conditions such as illumination; weather; and seasonal changes. Our method can match equirectangular images to the 3D range projections by extracting cross-domain symmetric place descriptors. Our key insight is to retain condition-invariant 3D geometry features from limited data samples while eliminating the condition-related features by a designed Generative Adversarial Network. Based on such features; we further design a spherical convolution network to learn viewpoint-invariant symmetric place descriptors. We evaluate our method on extensive self-collected datasets; which involve Long-term (variant appearance conditions); Large-scale (up to 2km structure/unstructured environment); and Multistory (four-floor confined space). Our method surpasses other current state-of-the-arts by achieving around 3 times higher place retrievals to inconsistent environments; and above 3 times accuracy on online localization. To highlight our method's generalization capabilities; we also evaluate the recognition across different datasets. With one single trained model; i3dLoc can achieve reliable visual localization under random conditions and viewpoints.",
        "bibtex": "@INPROCEEDINGS{Yin-RSS-21, \r\n    AUTHOR    = {Peng Yin AND Lingyun Xu AND Ji Zhang AND Howie Choset AND Sebastian Scherer}, \r\n    TITLE     = {{i3dLoc: Image-to-range Cross-domain Localization Robust to Inconsistent Environmental Conditions}}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2021}, \r\n    ADDRESS   = {Virtual}, \r\n    MONTH     = {July}, \r\n    DOI       = {10.15607/RSS.2021.XVII.027} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss17/p027.pdf",
        "supp": "",
        "pdf_size": 13342496,
        "gs_citation": 22,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17232930585675800699&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213, USA; Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213, USA; Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213, USA; Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213, USA; Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213, USA",
        "aff_domain": "andrew.cmu.edu;gmail.com; zhangji;andrew.cmu.edu; ",
        "email": "andrew.cmu.edu;gmail.com; zhangji;andrew.cmu.edu; ",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Pittsburgh",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "United States"
    }
]