[
    {
        "id": "a5c3a1792e",
        "title": "A Constant-Time Algorithm for Vector Field SLAM using an Exactly Sparse Extended Information Filter",
        "site": "https://www.roboticsproceedings.org/rss06/p25.html",
        "author": "J.-S. Gutmann; E. Eade; P. Fong and M. Munich",
        "abstract": "Designing a localization system for a low-cost\r\nrobotic consumer product poses a major challenge. In previous\r\nwork, we introduced Vector Field SLAM, a system for\r\nsimultaneously estimating robot pose and a vector field induced\r\nby stationary signal sources present in the environment. In this\r\npaper we show how this method can be realized on a low-cost\r\nembedded processing unit by applying the concepts of the Exactly\r\nSparse Extended Information Filter. By restricting the set of\r\nactive features to the 4 nodes of the current cell, the size of the\r\nmap becomes linear in the area explored by the robot while the\r\ntime for updating the state can be held constant under certain\r\napproximations. We report results from running our method on\r\nan ARM 7 embedded board with 64 kByte RAM controlling a\r\nRoomba 510 vacuum cleaner in a standard test environment.",
        "bibtex": "@INPROCEEDINGS{ Gutmann-RSS-10,\r\n    AUTHOR    = {J.-S. Gutmann AND E. Eade AND P. Fong AND M. Munich},\r\n    TITLE     = {A Constant-Time Algorithm for Vector Field SLAM using an Exactly Sparse Extended Information Filter},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.025} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p25.pdf",
        "supp": "",
        "pdf_size": 1075296,
        "gs_citation": 33,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7514528803002010956&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "0397dd8d37",
        "title": "A Fast Traversal Heuristic and Optimal Algorithm for Effective Environmental Coverage",
        "site": "https://www.roboticsproceedings.org/rss06/p21.html",
        "author": "L. Xu and T. Stentz",
        "abstract": "Tasks such as street mapping and security surveillance\r\nseek a route that traverses a given space to perform a\r\nfunction. These task functions may involve mapping the space\r\nfor accurate modeling, sensing the space for unusual activity,\r\nor processing the space for object detection. With a prior map,\r\nan optimal path can be computed using a graph to represent\r\nthe environment and generating the solution using known graph\r\nalgorithms. However, the prior map may be inaccurate due to\r\nfactors such as occlusion, outdatedness, dynamic objects, and\r\nresolution limitations. In this work, we address the NP-hard\r\nproblem of optimal environmental coverage with incomplete\r\nprior map information.",
        "bibtex": "@INPROCEEDINGS{ Xu-RSS-10,\r\n    AUTHOR    = {L. Xu AND T. Stentz},\r\n    TITLE     = {A Fast Traversal Heuristic and Optimal Algorithm for Effective Environmental Coverage},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.021} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p21.pdf",
        "supp": "",
        "pdf_size": 3628690,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17816473946937949271&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "fe16f5d2d1",
        "title": "A Molecular Algorithm for Path Self-Assembly in 3 Dimensions",
        "site": "https://www.roboticsproceedings.org/rss06/p40.html",
        "author": "R. Schulman and B. Yurke",
        "abstract": "A molecular algorithm is a set of molecular interactions\r\nthat carry out a particular task. We describe a molecular\r\nalgorithm for self-assembling a path between two stationary\r\npoints when the locations of these points are not known in\r\nadvance. While efficient path finding algorithms for electronic\r\nrobots exist, molecules lack the centralized memory or computing\r\npower to implement them. The algorithm takes advantage of\r\nthe inherent physics at the molecular scale, and unlike other\r\nbiomimetic algorithms for path finding, is designed to work\r\nin an unstructured environment and does not require complex\r\nmolecular components. Designed molecules self-assemble a DNA\r\nnanotube starting from a â\u0080\u009cseedâ\u0080\u009d molecule attached to the start\r\npoint. During growth, the DNA nanotubeâ\u0080\u0099s end diffuses through\r\nspace, and this diffusion is harnessed as a search process: when\r\nthe DNA nanotubeâ\u0080\u0099s end contacts the destination, it attaches to\r\nit and stops growing, forming a stable path.",
        "bibtex": "@INPROCEEDINGS{ Schulman-RSS-10,\r\n    AUTHOR    = {R. Schulman AND B. Yurke},\r\n    TITLE     = {A Molecular Algorithm for Path Self-Assembly in 3 Dimensions},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.040} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p40.pdf",
        "supp": "",
        "pdf_size": 386228,
        "gs_citation": 1,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15089896783776336942&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "68ad368e13",
        "title": "A Non-invasive Real-Time Method for Measuring Variable Stiffness",
        "site": "https://www.roboticsproceedings.org/rss06/p12.html",
        "author": "G. Grioli and A. Bicchi",
        "abstract": "The need for adaptability to the environment, energy\r\nconservation, and safety during physical interaction with\r\nhumans of many advanced robotic applications has prompted the\r\ndevelopment of a number of Variable Stiffness Actuators (VSA).\r\nThese have been implemented in a variety of ways, using different\r\ntransduction technologies (electromechanical, pneumatic,\r\nhydraulic, but also piezoelectric, active polymeric, etc. ) and\r\narrangements with elastic elements. All designs share a fundamentally\r\nunavoidable nonlinear behavior. The control schemes\r\nproposed for these actuators typically aim at independently\r\ncontrolling the position (or force) of the link, and its stiffness with\r\nrespect to external disturbances. Although effective feedback control\r\nschemes using position and force sensors are commonplace in\r\nrobotics, control of stiffness is at present completely openâ\u0080\u0093loop.\r\nIn practice, instead of measuring stiffness, it is inferred from\r\nthe mathematical model of the actuator. Being this in most cases\r\nonly roughly known, model mismatches affect severely stiffness\r\ncontrol, undermining its utility. It should be noticed that, while\r\nfor constant stiffness elements an accurate calibration of the\r\nmodel is possible, the same approach is hardly viable for variable\r\nstiffness systems.",
        "bibtex": "@INPROCEEDINGS{ Grioli-RSS-10,\r\n    AUTHOR    = {G. Grioli AND A. Bicchi},\r\n    TITLE     = {A Non-invasive Real-Time Method for Measuring Variable Stiffness },\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.012} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p12.pdf",
        "supp": "",
        "pdf_size": 1970072,
        "gs_citation": 46,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3574828627033546601&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 16,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "1ae2d0ae94",
        "title": "Analysis and Control of a Dissipative Spring-Mass Hopper with Torque Actuation",
        "site": "https://www.roboticsproceedings.org/rss06/p06.html",
        "author": "M. M. Ankarali and U. Saranli",
        "abstract": "It has long been established that simple springmass\r\nmodels can accurately represent the dynamics of legged\r\nlocomotion. Existing work in this domain, however, almost\r\nexclusively focuses on the idealized Spring-Loaded Inverted\r\nPendulum (SLIP) model and neglects passive dissipative effects\r\nunavoidable in any physical robot or animal. In this paper, we\r\nextend on a recently proposed analytic approximation to the\r\nstance trajectories of a dissipative SLIP model to analyze stability\r\nproperties of a planar hopper with a single rotary actuator at\r\nthe hip. We first describe how a suitably chosen torque controller\r\ncan compensate for damping losses, maintaining the same energy\r\nlevel across strides and hence reducing the return map to a\r\nsingle dimension. We then identify and characterize equilibrium\r\npoints for this return map under a fixed leg placement policy and\r\nshow that â\u0080\u009cuncontrolledâ\u0080\u009d asymptotic stability is feasible for this\r\nenergy-regulated system. Subsequent presentation of simulation\r\nevidence establishes that the predictions of this approximate\r\nmodel are consistent with the exact plant model. The paper\r\nconcludes with the application of our energy-regulation scheme\r\nto the design of a task-level gait controller that uses explicit leg\r\nplacement commands in conjunction with the hip torque.",
        "bibtex": "@INPROCEEDINGS{ Ankarali-RSS-10,\r\n    AUTHOR    = {M. M. Ankarali AND U. Saranli},\r\n    TITLE     = {Analysis and Control of a Dissipative Spring-Mass Hopper with Torque Actuation},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.006} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p06.pdf",
        "supp": "",
        "pdf_size": 333000,
        "gs_citation": 10,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2104767004399198111&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 17,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "cce5407e25",
        "title": "Assessing Optimal Assignment under Uncertainty: An Interval-based Algorithm",
        "site": "https://www.roboticsproceedings.org/rss06/p16.html",
        "author": "L. Liu and D. Shell",
        "abstract": "We consider the problem of multi-robot taskallocation\r\nwhen robots have to deal with uncertain utility estimates.\r\nTypically an allocation is performed to maximize expected\r\nutility; we consider a means for measuring the robustness of\r\na given optimal allocation when robots have some measure of\r\nthe uncertainty (e.g., a probability distribution, or moments of\r\nsuch distributions). We introduce a new O(n",
        "bibtex": "@INPROCEEDINGS{ Liu-RSS-10,\r\n    AUTHOR    = {L. Liu AND D. Shell},\r\n    TITLE     = {Assessing Optimal Assignment under Uncertainty: An Interval-based Algorithm},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.016} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p16.pdf",
        "supp": "",
        "pdf_size": 1007345,
        "gs_citation": 96,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14821259144039900273&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 18,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "56a7fea975",
        "title": "Back-drivable and Inherently Safe Mechanism for Artificial Finger",
        "site": "https://www.roboticsproceedings.org/rss06/p08.html",
        "author": "K. Koganezawa",
        "abstract": "This paper shows mechanisms for artificial finger\r\nbased on a planetary gear system (PGS). Using the PGS as a\r\ntransmitter provides an under-actuated system for driving three\r\njoints of a finger with back-drivability that is a crucial trait for\r\nfingers as an end-effector when it interacts with external\r\nenvironment. This paper also shows the artificial finger employed\r\nwith the originally developed mechanism called â\u0080\u009cdouble\r\nplanetary gear systemâ\u0080\u009d (DPGS). The DPGS provides not only\r\nback-drivable and under-actuated flexion-extension of the three\r\njoints of a finger, which is identical to the former, but also\r\nadduction-abduction of the MP joint. Both of the above finger\r\nmechanisms are inherently safe due to being back-drivable with\r\nno electric device or sensor in the finger part. They are also\r\nrigorously solvable on kinematics and kinetics as shown in this\r\nPaper.",
        "bibtex": "@INPROCEEDINGS{ Koganezawa-RSS-10,\r\n    AUTHOR    = {K. Koganezawa},\r\n    TITLE     = {Back-drivable and Inherently Safe Mechanism for Artificial Finger},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.008} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p08.pdf",
        "supp": "",
        "pdf_size": 2030670,
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10867390936017374501&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": "Department of Mechanical Engineering, Tokai University",
        "aff_domain": "keyaki.cc.u-tokai.ac.jp",
        "email": "keyaki.cc.u-tokai.ac.jp",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Department of Mechanical Engineering, Tokai University",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": ""
    },
    {
        "id": "95ee0d837e",
        "title": "Belief space planning assuming maximum likelihood observations",
        "site": "https://www.roboticsproceedings.org/rss06/p37.html",
        "author": "R. Platt; R. Tedrake; L. Kaelbling and T. Lozano-Perez",
        "abstract": "We cast the partially observable control problem as\r\na fully observable underactuated stochastic control problem in\r\nbelief space and apply standard planning and control techniques.\r\nOne of the difficulties of belief space planning is modeling the\r\nstochastic dynamics resulting from unknown future observations.\r\nThe core of our proposal is to define deterministic beliefsystem\r\ndynamics based on an assumption that the maximum\r\nlikelihood observation (calculated just prior to the observation)\r\nis always obtained. The stochastic effects of future observations\r\nare modelled as Gaussian noise. Given this model of the dynamics,\r\ntwo planning and control methods are applied. In the first, linear\r\nquadratic regulation (LQR) is applied to generate policies in the\r\nbelief space. This approach is shown to be optimal for linear-\r\nGaussian systems. In the second, a planner is used to find locally\r\noptimal plans in the belief space. We propose a replanning\r\napproach that is shown to converge to the belief space goal\r\nin a finite number of replanning steps. These approaches are\r\ncharacterized in the context of a simple nonlinear manipulation\r\nproblem where a planar robot simultaneously locates and grasps\r\nan object.",
        "bibtex": "@INPROCEEDINGS{ Platt-RSS-10,\r\n    AUTHOR    = {R. Platt AND R. Tedrake AND L. Kaelbling AND T. Lozano-Perez},\r\n    TITLE     = {Belief space planning assuming maximum likelihood observations},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.037} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p37.pdf",
        "supp": "",
        "pdf_size": 176773,
        "gs_citation": 448,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17623891902276901105&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 20,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "aa9fddb034",
        "title": "Biophysically inspired development of a sand-swimming robot",
        "site": "https://www.roboticsproceedings.org/rss06/p01.html",
        "author": "R. Maladen; Y. Ding; P. Umbanhowar; A. Kamor and D. Goldman",
        "abstract": "Previous study of a sand-swimming lizard, the\r\nsandfish, Scincus scincus, revealed that the animal swims within\r\ngranular media at speeds up to 0.4 body-lengths/cycle using body\r\nundulation (approximately a single period sinusoidal traveling\r\nwave) without limb use. Inspired by this biological experiment\r\nand challenged by the absence of robotic devices with comparable\r\nsubterranean locomotor abilities, we developed a numerical\r\nsimulation of a robot swimming in a granular medium (modeled\r\nusing a validated Molecular Dynamics technique) to guide the\r\ndesign of a physical sand-swimming device built with off-the-shelf\r\nservo motors. Both in simulation and experiment the robot swims\r\nlimblessly subsurface and, like the animal, increases its speed by\r\nincreasing its oscillation frequency. It was able to achieve speeds\r\nof up to 0.3 body-lengths/cycle. The performance of the robot\r\nmeasured in terms of its wave efficiency, the ratio of its forward\r\nspeed to wave speed, was 0.34 ± 0.02, within 8% of the simulation\r\nprediction. Our work provides a validated simulation tool and a\r\nfunctional initial design for the development of robots that can\r\nmove within yielding terrestrial substrates.",
        "bibtex": "@INPROCEEDINGS{ Maladen-RSS-10,\r\n    AUTHOR    = {R. Maladen AND Y. Ding AND P. Umbanhowar AND A. Kamor AND D. Goldman},\r\n    TITLE     = {Biophysically inspired development of a sand-swimming robot},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.001} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p01.pdf",
        "supp": "",
        "pdf_size": 7383036,
        "gs_citation": 25,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8163618811034800396&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 20,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "2498aca1ca",
        "title": "Closing the Learning-Planning Loop with Predictive State Representations",
        "site": "https://www.roboticsproceedings.org/rss06/p36.html",
        "author": "B. Boots; S. Siddiqi and G. Gordon",
        "abstract": "A central problem in artificial intelligence is to\r\nchoose actions to maximize reward in a partially observable,\r\nuncertain environment. To do so, we must learn an accurate\r\nmodel of our environment, and then plan to maximize reward.\r\nUnfortunately, learning algorithms often recover a model which\r\nis too inaccurate to support planning or too large and complex for\r\nplanning to be feasible; or, they require large amounts of prior\r\ndomain knowledge or fail to provide important guarantees such\r\nas statistical consistency. To begin to fill this gap, we propose a\r\nnovel algorithm which provably learns a compact, accurate model\r\ndirectly from sequences of action-observation pairs. To evaluate\r\nthe learner, we then close the loop from observations to actions:\r\nwe plan in the learned model and recover a policy which is nearoptimal\r\nin the original environment (not the model). In more\r\ndetail, we present a spectral algorithm for learning a Predictive\r\nState Representation (PSR). We demonstrate the algorithm by\r\nlearning a model of a simulated high-dimensional, vision-based\r\nmobile robot planning task, and then performing approximate\r\npoint-based planning in the learned model. This experiment\r\nshows that the learned PSR captures the essential features of the\r\nenvironment, allows accurate prediction with a small number of\r\nparameters, and enables successful and efficient planning. Our\r\nalgorithm has several benefits which have not appeared together\r\nin any previous PSR learner: it is computationally efficient and\r\nstatistically consistent; it handles high-dimensional observations\r\nand long time horizons by working from real-valued features of\r\nobservation sequences; and finally, our close-the-loop experiments\r\nprovide an end-to-end practical test.",
        "bibtex": "@INPROCEEDINGS{ Boots-RSS-10,\r\n    AUTHOR    = {B. Boots AND S. Siddiqi AND G. Gordon},\r\n    TITLE     = {Closing the Learning-Planning Loop with Predictive State Representations},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.036} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p36.pdf",
        "supp": "",
        "pdf_size": 1293133,
        "gs_citation": 289,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6852251805309817183&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 33,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "bf5557656e",
        "title": "Color-Accurate Underwater Imaging using Perceptual Adaptive Illumination",
        "site": "https://www.roboticsproceedings.org/rss06/p03.html",
        "author": "I. Vasilescu; C. Detweiler and D. Rus",
        "abstract": "Capturing color in water is challenging due to the\r\nheavy non-uniform attenuation of light in water across the visible\r\nspectrum, which results in dramatic hue shifts toward blue.\r\nYet observing color in water is important for monitoring and\r\nsurveillance as well as marine biology studies related to species\r\nidentification, individual and group behavior, and ecosystem\r\nhealth and activity monitoring. Underwater robots are equipped\r\nwith motor control for large scale transects but they lack sensors\r\nthat enable capturing color-accurate underwater images. We\r\npresent a method for color-accurate imaging in water called\r\nperceptual adaptive illumination. This method dynamically mixes\r\nthe illumination of an object in a distance-dependent way\r\nusing a controllable multi-color light source. The color mix\r\ncompensates correctly for color loss and results in an image\r\nwhose color composition is equivalent to rendering the object in\r\nair. Experiments were conducted with a color palette in the pool\r\nand at three different coral reefs sites, and with an underwater\r\nrobot collecting image data with the new sensor.",
        "bibtex": "@INPROCEEDINGS{ Vasilescu-RSS-10,\r\n    AUTHOR    = {I. Vasilescu AND C. Detweiler AND D. Rus},\r\n    TITLE     = {Color-Accurate Underwater Imaging using Perceptual Adaptive Illumination},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.003} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p03.pdf",
        "supp": "",
        "pdf_size": 2530899,
        "gs_citation": 59,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6260234323972769630&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 27,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "7bea795d33",
        "title": "Consistent data association in multi-robot systems with limited communications",
        "site": "https://www.roboticsproceedings.org/rss06/p13.html",
        "author": "R. Aragues; E. Montijano and C. Sagues",
        "abstract": "In this paper we address the data association\r\nproblem of features observed by a robot team with limited communications.\r\nAt every time instant, each robot can only exchange\r\ndata with a subset of the robots, its neighbors. Initially, each\r\nrobot solves a local data association with each of its neighbors.\r\nAfter that, the robots execute the proposed algorithm to agree\r\non a data association between all their local observations which\r\nis globally consistent. One inconsistency appears when chains of\r\nlocal associations give rise to two features from one robot being\r\nassociated among them. The contribution of this work is the\r\ndecentralized detection and resolution of these inconsistencies.\r\nWe provide a fully decentralized solution to the problem. This\r\nsolution does not rely on any particular communication topology.\r\nEvery robot plays the same role, making the system robust to\r\nindividual failures. Information is exchanged exclusively between\r\nneighbors. In a finite number of iterations, the algorithm finishes\r\nwith a data association which is free of inconsistent associations.\r\nIn the experiments, we show the performance of the algorithm\r\nunder two scenarios. In the first one, we apply the resolution\r\nand detection algorithm for a set of stochastic visual maps. In\r\nthe second, we solve the feature matching between a set of images\r\ntaken by a robotic team.",
        "bibtex": "@INPROCEEDINGS{ Aragues-RSS-10,\r\n    AUTHOR    = {R. Aragues AND E. Montijano AND C. Sagues},\r\n    TITLE     = {Consistent data association in multi-robot systems with limited communications},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.013} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p13.pdf",
        "supp": "",
        "pdf_size": 808847,
        "gs_citation": 56,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8636834760074284490&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "3378c3ea9d",
        "title": "Design and Optimization Strategies for Muscle-Like Direct Drive Linear Permanent Magnet Motors",
        "site": "https://www.roboticsproceedings.org/rss06/p32.html",
        "author": "B. Ruddy and I. Hunter",
        "abstract": "We report a new approach to the design of directdrive\r\nlinear permanent magnet motors for use in general-purpose\r\nrobotic actuation, with particular attention to applications in\r\nbird-scale flapping-wing robots. We show a simple, quantitative\r\nanalytical modeling framework for this class of actuators, and\r\ndemonstrate inherent scaling properties that allow the production\r\nof motors with force densities and efficiencies comparable to those\r\nof biological muscles. We will show how this model leads to a\r\nset of practical design specifications for muscle-like motors, and\r\nexamine the resulting trade-off between thermal management\r\nand motor fabrication complexity.",
        "bibtex": "@INPROCEEDINGS{ Ruddy-RSS-10,\r\n    AUTHOR    = {B. Ruddy AND I. Hunter},\r\n    TITLE     = {Design and Optimization Strategies for Muscle-Like Direct Drive Linear Permanent Magnet Motors},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.032} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p32.pdf",
        "supp": "",
        "pdf_size": 770724,
        "gs_citation": 26,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16844521193717465500&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "475f185381",
        "title": "Distributed Optimization with Pairwise Constraints and its Application to Multi-robot Path Planning",
        "site": "https://www.roboticsproceedings.org/rss06/p23.html",
        "author": "S. Bhattacharya; V. Kumar and M. Likachev",
        "abstract": "Distributed approaches to constrained optimization\r\nproblems have immense applications to multi-robot path planning,\r\nscheduling, task allocation and other problems requiring\r\nmultiple robots to optimize a global objective function. The aim of\r\nthese approaches is to solve a series of smaller optimization problems\r\nfor each robot while sharing information among the robots,\r\nand in the process, solve the global optimization problem, which\r\notherwise would have been intractable. Distributed approaches to\r\nseparable convex optimization problems with linear constraints\r\nhave been studied extensively in the past using techniques of\r\ndual and Lagrangian decomposition. In the present work, we\r\ninvestigate a distributed implementation of a general separable\r\noptimization problem with pair-wise non-linear constraints. On\r\nthe theoretical side, we show the conditions under which the\r\nalgorithm converges to an optimal solution. On the experimental\r\nside, we demonstrate the utility of the algorithm on the problem\r\nof multi-robot path planning with pair-wise distance constraints\r\nin large complex 2-D environments with obstacles.",
        "bibtex": "@INPROCEEDINGS{ Bhattacharya-RSS-10,\r\n    AUTHOR    = {S. Bhattacharya AND V. Kumar AND M. Likachev},\r\n    TITLE     = {Distributed Optimization with Pairwise Constraints and its Application to Multi-robot Path Planning},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.023} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p23.pdf",
        "supp": "",
        "pdf_size": 429094,
        "gs_citation": 44,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4388995906858520983&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "d797c2a876",
        "title": "Dynamic Constraint-based Optimal Shape Trajectory Planner for Shape-Accelerated Underactuated Balancing Systems",
        "site": "https://www.roboticsproceedings.org/rss06/p31.html",
        "author": "U. Nagarajan",
        "abstract": "This paper presents an optimal shape trajectory\r\nplanner for shape-accelerated underactuated balancing systems,\r\nwhich are destabilized by gravitational forces. These systems\r\nhave unactuated shape variables and fully actuated external\r\nvariables. They also have the same number of actuated and\r\nunactuated degrees of freedom. Their equations of motion result\r\nin nonholonomic acceleration/dynamic constraints, which relate\r\nthe acceleration of external variables to the position, velocity and\r\nacceleration of shape variables. This paper describes a procedure\r\nto use the dynamic constraints for planning shape trajectories,\r\nwhich when tracked will result in optimal tracking of desired\r\nexternal configuration trajectories. Examples of planned optimal\r\nshape trajectories for the 3D ballbot system, which is a 3D\r\nomnidirectional wheeled inverted pendulum, are also presented.",
        "bibtex": "@INPROCEEDINGS{ Nagarajan-RSS-10,\r\n    AUTHOR    = {U. Nagarajan},\r\n    TITLE     = {Dynamic Constraint-based Optimal Shape Trajectory Planner for Shape-Accelerated Underactuated Balancing Systems},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.031} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p31.pdf",
        "supp": "",
        "pdf_size": 1101042,
        "gs_citation": 31,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9864237935261129820&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": "The Robotics Institute, Carnegie Mellon University, Pittsburgh, PA 15213",
        "aff_domain": "cmu.edu",
        "email": "cmu.edu",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "0",
        "aff_campus_unique": "Pittsburgh",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "4ee30bd16c",
        "title": "Efficient Non-Parametric Surface Representations Using Active Sampling for Push Broom Laser Data",
        "site": "https://www.roboticsproceedings.org/rss06/p27.html",
        "author": "M. Smith; I. Posner and P. Newman",
        "abstract": "This paper concerns the creation of efficient surface\r\nrepresentations from laser point clouds. We produce a continuous,\r\nimplicit, non-parametric representation with an update time\r\nthat is constant. The algorithm places no restriction on the complexity\r\nof the underlying workspace surfaces and automatically\r\nprunes redundant data via an information theoretic criterion.\r\nThis criterion makes the use of GP regression a natural choice.\r\nWe adopt a formulation which handles the typical non-functional\r\nrelation between XY-location and elevation allowing us to map\r\narbitrary environments. Results are presented that use real and\r\nsynthetic data to analyse the trade-off between compression level\r\nand reconstruction error. We attain decimation factors in excess\r\nof two orders of magnitude without significant degradation in\r\nFidelity.",
        "bibtex": "@INPROCEEDINGS{ Smith-RSS-10,\r\n    AUTHOR    = {M. Smith AND I. Posner AND P. Newman},\r\n    TITLE     = {Efficient Non-Parametric Surface Representations Using Active Sampling for Push Broom Laser Data},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.027} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p27.pdf",
        "supp": "",
        "pdf_size": 5592819,
        "gs_citation": 28,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=101910072302643893&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "40f44593c8",
        "title": "Efficient probabilistic planar robot motion estimation given pairs of images",
        "site": "https://www.roboticsproceedings.org/rss06/p26.html",
        "author": "O. Booij; Z. Zivkovic and B. Kröse",
        "abstract": "Estimating the relative pose between two camera\r\npositions given image point correspondences is a vital task in most\r\nview based SLAM and robot navigation approaches. In order to\r\nimprove the robustness to noise and false point correspondences\r\nit is common to incorporate the constraint that the robot moves\r\nover a planar surface, as is the case for most indoor and outdoor\r\nmapping applications. We propose a novel estimation method\r\nthat determines the full likelihood in the space of all possible\r\nplanar relative poses. The likelihood function can be learned\r\nfrom existing data using standard Bayesian methods and is\r\nefficiently stored in a low dimensional look up table. Estimating\r\nthe likelihood of a new pose given a set of correspondences\r\nboils down to a simple look up. As a result, the proposed\r\nmethod allows for very efficient creation of pose constraints for\r\nvision based SLAM applications, including a proper estimate\r\nof its uncertainty. It can handle ambiguous image data, such\r\nas acquired in long corridors, naturally. The method can be\r\ntrained using either artificial or real data, and is applied on\r\nboth controlled simulated data and challenging images taken in\r\nreal home environments. By computing the maximum likelihood\r\nestimate we can compare our approach with state of the art\r\nestimators based on a combination of RANSAC and iterative\r\nreweighted least squares and show a significant increase in both\r\nthe efficiency and accuracy.",
        "bibtex": "@INPROCEEDINGS{ Booij-RSS-10,\r\n    AUTHOR    = {O. Booij AND Z. Zivkovic AND B. Kr\\\"ose},\r\n    TITLE     = {Efficient probabilistic planar robot motion estimation given pairs of images},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.026} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p26.pdf",
        "supp": "",
        "pdf_size": 733279,
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4078429530375578962&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 14,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "d04a12d067",
        "title": "Incremental Sampling-based Algorithms for Optimal Motion Planning",
        "site": "https://www.roboticsproceedings.org/rss06/p34.html",
        "author": "S. Karaman and E. Frazzoli",
        "abstract": "During the last decade, incremental sampling-based\r\nmotion planning algorithms, such as the Rapidly-exploring Random\r\nTrees (RRTs), have been shown to work well in practice\r\nand to possess theoretical guarantees such as probabilistic completeness.\r\nHowever, no theoretical bounds on the quality of the\r\nsolution obtained by these algorithms, e.g., in terms of a given cost\r\nfunction, have been established so far. The purpose of this paper\r\nis to fill this gap, by designing efficient incremental samplingbased\r\nalgorithms with provable optimality properties. The first\r\ncontribution of this paper is a negative result: it is proven that,\r\nunder mild technical conditions, the cost of the best path returned\r\nby RRT converges almost surely to a non-optimal value, as\r\nthe number of samples increases. Second, a new algorithm is\r\nconsidered, called the Rapidly-exploring Random Graph (RRG),\r\nand it is shown that the cost of the best path returned by RRG\r\nconverges to the optimum almost surely. Third, a tree version of\r\nRRG is introduced, called RRT, which preserves the asymptotic\r\noptimality of RRG while maintaining a tree structure like RRT.\r\nThe analysis of the new algorithms hinges on novel connections\r\nbetween sampling-based motion planning algorithms and the\r\ntheory of random geometric graphs. In terms of computational\r\ncomplexity, it is shown that the number of simple operations\r\nrequired by both the RRG and RRT algorithms is asymptotically\r\nwithin a constant factor of that required by RRT.",
        "bibtex": "@INPROCEEDINGS{ Karaman-RSS-10,\r\n    AUTHOR    = {S. Karaman AND E. Frazzoli},\r\n    TITLE     = {Incremental Sampling-based Algorithms for Optimal Motion Planning},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.034} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p34.pdf",
        "supp": "",
        "pdf_size": 2447051,
        "gs_citation": 1063,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4769205600927777477&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 13,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "ccc234a69c",
        "title": "LQG-MP: Optimized Path Planning for Robots with Motion Uncertainty and Imperfect State Information",
        "site": "https://www.roboticsproceedings.org/rss06/p17.html",
        "author": "J. V. D. Berg; P. Abbeel and K. Goldberg",
        "abstract": "This paper presents LQG-MP (linear-quadratic\r\nGaussian motion planning), a new approach to robot motion\r\nplanning that takes into account the sensors and the controller\r\nthat will be used during execution of the robotâ\u0080\u0099s path. LQGMP\r\nis based on the linear-quadratic controller with Gaussian\r\nmodels of uncertainty, and explicitly characterizes in advance\r\n(i.e., before execution) the a-priori probability distributions\r\nof the state of the robot along its path. These distributions\r\ncan be used to assess the quality of the path, for instance by\r\ncomputing the probability of avoiding collisions. Many methods\r\ncan be used to generate the needed ensemble of candidate paths\r\nfrom which the best path is selected; in this paper we report\r\nresults using the RRT-algorithm. We study the performance\r\nof LQG-MP with simulation experiments in three scenarios\r\ninvolving a kinodynamic car-like robot, multi-robot planning\r\nwith differential-drive robots, and a 6-DOF manipulator.",
        "bibtex": "@INPROCEEDINGS{ Berg-RSS-10,\r\n    AUTHOR    = {J. V. D. Berg AND P. Abbeel AND K. Goldberg},\r\n    TITLE     = {LQG-MP: Optimized Path Planning for Robots with Motion Uncertainty and Imperfect State Information},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.017} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p17.pdf",
        "supp": "",
        "pdf_size": 435350,
        "gs_citation": 584,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15519288972405251019&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 24,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "4df7a169b5",
        "title": "Motion planning under bounded uncertainty using ensemble control",
        "site": "https://www.roboticsproceedings.org/rss06/p38.html",
        "author": "A. Becker and T. Bretl",
        "abstract": "This paper considers the problem of motion planning\r\nfor a nonholonomic unicycle despite uncertainty that scales\r\nboth the forward speed and the turning rate by an unknown but\r\nbounded constant. We model the unicycle as an ensemble control\r\nsystem, show that the position of this ensemble is controllable, and\r\nderive motion planning algorithms to steer this position between\r\na given start and goal. We apply our work to a differential-drive\r\nrobot with unknown but bounded wheel radius, and validate our\r\napproach with hardware experiments.",
        "bibtex": "@INPROCEEDINGS{ Becker-RSS-10,\r\n    AUTHOR    = {A. Becker AND T. Bretl},\r\n    TITLE     = {Motion planning under bounded uncertainty using ensemble control},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.038} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p38.pdf",
        "supp": "",
        "pdf_size": 733939,
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1413464539127240185&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "c8a90c34b7",
        "title": "Multi-Priority Cartesian Impedance Control",
        "site": "https://www.roboticsproceedings.org/rss06/p19.html",
        "author": "R. Platt; M. Abdallah and C. Wampler",
        "abstract": "Manipulator compliance is well known to be important\r\nto robot manipulation and assembly. Recently, this has\r\nbeen highlighted by the development of new higly-compliant\r\nrobot manipulators such as the Barrett arm or the DLR\r\nlightweight manipulator. It is also clear that dexterous\r\nmanipulation involves touching the environment at different\r\nlocations simultaneously (perhaps at different points on the robot\r\nhand or fingers). In these situations, it is particularly attractive\r\nto control the system using a multi-priority strategy where\r\nseveral contact points are commanded in parallel. Multi-priority\r\nCartesian impedance control is the natural combination of these\r\ntwo ideas. The system realizes several impedances with different\r\nreference positions at different points on the robot with a specified\r\norder of priority.We find a controller that minimizes an arbitrary\r\nquadratic norm on the second-priority impedance error subject\r\nto constraints deriving from the first priority impedance task.\r\nWe also show that the locally optimal controller does not require\r\nforce feedback in its implementation for passive desired inertias.\r\nThe results are illustrated in simulation.",
        "bibtex": "@INPROCEEDINGS{ Platt-RSS-10,\r\n    AUTHOR    = {R. Platt AND M. Abdallah AND C. Wampler},\r\n    TITLE     = {Multi-Priority Cartesian Impedance Control},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.019} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p19.pdf",
        "supp": "",
        "pdf_size": 182462,
        "gs_citation": 24,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5017356815505296922&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 20,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "f7db12376c",
        "title": "On motion and force controllability of grasping hands with postural synergies",
        "site": "https://www.roboticsproceedings.org/rss06/p07.html",
        "author": "D. Pratichizzo; M. Malvezzi and A. Bicchi",
        "abstract": "The complexity of robotic hands is needed to adapt\r\ndevices to the many kinds of tasks, but the large number of\r\nmotors needed to fully actuate the DoFs comes at the cost of\r\nsize, complexity and weight of devices. A possible approach to\r\nsolve this problem consists of reducing the number of actuators\r\nthus resulting more efficient, simpler and reliable than their fully\r\nactuated alternatives. Reducing control inputs seems to inspire\r\nalso biological systems and in particular motor control of human\r\nhands, which share with robotic hands the large number of DoFs.\r\nRecent studies demonstrated that a few control variables, named\r\npostural synergies, are able to account for most of the variance\r\nin the patterns of hand movements and configurations of hands.\r\nThis paper focuses on hands with postural synergies. Reducing\r\nthe number of control inputs, from fully actuated joints to few\r\nsynergies, might reduce the dimension of the force and motion\r\ncontrollability subspaces thus compromising the dexterity of the\r\ngrasp, however, this is not true in general but strongly depends\r\non how synergies are distributed. The paper investigates to what\r\nextent a hand with many DoFs can exploit postural synergies to\r\ncontrol force and motion of the grasped object.",
        "bibtex": "@INPROCEEDINGS{ Pratichizzo-RSS-10,\r\n    AUTHOR    = {D. Pratichizzo AND M. Malvezzi AND A. Bicchi},\r\n    TITLE     = {On motion and force controllability of grasping hands with postural synergies},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.007} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p07.pdf",
        "supp": "",
        "pdf_size": 572660,
        "gs_citation": 94,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6006890423736095430&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 17,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "b95f3921ce",
        "title": "On the Role of Hand Synergies in the Optimal Choice of Grasping Forces",
        "site": "https://www.roboticsproceedings.org/rss06/p30.html",
        "author": "M. Gabiccini and A. Bicchi",
        "abstract": "Recent work on the analysis of natural and robotic\r\nhands has introduced the notion of postural synergies as a\r\nprincipled organization of their complexity, based on the physical\r\ncharacteristics of the hand itself. Such characteristics include the\r\nmechanical arrangements of joints and fingers, their couplings,\r\nand the low-level control reflexes, that determine the specific way\r\nthe concept of â\u0080\u009chandâ\u0080\u009d is embodied in a human being or a robot.\r\nWhile the focus of work done so far with postural synergies has\r\nbeen on motion planning for grasp acquisition, in this paper we\r\nset out to\r\ninvestigate the role that different embodiments have on the\r\nchoice of grasping forces, and on the ultimate quality of the\r\ngrasp. Numerical results are presented showing quantitatively the\r\nrole played by different synergies (from the most fundamental to\r\nthose of higher-order) in making a number of different grasps\r\npossible. The effect of number and types of engaged synergies on\r\nthe distribution of optimal grasp forces is considered. Moreover,\r\nrobustness of results is investigated with respect to variation in\r\nuncertain parameters such as contact and joint stiffness.",
        "bibtex": "@INPROCEEDINGS{ Gabiccini-RSS-10,\r\n    AUTHOR    = {M. Gabiccini AND A. Bicchi},\r\n    TITLE     = {On the Role of Hand Synergies in the Optimal Choice of Grasping Forces},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.030} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p30.pdf",
        "supp": "",
        "pdf_size": 470164,
        "gs_citation": 234,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13804205477005644948&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 29,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "5dc243d1cc",
        "title": "On the kinematic design of exoskeletons and their fixations with a human member",
        "site": "https://www.roboticsproceedings.org/rss06/p15.html",
        "author": "N. Jarrasse and G. Morel",
        "abstract": "A crucial problem in developing robotic exoskeletons\r\nlies in the design of physical connexions between the device\r\nand the human limb it is connected to. Indeed, because in general\r\nthe human limb kinematics and the exoskeleton kinematics\r\ndiffer, using an embedment at each connection point leads to\r\nhyperstaticity. Therefore, uncontrollable forces can appear at the\r\ninteraction port. To cope with this problem, literature suggests to\r\nadd passive mechanisms at the fixation points. However, empirical\r\nsolutions proposed so far suffer from a lack of proper analysis\r\nand generality.",
        "bibtex": "@INPROCEEDINGS{ Jarrasse-RSS-10,\r\n    AUTHOR    = {N. Jarrasse AND G. Morel},\r\n    TITLE     = {On the kinematic design of exoskeletons and their fixations with a human member},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.015} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p15.pdf",
        "supp": "",
        "pdf_size": 1248712,
        "gs_citation": 23,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16308744991679199865&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "f6aaed355f",
        "title": "PLISS: Detecting and Labeling Places Using Online Change-Point Detection",
        "site": "https://www.roboticsproceedings.org/rss06/p24.html",
        "author": "A. Ranganathan",
        "abstract": "We present PLISS (Place Labeling through Image\r\nSequence Segmentation), a novel technique for place recognition\r\nand categorization from visual cues. PLISS operates on video\r\nor image streams and works by segmenting it into pieces\r\ncorresponding to distinct places in the environment. An online\r\nBayesian change-point detection framework that detects changes\r\nto model parameters is used to segment the image stream. Unlike\r\ncurrent place recognition methods, in addition to using previously\r\nlearned place models for labeling, PLISS can also detect and\r\nlearn a previously unknown place or place category in an online\r\nmanner. Moreover, since both the inferred boundaries of places\r\n(change-points) and the place labels are fully probabilistic, they\r\ncan indicate when the inference is uncertain. New places and\r\ncategories are detected using a systematic statistical hypothesis\r\ntesting framework. We present extensive experiments on a\r\nlarge and difficult image dataset. We validate our claims by\r\ncomparing results obtained using different types of features and\r\nby comparing results from PLISS against the state of the art.",
        "bibtex": "@INPROCEEDINGS{ Ranganathan-RSS-10,\r\n    AUTHOR    = {A. Ranganathan},\r\n    TITLE     = {PLISS: Detecting and Labeling Places Using Online Change-Point Detection},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.024} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p24.pdf",
        "supp": "",
        "pdf_size": 981180,
        "gs_citation": 86,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14607407599568235052&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "aff": "Honda Research Institute, USA",
        "aff_domain": "honda-ri.com",
        "email": "honda-ri.com",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "Honda Research Institute",
        "aff_unique_dep": "",
        "aff_unique_url": "https://honda-ri.com",
        "aff_unique_abbr": "HRI",
        "aff_country_unique_index": "0",
        "aff_country_unique": "United States"
    },
    {
        "id": "2831752e1f",
        "title": "Passive torque regulation in an underactuated flapping wing robotic insect",
        "site": "https://www.roboticsproceedings.org/rss06/p02.html",
        "author": "P. Sreetharan and R. Wood",
        "abstract": "Recent developments in millimeter-scale fabrication\r\nprocesses have led to rapid progress towards creating airborne\r\nflapping wing robots based on Dipteran (two-winged) insects.\r\nPrevious work to regulate reaction forces and torques generated\r\nby two flapping wings has largely focused on wing trajectory\r\ncontrol. An alternative approach introduces additional degrees\r\nof freedom to the wing flapping mechanism to passively regulate\r\nthese forces and torques. The resulting â\u0080\u0098mechanically intelligentâ\u0080\u0099\r\ndevices can execute wing trajectory corrections to realize desired\r\nbody forces and torques without the intervention of an active\r\ncontroller.",
        "bibtex": "@INPROCEEDINGS{ Sreetharan-RSS-10,\r\n    AUTHOR    = {P. Sreetharan AND R. Wood},\r\n    TITLE     = {Passive torque regulation in an underactuated flapping wing robotic insect},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.002} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p02.pdf",
        "supp": "",
        "pdf_size": 1083504,
        "gs_citation": 41,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=9157440510605759329&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "593b915771",
        "title": "Preliminary Results in Decentralized Estimation for Single-Beacon Acoustic Underwater Navigation",
        "site": "https://www.roboticsproceedings.org/rss06/p11.html",
        "author": "S. Webster; L. Whitcomb and R. Eustice",
        "abstract": "We report a decentralized, vehicle-based extended\r\ninformation filter designed to enable single-beacon acoustic\r\nnavigation of multiple underwater vehicles. In single-beacon\r\nnavigation, ranges from a single reference beacon to a moving\r\nunderwater vehicle are used in addition to the vehicleâ\u0080\u0099s inertial\r\nnavigation sensors to perform absolute (as opposed to relative)\r\nlocalization and navigation. For this implementation we assume\r\na moving reference beacon from which range measurements are\r\ncalculated using asynchronous acoustic data broadcasts that also\r\ncontain information about the reference beaconâ\u0080\u0099s position and\r\nrecent sensor measurements. We assume that other than these\r\nacoustic data transmissions the vehicle has no knowledge of the\r\nbeaconâ\u0080\u0099s position or sensor measurements. This implementation\r\nallows the simultaneous navigation of multiple vehicles within\r\nacoustic range of the reference beacon. Within this framework\r\nwe show that the decentralized information filter yields identical\r\nresults to a centralized extended Kalman filter at the instant\r\nof each range measurement; in addition we show that between\r\nrange measurements the results from the two filters differ only\r\nby linearization errors. We compare the state estimation results\r\nof the decentralized information filter to that of a centralized\r\nextended Kalman filter using a simulated data set.",
        "bibtex": "@INPROCEEDINGS{ Webster-RSS-10,\r\n    AUTHOR    = {S. Webster AND L. Whitcomb AND R. Eustice},\r\n    TITLE     = {Preliminary Results in Decentralized Estimation for Single-Beacon Acoustic Underwater Navigation},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.011} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p11.pdf",
        "supp": "",
        "pdf_size": 598773,
        "gs_citation": 51,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3677418751664448108&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "8e492342e0",
        "title": "Probabilistic Lane Estimation using Basis Curves",
        "site": "https://www.roboticsproceedings.org/rss06/p04.html",
        "author": "A. Huang and S. Teller",
        "abstract": "Lane estimation for autonomous driving can be\r\nformulated as a curve estimation problem, where local sensor\r\ndata provides partial and noisy observations of spatial curves.\r\nThe number of curves to estimate may be initially unknown and\r\nmany of the observations may be outliers or false detections\r\n(due e.g. to to tree shadows or lens flare). The challenges lie in\r\ndetecting lanes when and where they exist, and updating lane\r\nestimates as new observations are made.",
        "bibtex": "@INPROCEEDINGS{ Huang-RSS-10,\r\n    AUTHOR    = {A. Huang AND S. Teller},\r\n    TITLE     = {Probabilistic Lane Estimation using Basis Curves},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.004} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p04.pdf",
        "supp": "",
        "pdf_size": 3233774,
        "gs_citation": 17,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15870173225984922832&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 14,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "5a6084729b",
        "title": "Reinforcement Learning to adjust Robot Movements to New Situations",
        "site": "https://www.roboticsproceedings.org/rss06/p05.html",
        "author": "J. Kober; E. Oztop and J. Peters",
        "abstract": "Many complex robot motor skills can be represented\r\nusing elementary movements, and there exist efficient techniques\r\nfor learning parametrized motor plans using demonstrations and\r\nself-improvement. However, in many cases, the robot currently\r\nneeds to learn a new elementary movement even if a parametrized\r\nmotor plan exists that covers a similar, related situation. Clearly,\r\na method is needed that modulates the elementary movement\r\nthrough the meta-parameters of its representation. In this paper,\r\nwe show how to learn such mappings from circumstances to\r\nmeta-parameters using reinforcement learning. We introduce an\r\nappropriate reinforcement learning algorithm based on a kernelized\r\nversion of the reward-weighted regression. We compare\r\nthis algorithm to several previous methods on a toy example and\r\nshow that it performs well in comparison to standard algorithms.\r\nSubsequently, we show two robot applications of the presented\r\nsetup; i.e., the generalization of throwing movements in darts, and\r\nof hitting movements in table tennis. We show that both tasks\r\ncan be learned successfully using simulated and real robots.",
        "bibtex": "@INPROCEEDINGS{ Kober-RSS-10,\r\n    AUTHOR    = {J. Kober AND E. Oztop AND J. Peters},\r\n    TITLE     = {Reinforcement Learning to adjust Robot Movements to New Situations},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.005} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p05.pdf",
        "supp": "",
        "pdf_size": 3874971,
        "gs_citation": 259,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14342785868917647796&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 20,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "e1f4b231bc",
        "title": "Remotely Powered Propulsion of Helical Nanobelts",
        "site": "https://www.roboticsproceedings.org/rss06/p39.html",
        "author": "G. Hwang; S. Haliyo and S. Régnier",
        "abstract": "Self-propulsion capable nanorobots in low\r\nReynolds number fluids would have a big technological\r\nimpact in many fields. Few known mechanisms are able to\r\nmake propel such devices. Here we demonstrate that helical\r\nnanobelts can swim in liquid actuated by an electro-osmotic\r\nforce generated by electric field. The helical nanobelts were\r\ndesigned and fabricated with a head and tail to mimic the\r\nnatureâ\u0080\u0099s micro-organisms such as bacteria and their flagella.\r\nThe electro-osmotic propulsion of helical nanobelts can be\r\nused as biomedical carriers, wireless manipulators, and as\r\nlocal probes for rheological measurements.",
        "bibtex": "@INPROCEEDINGS{ Hwang-RSS-10,\r\n    AUTHOR    = {G. Hwang AND S. Haliyo AND S. R\\'egnier},\r\n    TITLE     = {Remotely Powered Propulsion of Helical Nanobelts},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.039} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p39.pdf",
        "supp": "",
        "pdf_size": 1319294,
        "gs_citation": 23,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1649926034317281997&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 17,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "f849499633",
        "title": "Scale Drift-Aware Large Scale Monocular SLAM",
        "site": "https://www.roboticsproceedings.org/rss06/p10.html",
        "author": "H. Strasdat; J. M. M. Montiel and A. Davison",
        "abstract": "State of the art visual SLAM systems have recently\r\nbeen presented which are capable of accurate, large-scale and\r\nreal-time performance, but most of these require stereo vision.\r\nImportant application areas in robotics and beyond open up\r\nif similar performance can be demonstrated using monocular\r\nvision, since a single camera will always be cheaper, more\r\ncompact and easier to calibrate than a multi-camera rig.",
        "bibtex": "@INPROCEEDINGS{ Strasdat-RSS-10,\r\n    AUTHOR    = {H. Strasdat AND J. M. M. Montiel AND A. Davison},\r\n    TITLE     = {Scale Drift-Aware Large Scale Monocular SLAM},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.010} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p10.pdf",
        "supp": "",
        "pdf_size": 694578,
        "gs_citation": 744,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7698007483754386038&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 18,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "e615df4881",
        "title": "Segmentation and Unsupervised Part-based Discovery of Repetitive Objects",
        "site": "https://www.roboticsproceedings.org/rss06/p09.html",
        "author": "R. Triebel; J. Shin and R. Siegwart",
        "abstract": "In this paper, we present an unsupervised technique\r\nto segment and detect objects in indoor environments. The main\r\nidea of this work is to identify object instances whenever there\r\nis evidence for at least one other occurence of an object of the\r\nsame kind. In contrast to former approaches, we do not assume\r\nany given segmentation of the data, but instead estimate the\r\nsegmentation and the existence of object instances concurrently.\r\nWe apply graph-based clustering in feature and in geometric\r\nspace to presegmented input data. Each segment is treated\r\nas a potential object part, and the inter-dependence of object\r\nlabels assigned to part clusters are modeled using a Conditional\r\nRandom Field (CRF) named the â\u0080\u009cparts graphâ\u0080\u009d. Another CRF is\r\nthen applied to the scene graph to smooth the class labels using\r\nthe distributions obtained from the parts graph. First results on\r\nindoor 3D laser range data are evaluated and presented.",
        "bibtex": "@INPROCEEDINGS{ Triebel-RSS-10,\r\n    AUTHOR    = {R. Triebel AND J. Shin AND R. Siegwart},\r\n    TITLE     = {Segmentation and Unsupervised Part-based Discovery of Repetitive Objects},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.009} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p09.pdf",
        "supp": "",
        "pdf_size": 638467,
        "gs_citation": 84,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17770835126508635889&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 15,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "678421c3a3",
        "title": "Sensor Placement for Improved Robotic Navigation",
        "site": "https://www.roboticsproceedings.org/rss06/p28.html",
        "author": "M. Vitus and C. Tomlin",
        "abstract": "Consider a set of fixed sensors used to estimate\r\nthe state of a vehicle (e.g. position, orientation and velocity)\r\nwhile it attempts to follow a pre-planned trajectory. Since the\r\nsensor can only provide a measurement to the vehicle when it is\r\nwithin range, the deployment of the sensors will have a major\r\nimpact on the ability of the vehicle to follow the trajectory. The\r\nproblem addressed here is to optimally place the sensors in the\r\nenvironment such that the weighted function of the estimation\r\nerror at each time-step is minimized. An optimization formulation\r\nis proposed that accounts for the uncertainty of the vehicleâ\u0080\u0099s\r\nstate in determining whether it can receive a measurement\r\nfrom a sensor. A confidence level is introduced as a tuning\r\nparameter that controls the conservativeness of the solution.\r\nConsequently, the resulting solution increases the likelihood of\r\nthe vehicle successfully following its intended trajectory. Finally,\r\ndue to the interdependence between the sensorsâ\u0080\u0099 positions, a\r\nnovel incremental optimization algorithm is presented which\r\nsignificantly outperforms a standard nonlinear optimization procedure.\r\nExperimental and simulation results are shown which\r\ncharacterize the performance of the proposed algorithm.",
        "bibtex": "@INPROCEEDINGS{ Vitus-RSS-10,\r\n    AUTHOR    = {M. Vitus AND C. Tomlin},\r\n    TITLE     = {Sensor Placement for Improved Robotic Navigation},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.028} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p28.pdf",
        "supp": "",
        "pdf_size": 6213935,
        "gs_citation": 53,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6258704182204041589&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "38aceda831",
        "title": "Singularity-invariant leg rearrangements in doubly-planar Stewart-Gough platforms",
        "site": "https://www.roboticsproceedings.org/rss06/p14.html",
        "author": "J. B. Sol; F. Thomas and C. Torras",
        "abstract": "In general, rearranging the legs of a Stewart-Gough\r\nplatform, i.e., changing the locations of its leg attachments,\r\nmodifies the platform singularity locus in a rather unexpected\r\nway. Nevertheless, some leg rearrangements have been recently\r\nfound to leave singularities invariant but, unfortunately, these\r\nrearrangements are only valid for Stewart-Gough platforms\r\ncontaining rigid components. In this work, the authors go a step\r\nfurther presenting singularity-invariant leg rearrangements that\r\ncan be applied to any Stewart-Gough platform whose base and\r\nplatform attachments are coplanar. The practical consequences\r\nof the presented theoretical results are illustrated with several\r\nexamples including well-known architectures.",
        "bibtex": "@INPROCEEDINGS{ Sol-RSS-10,\r\n    AUTHOR    = {J. B. Sol AND F. Thomas AND C. Torras},\r\n    TITLE     = {Singularity-invariant leg rearrangements in doubly-planar Stewart-Gough platforms},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.014} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p14.pdf",
        "supp": "",
        "pdf_size": 380740,
        "gs_citation": 20,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4526498576974981212&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 20,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "2b81ef1d11",
        "title": "Stochastic Complementarity for Local Control of Discontinuous Dynamics",
        "site": "https://www.roboticsproceedings.org/rss06/p22.html",
        "author": "Y. Tassa and E. Todorov",
        "abstract": "We present a method for smoothing discontinuous\r\ndynamics involving contact and friction, thereby facilitating the\r\nuse of local optimization techniques for control. The method\r\nreplaces the standard Linear Complementarity Problem with\r\na Stochastic Linear Complementarity Problem. The resulting\r\ndynamics are continuously differentiable, and the resulting controllers\r\nare robust to disturbances. We demonstrate our method\r\non a simulated 6-dimensional manipulation task, which involves\r\na finger learning to spin an anchored object by repeated flicking.",
        "bibtex": "@INPROCEEDINGS{ Tassa-RSS-10,\r\n    AUTHOR    = {Y. Tassa AND E. Todorov},\r\n    TITLE     = {Stochastic Complementarity for Local Control of Discontinuous Dynamics},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.022} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p22.pdf",
        "supp": "",
        "pdf_size": 960351,
        "gs_citation": 81,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7542503937487291860&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 13,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "199f54a3dc",
        "title": "Stochastic Modeling of the Expected Time to Search for an Intermittent Signal Source Under a Limited Sensing Range",
        "site": "https://www.roboticsproceedings.org/rss06/p35.html",
        "author": "D. Song; C. Y. Kim and J. Yi",
        "abstract": "A mobile robot is deployed to search for a stationary\r\ntarget that intermittently emits short duration signals. The\r\nsearching mission is accomplished as soon as the robot receives\r\na signal from the target. However, the robot cannot perceive\r\nthe signal unless the target is within its limited sensing range.\r\nTherefore, the time to search the target is inherently random\r\nand hence unknown despite its importance in many searching\r\nand rescue applications. Here we propose the expected searching\r\ntime (EST) as a metric to evaluate different robot motion plans\r\nunder different robot configurations. We derive a closed form\r\nsolution for computing the EST. To illustrate the EST model,\r\nwe present two case studies. In the first case, we analyze two\r\ncommon motion plans: a slap method and a random walk. The\r\nEST analysis shows that the slap method is asymptotically faster\r\nthan the random walk when the searching space size increases.\r\nIn the second case, we compare a team of n  low-cost equally configured\r\nrobots with a super robot that has the sensing range\r\nequal to that of the summation of the n  robots. The EST analysis\r\nshows that the low-cost robot team takes Θ(1/n) time and the\r\nsuper robot takes Θ(1/√n) time as n→∞. In both cases, our\r\nEST model successfully demonstrates its ability in assessing the\r\nsearching performance. The analytical results are also confirmed\r\nin simulation.",
        "bibtex": "@INPROCEEDINGS{ Song-RSS-10,\r\n    AUTHOR    = {D. Song AND C. Y. Kim AND J. Yi},\r\n    TITLE     = {Stochastic Modeling of the Expected Time to Search for an Intermittent Signal Source Under a Limited Sensing Range},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.035} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p35.pdf",
        "supp": "",
        "pdf_size": 220823,
        "gs_citation": 13,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16162543723837666529&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 14,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "7433655446",
        "title": "Study of group food retrieval by ants as a model for multi-robot collective transport strategies",
        "site": "https://www.roboticsproceedings.org/rss06/p33.html",
        "author": "S. Berman; Q. Lindsey; M. Sakar; V. Kumar and S. Pratt",
        "abstract": "Group food retrieval in some ant species serves as a\r\nuseful paradigm for multi-robot collective transport strategies\r\nthat are decentralized, scalable, and do not require a priori\r\ninformation about the payload. We investigate this phenomenon\r\nin Aphaenogaster cockerelli in order to extract the antsâ\u0080\u0099 roles\r\nduring transport, the rules that govern their actions, and the\r\nindividual forces that they apply to guide a food item to their\r\nnest. To measure these forces, we designed and fabricated elastic\r\nstructures with calibrated stiffness properties, induced ants to retrieve\r\nthe structures, and tracked the resulting deformations with\r\na camera. We then developed a hybrid system model of the ant\r\nbehaviors that were observed in the experiments. We conducted\r\nsimulations of the behavioral model that incorporate a quasistatic\r\nmodel of planar manipulation with compliant attachment\r\npoints. Our simulations qualitatively replicate individual ant\r\nactivity as well as certain macroscopic features of the transport.",
        "bibtex": "@INPROCEEDINGS{ Berman-RSS-10,\r\n    AUTHOR    = {S. Berman AND Q. Lindsey AND M. Sakar AND V. Kumar AND S. Pratt},\r\n    TITLE     = {Study of group food retrieval by ants as a model for multi-robot collective transport strategies},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.033} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p33.pdf",
        "supp": "",
        "pdf_size": 9877084,
        "gs_citation": -1,
        "gs_cited_by_link": "",
        "gs_version_total": -1,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "4ffbf3e554",
        "title": "Task-Driven Tactile Exploration",
        "site": "https://www.roboticsproceedings.org/rss06/p29.html",
        "author": "K. Hsiao; L. Kaelbling and T. Lozano-Perez",
        "abstract": "This paper presents a decision-theoretic approach\r\nto problems that require accurate placement of a robot relative\r\nto an object in the world, including grasping and insertion. The\r\ndecision process is applied to a robot hand with tactile sensors, to\r\nlocalize the object and ultimately achieve a target placement by\r\nselecting among grasping and information-gathering trajectories.\r\nThe process is demonstrated in simulation and on a real robot.",
        "bibtex": "@INPROCEEDINGS{ Hsiao-RSS-10,\r\n    AUTHOR    = {K. Hsiao AND L. Kaelbling AND T. Lozano-Perez},\r\n    TITLE     = {Task-Driven Tactile Exploration},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.029} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p29.pdf",
        "supp": "",
        "pdf_size": 904922,
        "gs_citation": 107,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12534084152343263432&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": ";",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "07481659b8",
        "title": "The Smooth Curvature Flexure Model: An Accurate, Low-Dimensional Approach for Robot Analysis",
        "site": "https://www.roboticsproceedings.org/rss06/p18.html",
        "author": "L. Odhner and A. Dollar",
        "abstract": "This paper presents a new and comprehensive method\r\nof modeling robots having highly flexible members such as\r\nflexure joints. An accurate model of large deformation bending is\r\nimportant for precisely describing the configuration of the\r\nflexible member. Additionally, the accuracy of the Jacobian and\r\nHessian of the forward kinematics are critically important at\r\nlarge angles for predicting the deformation and the stiffness of\r\nthe joint under load. The model introduced here is based on the\r\nassumption that the curvature of a beam in bending is smooth,\r\nand thus can be approximated by low-order, orthogonal\r\npolynomials. This produces a parameterized description of\r\nflexure motion that can be used as a joint model when expressed\r\nin Denavit-Hartenberg form, as a transformation from one rigid\r\nlink to the next in a serial manipulator. We will show that with\r\nonly three parameters, this model faithfully reproduces the\r\nelastic deformation of a flexure hinge predicted by the continuum\r\nmodel, even for large angles, without requiring numerical\r\nintegration or many finite elements. It can also be used to\r\ncompute the compressive buckling load of the flexure as\r\npredicted by the continuum model.",
        "bibtex": "@INPROCEEDINGS{ Odhner-RSS-10,\r\n    AUTHOR    = {L. Odhner AND A. Dollar},\r\n    TITLE     = {The Smooth Curvature Flexure Model: An Accurate, Low-Dimensional Approach for Robot Analysis},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.018} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p18.pdf",
        "supp": "",
        "pdf_size": 399449,
        "gs_citation": 16,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=8217260795825944424&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 12,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "5284f5ecf1",
        "title": "Variable Impedance Control - A Reinforcement Learning Approach",
        "site": "https://www.roboticsproceedings.org/rss06/p20.html",
        "author": "J. Buchli; E. Theodorou; F. Stulp and S. Schaal",
        "abstract": "One of the hallmarks of the performance, versatility,\r\nand robustness of biological motor control is the ability to adapt\r\nthe impedance of the overall biomechanical system to different\r\ntask requirements and stochastic disturbances. A transfer of this\r\nprinciple to robotics is desirable, for instance to enable robots\r\nto work robustly and safely in everyday human environments. It\r\nis, however, not trivial to derive variable impedance controllers\r\nfor practical high DOF robotic tasks. In this contribution, we accomplish\r\nsuch gain scheduling with a reinforcement learning approach\r\nalgorithm, PI",
        "bibtex": "@INPROCEEDINGS{ Buchli-RSS-10,\r\n    AUTHOR    = {J. Buchli AND E. Theodorou AND F. Stulp AND S. Schaal},\r\n    TITLE     = {Variable Impedance Control - A Reinforcement Learning Approach},\r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems},\r\n    YEAR      = {2010},\r\n    ADDRESS   = {Zaragoza, Spain},\r\n    MONTH     = {June},\r\n    DOI       = {10.15607/RSS.2010.VI.020} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss06/p20.pdf",
        "supp": "",
        "pdf_size": 335982,
        "gs_citation": 100,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4570498914510551292&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    }
]