[
    {
        "id": "65f197ea3d",
        "title": "'Body-in-the-Loop' Optimization of Assistive Robotic Devices: A Validation Study",
        "site": "https://www.roboticsproceedings.org/rss12/p07.html",
        "author": "Jeffrey R Koller; Deanna H Gates; Daniel P Ferris; C David Remy",
        "abstract": "Physiological measures, such as pain, anxiety, effort, or energy consumption, play a crucial role in the evaluation and development of assistive robotic devices. Physiological data are collected and analyzed by researchers and clinicians, and are often used to inform an iterative tuning process of a device and its controller. Currently, these data are collected then analyzed offline such that they are only evaluated after the experiment has ended. This makes any iterative design process tedious and time consuming since tuning must be done on a subject-by-subject basis and for a variety of tasks that the device is intended to be used for. To overcome these drawbacks, we are proposing a new type of human-machine interaction that is based on measuring and using physiological measurements in real-time. By continuously monitoring a physiological objective through a set of suitable sensors, we propose conducting an optimization of a set of controller parameters that shape the assistance provided by the device. In other words, we pose an optimization that includes the human body in the loop. This Body-in-the-Loop optimization allows for optimal subject specific control and has the potential to be used for controller adaptation to changing environments. We validated this concept in an extensive human subject study where we autonomously optimized the actuation onset of a pair of bilateral ankle exoskeletons to minimize userâ\u0080\u0099s metabolic effort.",
        "bibtex": "@INPROCEEDINGS{Koller-RSS-16, \r\n    AUTHOR    = {Jeffrey R Koller AND Deanna H Gates AND Daniel P Ferris AND C David Remy}, \r\n    TITLE     = {'Body-in-the-Loop' Optimization of Assistive Robotic Devices: A Validation Study}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.007} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p07.pdf",
        "supp": "",
        "pdf_size": 1570438,
        "gs_citation": 150,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5430563052734529303&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "aff": "University of Michigan, Ann Arbor, MI, USA; University of Michigan, Ann Arbor, MI, USA; University of Michigan, Ann Arbor, MI, USA; University of Michigan, Ann Arbor, MI, USA",
        "aff_domain": "umich.edu; ; ; ",
        "email": "umich.edu; ; ; ",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "University of Michigan",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.umich.edu",
        "aff_unique_abbr": "UM",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Ann Arbor",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "502afb347c",
        "title": "A Cartesian 6-DoF Gaze Controller for Humanoid Robots",
        "site": "https://www.roboticsproceedings.org/rss12/p22.html",
        "author": "Alessandro Roncone; Ugo Pattacini; Giorgio Metta; Lorenzo Natale",
        "abstract": "In robotic systems with moving cameras control of gaze allows for image stabilization, tracking and attention switching. Proper integration of these capabilities lets the robot exploit the kinematic redundancy of the oculomotor system to improve tracking performance and extend the field of view, while at the same time stabilize vision to reduce image blur induced by the robotâ\u0080\u0099s own movements. Gaze may be driven not only by vision but also by other sensors (e.g. inertial sensors or motor encoders) that carry information about the robotâ\u0080\u0099s own movement. Humanoid robots have sophisticated oculomotor systems, usually mounting inertial devices and are therefore an ideal platform to study this problem. We present a complete architecture for gaze control of a humanoid robot. Our system is able to control the neck and the eyes in order to track a 3D cartesian fixation point in space. The redundancy of the kinematic problem is exploited to implement additional behaviors, namely passive gaze stabilization, saccadic movements, and vestibulo- ocular reflex. We implement this framework on the iCubâ\u0080\u0099s head, which is equipped with a 3-DoFs neck and a 3-DoFs eyes system and includes an inertial unit that provides feedback on the acceleration and angular speed of the head. The framework presented in this work can be applied to any robot equipped with an anthropomorphic head. In addition we provide an open- source, modular implementation, which has been already ported to other robotic platforms.",
        "bibtex": "@INPROCEEDINGS{Roncone-RSS-16, \r\n    AUTHOR    = {Alessandro Roncone AND Ugo Pattacini AND Giorgio Metta AND Lorenzo Natale}, \r\n    TITLE     = {A Cartesian 6-DoF Gaze Controller for Humanoid Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.022} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p22.pdf",
        "supp": "",
        "pdf_size": 725687,
        "gs_citation": 98,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6684167786008516404&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "iCub Facility, Istituto Italiano di Tecnologia, Genova, Italy+Social Robotics Lab, Computer Science Department, Yale University, New Haven, CT, U.S.A.; iCub Facility, Istituto Italiano di Tecnologia, Genova, Italy; iCub Facility, Istituto Italiano di Tecnologia, Genova, Italy; iCub Facility, Istituto Italiano di Tecnologia, Genova, Italy",
        "aff_domain": "yale.edu; ; ; ",
        "email": "yale.edu; ; ; ",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;0;0;0",
        "aff_unique_norm": "Istituto Italiano di Tecnologia;Social Robotics Lab, Computer Science Department, Yale University, New Haven, CT, U.S.A.",
        "aff_unique_dep": "iCub Facility;",
        "aff_unique_url": "https://www.iit.it;",
        "aff_unique_abbr": "IIT;",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Genova;",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "Italy;"
    },
    {
        "id": "2da017be4a",
        "title": "A Novel Relationship Between Dynamics and Complexity in Multi-agent Collision Avoidance",
        "site": "https://www.roboticsproceedings.org/rss12/p30.html",
        "author": "Jeffrey Kane Johnson",
        "abstract": "This paper examines the relationship between sys- tem dynamics and problem complexity of collision avoidance in multi-agent systems. Motivated particularly by results in the field of automated driving, a variant of the reciprocal n-body collision avoidance problem is considered. In this problem, agents must avoid collision while moving according to individual reward functions in a crowded environment. The main contribution of this work is the novel result that there is a quantifiable relationship between system dynamics and the requirement for agent coordination, and that this requirement can change the complexity class of the problem dramatically: from P to NEXP or even NEXPNP. In addition, a constructive proof is provided that demonstrates the relationship and potential real- world applications of the result are discussed.",
        "bibtex": "@INPROCEEDINGS{Johnson-RSS-16, \r\n    AUTHOR    = {Jeffrey Kane Johnson}, \r\n    TITLE     = {A Novel Relationship Between Dynamics and Complexity in Multi-agent Collision Avoidance}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.030} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p30.pdf",
        "supp": "",
        "pdf_size": 970773,
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11487796728967827320&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "School of Informatics and Computing, Indiana University, Bloomington, Indiana 47408",
        "aff_domain": "indiana.edu",
        "email": "indiana.edu",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0",
        "aff_unique_norm": "School of Informatics and Computing, Indiana University, Bloomington, Indiana 47408",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": ""
    },
    {
        "id": "89a3bfc53e",
        "title": "A Probabilistic Framework for Real-time 3D Segmentation using Spatial, Temporal, and Semantic Cues",
        "site": "https://www.roboticsproceedings.org/rss12/p24.html",
        "author": "David Held; Devin Guillory; Brice Rebsamen; Sebastian Thrun; Silvio Savarese",
        "abstract": "In order to track dynamic objects in a robotâ\u0080\u0099s environment, one must first segment the scene into a collection of separate objects. Most real-time robotic vision systems today rely on simple spatial relations to segment the scene into separate objects. However, such methods fail under a variety of real- world situations such as occlusions or crowds of closely-packed objects. We propose a probabilistic 3D segmentation method that combines spatial, temporal, and semantic information to make better-informed decisions about how to segment a scene. We begin with a coarse initial segmentation. We then compute the probability that a given segment should be split into multiple segments or that multiple segments should be merged into a single segment, using spatial, semantic, and temporal cues. Our probabilistic segmentation framework enables us to significantly reduce both undersegmentations and oversegmentations on the KITTI dataset [3, 4, 5] while still running in real-time. By combining spatial, temporal, and semantic information, we are able to create a more robust 3D segmentation system that leads to better overall perception in crowded dynamic environments.",
        "bibtex": "@INPROCEEDINGS{Held-RSS-16, \r\n    AUTHOR    = {David Held AND Devin Guillory AND Brice Rebsamen AND Sebastian Thrun AND Silvio Savarese}, \r\n    TITLE     = {A Probabilistic Framework for Real-time 3D Segmentation using Spatial, Temporal, and Semantic Cues}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.024} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p24.pdf",
        "supp": "",
        "pdf_size": 4943728,
        "gs_citation": 54,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5628187174702516467&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 10,
        "aff": "Computer Science Department, Stanford University; Computer Science Department, Stanford University; Computer Science Department, Stanford University; Computer Science Department, Stanford University; Computer Science Department, Stanford University",
        "aff_domain": "cs.stanford.edu;cs.stanford.edu; ;cs.stanford.edu;cs.stanford.edu",
        "email": "cs.stanford.edu;cs.stanford.edu; ;cs.stanford.edu;cs.stanford.edu",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0",
        "aff_unique_norm": "Stanford University",
        "aff_unique_dep": "Computer Science Department",
        "aff_unique_url": "https://www.stanford.edu",
        "aff_unique_abbr": "Stanford",
        "aff_campus_unique_index": "0;0;0;0;0",
        "aff_campus_unique": "Stanford",
        "aff_country_unique_index": "0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "3786cd2e50",
        "title": "An End-To-End System for Accomplishing Tasks with Modular Robots",
        "site": "https://www.roboticsproceedings.org/rss12/p25.html",
        "author": "Gangyuan Jing; Tarik Tosun; Mark Yim; Hadas Kress-Gazit",
        "abstract": "The advantage of modular robot systems lies in their flexibility, but this advantage can only be realized if there exists some reliable, effective way of generating configurations (shapes) and behaviors (controlling programs) appropriate for a given task. In this paper, we present an end-to-end system for addressing tasks with modular robots, and demonstrate that it is capable of accomplishing challenging multi-part tasks in hardware experiments. The system consists of four tightly integrated components: (1) A high-level mission planner, (2) A large design library spanning a wide set of functionality, (3) A design and simulation tool for populating the library with new configurations and behaviors, and (4) modular robot hardware. The broader goal of this project is enabling users to address real-world tasks using modular robots. We believe this work represents an important step toward this larger goal.",
        "bibtex": "@INPROCEEDINGS{Jing-RSS-16, \r\n    AUTHOR    = {Gangyuan Jing AND Tarik Tosun AND Mark Yim AND Hadas Kress-Gazit}, \r\n    TITLE     = {An End-To-End System for Accomplishing Tasks with Modular Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.025} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p25.pdf",
        "supp": "",
        "pdf_size": 10561156,
        "gs_citation": 82,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5788906038133130893&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "aff": "Cornell University; Univ. of Pennsylvania; Univ. of Pennsylvania; Cornell University",
        "aff_domain": "cornell.edu;grasp.upenn.edu;grasp.upenn.edu;cornell.edu",
        "email": "cornell.edu;grasp.upenn.edu;grasp.upenn.edu;cornell.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;0",
        "aff_unique_norm": "Cornell University;University of Pennsylvania",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.cornell.edu;https://www.upenn.edu",
        "aff_unique_abbr": "Cornell;UPenn",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "86d255f5f1",
        "title": "An Inverse Optimal Control Approach for the Transfer of Human Walking Motions in Constrained Environment to Humanoid Robots",
        "site": "https://www.roboticsproceedings.org/rss12/p05.html",
        "author": "Debora Clever; Katja Mombaur",
        "abstract": "In this paper we present an inverse optimal control based transfer of motions from human experiments to humanoid robots and apply it to walking in constrained environments. To this end we introduce a 3D template model, which describes motion on the basis of center of mass trajectory, foot trajectories, upper body orientation and phase duration. Despite of its abstract architecture with prismatic joints combined with damped series elastic actuators instead of knees, the model (including dynamics and constraints) is suitable to describe both, human and hu- manoid locomotion with appropriate parameters. We present and apply an inverse optimal control approach to identify optimality criteria based on human motion capture experiments. The iden- tified optimal strategy is then transferred to the humanoid robot for gait generation by solving an optimal control problem, which takes into account the properties of the robot and differences in the environment. The results of this approach are the center of mass trajectory, the foot trajectories, the torso orientation, and the single and double support phase durations for a sequence of multiple steps allowing the humanoid robot to walk within a new environment. We present one computational cycle (from motion capture data to an optimized robot motion) for the example of walking over irregular step stones with the aim to transfer the motion to two very different humanoid robots (iCub Heidelberg01 and HRP-2 14). The transfer of these optimized robot motions to the real robots by means of inverse kinematics is work in progress and not part of this paper.",
        "bibtex": "@INPROCEEDINGS{Clever-RSS-16, \r\n    AUTHOR    = {Debora Clever AND Katja Mombaur}, \r\n    TITLE     = {An Inverse Optimal Control Approach for the Transfer of Human Walking Motions in Constrained Environment to Humanoid Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.005} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p05.pdf",
        "supp": "",
        "pdf_size": 2971963,
        "gs_citation": 50,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6113956081792638699&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "Optimization in Robotics & Biomechanics (ORB) + Interdisciplinary Center for Scientiﬁc Computing (IWR) + University of Heidelberg; Optimization in Robotics & Biomechanics (ORB) + Interdisciplinary Center for Scientiﬁc Computing (IWR) + University of Heidelberg",
        "aff_domain": "iwr.uni-heidelberg.de;iwr.uni-heidelberg.de",
        "email": "iwr.uni-heidelberg.de;iwr.uni-heidelberg.de",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1+2;0+1+2",
        "aff_unique_norm": "Optimization in Robotics & Biomechanics (ORB);Interdisciplinary Center for Scientiﬁc Computing (IWR);University of Heidelberg",
        "aff_unique_dep": ";;",
        "aff_unique_url": ";;https://www.uni-heidelberg.de",
        "aff_unique_abbr": ";;Uni Heidelberg",
        "aff_campus_unique_index": ";",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;1",
        "aff_country_unique": ";Germany"
    },
    {
        "id": "a7d0d34691",
        "title": "Asking for Help with the Right Question by Predicting Human Visual Performance",
        "site": "https://www.roboticsproceedings.org/rss12/p38.html",
        "author": "Hong Cai; Yasamin Mostofi",
        "abstract": "In this paper, we consider robotic surveillance tasks that involve visual perception. The robot has a limited access to a remote operator to ask for help. However, humans may not be able to accomplish the visual task in many scenarios, depending on the sensory input. In this paper, we propose a machine learning-based approach that allows the robot to probabilistically predict human visual performance for any visual input. Based on this prediction, we then present a methodology that allows the robot to properly optimize its field decisions in terms of when to ask for help, when to sense more, and when to rely on itself. The proposed approach enables the robot to ask the right questions, only querying the operator with the sensory inputs for which humans have a high chance of success. Furthermore, it allows it to autonomously locate the areas that need more sensing. We test the proposed predictor on a large validation set and show Normalized Mean Square Error of 0.0199, as well as a reduction of about an order of magnitude in error as compared to the state-of-the-art. We then run a number of robotic surveillance experiments on our campus as well as a larger-scale evaluation with real data/human feedback in a simulation environment. The results showcase the efficacy of our approach, indicating a considerable increase in the success rate of human queries (a few folds in several cases) and the overall performance (30%-41% increase in success rate).",
        "bibtex": "@INPROCEEDINGS{Cai-RSS-16, \r\n    AUTHOR    = {Hong Cai AND Yasamin Mostofi}, \r\n    TITLE     = {Asking for Help with the Right Question by Predicting Human Visual Performance}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.038} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p38.pdf",
        "supp": "",
        "pdf_size": 1414869,
        "gs_citation": 8,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1414137894401781795&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Dept. of Electrical and Computer Engineering, University of California Santa Barbara; Dept. of Electrical and Computer Engineering, University of California Santa Barbara",
        "aff_domain": "ece.ucsb.edu;ece.ucsb.edu",
        "email": "ece.ucsb.edu;ece.ucsb.edu",
        "github": "",
        "project": "http://dx.doi.org/10.7919/F43X84K7",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Dept. of Electrical and Computer Engineering, University of California Santa Barbara",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "147a59b3d2",
        "title": "Closed Loop Control of a Tethered Magnetic Capsule Endoscope",
        "site": "https://www.roboticsproceedings.org/rss12/p18.html",
        "author": "Addisu Z. Taddese; Piotr R. Slawinski; Keith L. Obstein; Pietro Valdastri",
        "abstract": "Magnetic field gradients have repeatedly been shown to be the most feasible mechanism for gastrointestinal capsule endoscope actuation. An inverse quartic magnetic force varia- tion with distance results in large force gradients induced by small movements of a driving magnet; this necessitates robotic actuation of magnets to implement stable control of the device. A typical system consists of a serial robot with a permanent magnet at its end effector that actuates a capsule with an embedded permanent magnet. We present a tethered capsule system where a capsule with an embedded magnet is closed loop controlled in 2 degree-of-freedom in position and 2 degree-of- freedom in orientation. Capitalizing on the magnetic field of the external driving permanent magnet, the capsule is localized in 6- D allowing for both position and orientation feedback to be used in a control scheme. We developed a relationship between the serial robotâ\u0080\u0099s joint parameters and the magnetic force and torque that is exerted onto the capsule. Our methodology was validated both in a dynamic simulation environment where a custom plug-in for magnetic interaction was written, as well as on an experimental platform. The tethered capsule was demonstrated to follow desired trajectories in both position and orientation with accuracy that is acceptable for colonoscopy.",
        "bibtex": "@INPROCEEDINGS{Taddese-RSS-16, \r\n    AUTHOR    = {Addisu Z. Taddese AND Piotr R. Slawinski AND Keith L. Obstein AND Pietro Valdastri}, \r\n    TITLE     = {Closed Loop Control of a Tethered Magnetic Capsule Endoscope}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.018} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p18.pdf",
        "supp": "",
        "pdf_size": 4163591,
        "gs_citation": 36,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5369646045094620585&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "4cf4dd754f",
        "title": "Combined Optimization and Reinforcement Learning for Manipulation Skills",
        "site": "https://www.roboticsproceedings.org/rss12/p33.html",
        "author": "Peter Englert; Marc Toussaint",
        "abstract": "This work addresses the problem of how a robot can improve a manipulation skill in a sample-efficient and secure manner. As an alternative to the standard reinforcement learning formulation where all objectives are defined in a single reward function, we propose a generalized formulation that consists of three components: 1) A known analytic control cost function; 2) A black-box return function; and 3) A black-box binary success constraint. While the overall policy optimization problem is high- dimensional, in typical robot manipulation problems we can assume that the black-box return and constraint only depend on a lower-dimensional projection of the solution. With our formulation we can exploit this structure for a sample-efficient learning framework that iteratively improves the policy with respect to the objective functions under the success constraint. We employ efficient 2nd-order optimization methods to optimize the high-dimensional policy w.r.t. the analytic cost function while keeping the lower dimensional projection fixed. This is alternated with safe Bayesian optimization over the lower-dimensional projection to address the black-box return and success constraint. During both improvement steps the success constraint is used to keep the optimization in a secure region and to clearly distinguish between motions that lead to success or failure. The learning algorithm is evaluated on a simulated benchmark problem and a door opening task with a PR2.",
        "bibtex": "@INPROCEEDINGS{Englert-RSS-16, \r\n    AUTHOR    = {Peter Englert AND Marc Toussaint}, \r\n    TITLE     = {Combined Optimization and Reinforcement Learning for Manipulation Skills}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.033} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p33.pdf",
        "supp": "",
        "pdf_size": 1547181,
        "gs_citation": 52,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13342371013864077267&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Machine Learning & Robotics Lab, University of Stuttgart, Germany; Machine Learning & Robotics Lab, University of Stuttgart, Germany",
        "aff_domain": "informatik.uni-stuttgart.de;informatik.uni-stuttgart.de",
        "email": "informatik.uni-stuttgart.de;informatik.uni-stuttgart.de",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "University of Stuttgart",
        "aff_unique_dep": "Machine Learning & Robotics Lab",
        "aff_unique_url": "https://www.uni-stuttgart.de",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "Germany"
    },
    {
        "id": "15eb764664",
        "title": "Coordinated multi-arm motion planning: Reaching for moving objects in the face of uncertainty",
        "site": "https://www.roboticsproceedings.org/rss12/p19.html",
        "author": "Seyed Sina Mirrazavi Salehian; Nadia Figueroa; Aude Billard",
        "abstract": "Coordinated control strategies for multi-robot sys- tems are necessary for tasks that cannot be executed by a single robot. This encompasses tasks where the workspace of the robot is too small or where the load is too heavy for one robot to handle. Using multiple robots makes the task feasible by extending the workspace and/or increase the payload of the overall robotic system. In this paper, we consider two instances of such tasks: a co-worker scenario in which a human hands over a large object to a robot; intercepting a large flying object. The problem is made difficult as the pick-up/intercept motions must take place while the object is in motion and because the objectâ\u0080\u0099s motion is not deterministic. The challenge is then to adapt the motion of the robotic arms in coordination with one another and with the object. Determining the pick-up/intercept point is done by taking into account the workspace of the multi-arm system. The point is continuously recomputed to adapt to change in the objectâ\u0080\u0099s trajectory. We propose a virtual object based dynamical systems (DS) control law to generate autonomous and synchronized motions for a multi-arm robot system. We show theoretically that the multi-arm + virtual object system converges asymptotically to the moving object. We validate our approach on a dual-arm robotic system and demonstrate that it can re- synchronize and adapt the motion of each arm in a fraction of a second, even when the motion of the object is fast and not accurately predictable.",
        "bibtex": "@INPROCEEDINGS{Salehian-RSS-16, \r\n    AUTHOR    = {Seyed Sina Mirrazavi Salehian AND Nadia Figueroa AND Aude Billard}, \r\n    TITLE     = {Coordinated multi-arm motion planning: Reaching for moving objects in the face of uncertainty}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.019} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p19.pdf",
        "supp": "",
        "pdf_size": 12221528,
        "gs_citation": -1,
        "gs_cited_by_link": "",
        "gs_version_total": -1,
        "aff": "LASA Laboratory, Ecole Polytechnique Federale de Lausanne (EPFL), Switzerland; LASA Laboratory, Ecole Polytechnique Federale de Lausanne (EPFL), Switzerland; LASA Laboratory, Ecole Polytechnique Federale de Lausanne (EPFL), Switzerland",
        "aff_domain": "epfl.ch;epfl.ch;epfl.ch",
        "email": "epfl.ch;epfl.ch;epfl.ch",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "LASA Laboratory, Ecole Polytechnique Federale de Lausanne (EPFL), Switzerland",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "481bd58126",
        "title": "Design and Implementation of a Novel Robot Fish with Active and Compliant Propulsion Mechanism",
        "site": "https://www.roboticsproceedings.org/rss12/p11.html",
        "author": "Yong Zhong; Ruxu Du",
        "abstract": "Although methods about building fish-like robots have attracted much research in recent years, new techniques are still required for developing superior robot fish. This paper presents a novel robot fish propelled by an active compliant propulsion mechanism. The key innovation is the combination of an active wire-driven mechanism with a soft compliant tail to accomplish subcarangiform swimming (i.e., swimming with an â\u0080\u009cSâ\u0080\u009d motion). Additionally, an effective design methodology based on a 3R pseudo-rigid-body model is proposed to design the compliant tail. First, the mathematical model based on the design methodology was derived and computer simulations were performed. Second, a prototype was fabricated and numerous experimental studies were conducted. The experiments demonstrated that the predictions of the mathematical model matched the testing results. Compared with existing robot fishes which use multi-link structure with each joint being actuated by one motor, the new robot fish has several advantages: it is simple in structure, easy to control, and capable of high speed swimming and maneuverable swimming, the maximum swimming speed reached 2.15 body length per second and the instantaneous maximum turning speed is 269Â°/s. Furthermore, the design methodology presented in the paper can be also used in other applications such as flexible probe of medical devices and soft manipulators.",
        "bibtex": "@INPROCEEDINGS{Zhong-RSS-16, \r\n    AUTHOR    = {Yong Zhong AND Ruxu Du}, \r\n    TITLE     = {Design and Implementation of a Novel Robot Fish with Active and Compliant Propulsion Mechanism}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.011} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p11.pdf",
        "supp": "",
        "pdf_size": 2182912,
        "gs_citation": 26,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16182822075862519721&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "Institute of Precision Engineering, Dept. of Mechanical and Automation Engineering, The Chinese University of Hong Kong; Institute of Precision Engineering, Dept. of Mechanical and Automation Engineering, The Chinese University of Hong Kong",
        "aff_domain": "mae.cuhk.edu.hk;mae.cuhk.edu.hk",
        "email": "mae.cuhk.edu.hk;mae.cuhk.edu.hk",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Institute of Precision Engineering, Dept. of Mechanical and Automation Engineering, The Chinese University of Hong Kong",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "536a19bd98",
        "title": "Discriminatively-guided Deliberative Perception for Pose Estimation of Multiple 3D Object Instances",
        "site": "https://www.roboticsproceedings.org/rss12/p23.html",
        "author": "Venkatraman Narayanan; Maxim Likhachev",
        "abstract": "We introduce a novel paradigm for model-based multi-object recognition and 3 DoF pose estimation from 3D sensor data that integrates exhaustive global reasoning with discriminatively-trained algorithms in a principled fashion. Typ- ical approaches for this task are based on scene-to-model feature matching or regression by statistical learners trained on a large database of annotated scenes. These approaches are fast but sensitive to occlusions, features, and/or training data. Generative approaches, on the other hand, e.g., methods based on rendering and verification, are robust to occlusions and require no training, but are slow at test time. We conjecture that robust and efficient perception can be achieved through a combination of generative methods and discriminatively-trained approaches. To this end, we introduce the Discriminatively-guided Deliberative Perception (D2P) paradigm that has the following desirable properties: a) D2P is a single search algorithm that looks for the â\u0080\u0098bestâ\u0080\u0099 rendering of the scene that matches the input, b) can be guided by any and multiple discriminative algorithms, and c) generates a solution that is provably bounded suboptimal with respect to the chosen cost function. In addition, we introduce the notions of completeness and resolution completeness for multi-object pose estimation problems, and show that D2P is resolution complete. We conduct extensive evaluations on a benchmark dataset to study various aspects of D2P in relation to existing approaches.",
        "bibtex": "@INPROCEEDINGS{Narayanan-RSS-16, \r\n    AUTHOR    = {Venkatraman Narayanan AND Maxim Likhachev}, \r\n    TITLE     = {Discriminatively-guided Deliberative Perception for Pose Estimation of Multiple 3D Object Instances}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.023} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p23.pdf",
        "supp": "",
        "pdf_size": 3584369,
        "gs_citation": 50,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16537869050174367502&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 8,
        "aff": "The Robotics Institute, Carnegie Mellon University; The Robotics Institute, Carnegie Mellon University",
        "aff_domain": "cs.cmu.edu;cs.cmu.edu",
        "email": "cs.cmu.edu;cs.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Carnegie Mellon University",
        "aff_unique_dep": "The Robotics Institute",
        "aff_unique_url": "https://www.cmu.edu",
        "aff_unique_abbr": "CMU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "5c4c9caa0c",
        "title": "Efficient Grounding of Abstract Spatial Concepts for Natural Language Interaction with Robot Manipulators",
        "site": "https://www.roboticsproceedings.org/rss12/p37.html",
        "author": "Rohan Paul; Jacob Arkin; Nicholas Roy; Thomas M. Howard",
        "abstract": "Our goal is to develop models that allow a robot to understand natural language instructions in the context of its world representation. Contemporary models learn possible correspondences between parsed instructions and candidate groundings that include objects, regions and motion constraints. However, these models cannot reason about abstract concepts expressed in an instruction like, â\u0080\u009cpick up the middle block in the row of five blocksâ\u0080\u009d. In this work, we introduce a probabilistic model that incorporates an expressive space of abstract spatial concepts as well as notions of cardinality and ordinality. The graph is structured according to the parse structure of language and introduces a factorisation over abstract concepts correlated with concrete constituents. Inference in the model is posed as an approximate search procedure that leverages partitioning of the joint in terms of concrete and abstract factors. The algorithm first estimates a set of probable concrete constituents that constrains the search procedure to a reduced space of abstract concepts, pruning away improbable portions of the exponentially- large search space. Empirical evaluation demonstrates accurate grounding of abstract concepts embedded in complex natural language instructions commanding a robot manipulator. The proposed inference method leads to significant efficiency gains compared to the baseline, with minimal trade-off in accuracy",
        "bibtex": "@INPROCEEDINGS{Paul-RSS-16, \r\n    AUTHOR    = {Rohan Paul AND Jacob Arkin AND Nicholas Roy AND Thomas M. Howard}, \r\n    TITLE     = {Efficient Grounding of Abstract Spatial Concepts for Natural Language Interaction with Robot Manipulators}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.037} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p37.pdf",
        "supp": "",
        "pdf_size": 25032582,
        "gs_citation": 127,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=10406949498580427371&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "f4c8ed157e",
        "title": "Estimating SE(3) elements using a dual quaternion based linear Kalman filter",
        "site": "https://www.roboticsproceedings.org/rss12/p13.html",
        "author": "Rangaprasad Arun Srivatsan; Gillian T. Rosen; D. Feroze Naina Mohamed; Howie Choset",
        "abstract": "Many applications in robotics such as registration, object tracking, sensor calibration, etc. use Kalman filters to estimate a time invariant SE(3) element by locally linearizing a non-linear measurement model. Linearization-based filters tend to suffer from inaccurate estimates, and in some cases divergence, in the presence of large initialization errors. In this work, we use a dual quaternion to represent the S E (3) element and use multiple measurements simultaneously to rewrite the measurement model in a truly linear form with state dependent measurement noise. Use of the linear measurement model bypasses the need for any linearization in prescribing the Kalman filter, resulting in accurate estimates while being less sensitive to initial estimation error. To show the broad applicability of this approach, we derive linear measurement models for applications that use either position measurements or pose measurements. A procedure to estimate the state dependent measurement uncertainty is also discussed. The efficacy of the formulation is illustrated using simulations and hardware experiments for two applications in robotics: rigid registration and sensor calibration.",
        "bibtex": "@INPROCEEDINGS{Srivatsan-RSS-16, \r\n    AUTHOR    = {Rangaprasad Arun Srivatsan AND Gillian T. Rosen AND D. Feroze Naina Mohamed AND Howie Choset}, \r\n    TITLE     = {Estimating SE(3) elements using a dual quaternion based linear Kalman filter}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.013} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p13.pdf",
        "supp": "",
        "pdf_size": 2453229,
        "gs_citation": 51,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2044969211237628657&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 10,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "49a078868a",
        "title": "Functional Gradient Motion Planning in Reproducing Kernel Hilbert Spaces",
        "site": "https://www.roboticsproceedings.org/rss12/p46.html",
        "author": "Zita Marinho; Byron Boots; Anca Dragan; Arunkumar Byravan; Geoffrey J. Gordon; Siddhartha Srinivasa",
        "abstract": "We introduce a functional gradient descent tra- jectory optimization algorithm for robot motion planning in Reproducing Kernel Hilbert Spaces (RKHSs). Functional gra- dient algorithms are a popular choice for motion planning in complex many-degree-of-freedom robots, since they (in theory) work by directly optimizing within a space of continuous trajec- tories to avoid obstacles while maintaining geometric properties such as smoothness. However, in practice, implementations such as CHOMP and TrajOpt typically commit to a fixed, finite parametrization of trajectories, often as a sequence of waypoints. Such a parameterization can lose much of the benefit of reasoning in a continuous trajectory space: e.g., it can require taking an inconveniently small step size and large number of iterations to maintain smoothness. Our work generalizes functional gradient trajectory optimization by formulating it as minimization of a cost functional in an RKHS. This generalization lets us represent trajectories as linear combinations of kernel functions. As a re- sult, we are able to take larger steps and achieve a locally optimal trajectory in just a few iterations. Depending on the selection of kernel, we can directly optimize in spaces of trajectories that are inherently smooth in velocity, jerk, curvature, etc., and that have a low-dimensional, adaptively chosen parameterization. Our experiments illustrate the effectiveness of the planner for different kernels, including Gaussian RBFs with independent and coupled interactions among robot joints, Laplacian RBFs, and B-splines, as compared to the standard discretized waypoint representation.",
        "bibtex": "@INPROCEEDINGS{Marinho-RSS-16, \r\n    AUTHOR    = {Zita Marinho AND Byron Boots AND Anca Dragan AND Arunkumar Byravan AND Geoffrey J. Gordon AND Siddhartha Srinivasa}, \r\n    TITLE     = {Functional Gradient Motion Planning in Reproducing Kernel Hilbert Spaces}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.046} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p46.pdf",
        "supp": "",
        "pdf_size": 3005074,
        "gs_citation": 76,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12341498778123545655&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 16,
        "aff": "Robotics Institute, Carnegie Mellon University, USA+Instituto Superior Tecnico, Portugal; Interactive Computing, Georgia Institute of Technology, USA; EECS, University of California, Berkeley, USA; CSE, University of Washington, USA; Robotics Institute, Carnegie Mellon University, USA; Robotics Institute, Carnegie Mellon University, USA",
        "aff_domain": "cmu.edu;cc.gatech.edu;berkeley.edu;uw.edu;cs.cmu.edu;cs.cmu.edu",
        "email": "cmu.edu;cc.gatech.edu;berkeley.edu;uw.edu;cs.cmu.edu;cs.cmu.edu",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;2;3;4;0;0",
        "aff_unique_norm": "Carnegie Mellon University;Instituto Superior Tecnico, Portugal;Interactive Computing, Georgia Institute of Technology, USA;University of California, Berkeley;CSE, University of Washington, USA",
        "aff_unique_dep": "Robotics Institute;;;EECS;",
        "aff_unique_url": "https://www.cmu.edu;;;https://www.berkeley.edu;",
        "aff_unique_abbr": "CMU;;;UC Berkeley;",
        "aff_campus_unique_index": ";1",
        "aff_campus_unique": ";Berkeley",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "734114b016",
        "title": "Geometric Swimming on a Granular Surface",
        "site": "https://www.roboticsproceedings.org/rss12/p12.html",
        "author": "Jin Dai; Hossein Faraji; Chaohui Gong; Ross L. Hatton; Daniel I. Goldman; Howie Choset",
        "abstract": "Snake robots can contact their environments along their whole bodies. This distributed contact makes them versatile and robust locomotors, but also makes controlling them a chal- lenging problem involving high-dimensional configuration spaces, with no direct way to break their motion down into â\u0080\u009cdrivingâ\u0080\u009d and â\u0080\u009csteeringâ\u0080\u009d actions. In this paper, we use concepts from geometric mechanicsâ\u0080\u0094e.g., expanded Lie bracket analysisâ\u0080\u0094to simplify the problem of controlling a snake robot moving across a granular surface. Without needing force laws that model the interaction of the snake robot with the granular surface, the relationship between shape and body velocities can be experimentally derived by perturbing the robotâ\u0080\u0099s shape from a sampling of initial configurations, which allows us to: 1. Generate an intuitive and visualizable relationship between gait cycles and the motion they induce; 2. Make accurate predictions about the most efficient gaits available to the robot; and 3. Identify an effective turning gait for the robot that to the best of our knowledge has not previously appeared in the snake robot literature. This geometric analysis of snake robot locomotion serves as a demonstration of how differential-geometric tools can provide insight into the motion of systems that do not have the analytic models often associated with such approaches.",
        "bibtex": "@INPROCEEDINGS{Dai-RSS-16, \r\n    AUTHOR    = {Jin Dai AND Hossein Faraji AND Chaohui Gong AND Ross L. Hatton AND Daniel I. Goldman AND Howie Choset}, \r\n    TITLE     = {Geometric Swimming on a Granular Surface}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.012} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p12.pdf",
        "supp": "",
        "pdf_size": 7256011,
        "gs_citation": 51,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13062820763957319006&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "aff": "The Robotics Institute+School of Computer Science+College of Engineering; Robotics Program+College of Engineering; The Robotics Institute+School of Computer Science+College of Engineering; Robotics Program+College of Engineering; School of Physics+College of Sciences; The Robotics Institute+School of Computer Science+College of Engineering",
        "aff_domain": "cmu.edu;oregonstate.edu;cmu.edu;oregonstate.edu;physics.gatech.edu;cmu.edu",
        "email": "cmu.edu;oregonstate.edu;cmu.edu;oregonstate.edu;physics.gatech.edu;cmu.edu",
        "github": "",
        "project": "",
        "author_num": 6,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1+2;3+2;0+1+2;3+2;4+5;0+1+2",
        "aff_unique_norm": "The Robotics Institute;School of Computer Science;College of Engineering;Robotics Program;School of Physics;College of Sciences",
        "aff_unique_dep": ";Computer Science;;;;",
        "aff_unique_url": ";;;;;",
        "aff_unique_abbr": ";;;;;",
        "aff_campus_unique_index": ";;;;;",
        "aff_campus_unique": "",
        "aff_country_unique_index": ";;;;;",
        "aff_country_unique": ""
    },
    {
        "id": "3338cbcdf4",
        "title": "Incremental Task and Motion Planning: A Constraint-Based Approach",
        "site": "https://www.roboticsproceedings.org/rss12/p02.html",
        "author": "Neil T. Dantam; Zachary K. Kingston; Swarat Chaudhuri; Lydia E. Kavraki",
        "abstract": "We present a new algorithm for task and motion planning (TMP) and discuss the requirements and abstrac- tions necessary to obtain robust solutions for TMP in general. Our Iteratively Deepened Task and Motion Planning (IDTMP) method is probabilistically-complete and offers improved per- formance and generality compared to a similar, state-of-the- art, probabilistically-complete planner. The key idea of IDTMP is to leverage incremental constraint solving to efficiently add and remove constraints on motion feasibility at the task level. We validate IDTMP on a physical manipulator and evaluate scalability on scenarios with many objects and long plans, showing order-of-magnitude gains compared to the benchmark planner and a four-times self-comparison speedup from our extensions. Finally, in addition to describing a new method for TMP and its implementation on a physical robot, we also put forward requirements and abstractions for the development of similar planners in the future.",
        "bibtex": "@INPROCEEDINGS{Dantam-RSS-16, \r\n    AUTHOR    = {Neil T. Dantam AND Zachary K. Kingston AND Swarat Chaudhuri AND Lydia E. Kavraki}, \r\n    TITLE     = {Incremental Task and Motion Planning: A Constraint-Based Approach}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.002} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p02.pdf",
        "supp": "",
        "pdf_size": 5547811,
        "gs_citation": 267,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=5952843449543649857&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 12,
        "aff": "Department of Computer Science, Rice University, Houston, TX 77005, USA; Department of Computer Science, Rice University, Houston, TX 77005, USA; Department of Computer Science, Rice University, Houston, TX 77005, USA; Department of Computer Science, Rice University, Houston, TX 77005, USA",
        "aff_domain": "rice.edu;rice.edu;rice.edu;rice.edu",
        "email": "rice.edu;rice.edu;rice.edu;rice.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Rice University",
        "aff_unique_dep": "Department of Computer Science",
        "aff_unique_url": "https://www.rice.edu",
        "aff_unique_abbr": "Rice",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Houston",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "7b731f6aeb",
        "title": "Integrated force and distance sensing using elastomer-embedded commodity proximity sensors",
        "site": "https://www.roboticsproceedings.org/rss12/p35.html",
        "author": "Radhen Patel; Nikolaus Correll",
        "abstract": "We describe a combined force and distance sensor using a commodity infrared distance sensor embedded in a transparent elastomer with applications in robotic manipulation. Prior to contact, the sensor works as a distance sensor (0â\u0080\u009310 cm), whereas after contact the material doubles as a spring, with force proportional to the compression of the elastomer (0â\u0080\u0093 5 N). We describe its principle of operation and de- sign parameters, including polymer thickness, mixing ratio, and emitter current, and show that the sensor response has an inflection point at contact that is independent of an objectâ\u0080\u0099s surface properties. We then demonstrate how two arrays of eight sensors, each mounted on a standard Baxter gripper, can be used to (1) improve gripper alignment during grasping, (2) determine contact points with objects, and (3) obtain crude 3D models that can serve to determine possible grasp locations.",
        "bibtex": "@INPROCEEDINGS{Patel-RSS-16, \r\n    AUTHOR    = {Radhen Patel AND Nikolaus Correll}, \r\n    TITLE     = {Integrated force and distance sensing using elastomer-embedded commodity proximity sensors}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.035} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p35.pdf",
        "supp": "",
        "pdf_size": 12542535,
        "gs_citation": 58,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=7761165205227633279&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 3,
        "aff": "Department of Computer Science, University of Colorado, Boulder, CO 80309, USA; Department of Computer Science, University of Colorado, Boulder, CO 80309, USA",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Department of Computer Science, University of Colorado, Boulder, CO 80309, USA",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "9cf359b693",
        "title": "Lessons from the Amazon Picking Challenge: Four Aspects of Building Robotic Systems",
        "site": "https://www.roboticsproceedings.org/rss12/p36.html",
        "author": "Clemens Eppner; Sebastian HÃ¶fer; Rico Jonschkowski; Roberto MartÃ­n-MartÃ­n; Arne Sieverling; Vincent Wall; Oliver Brock",
        "abstract": "We describe the winning entry to the Amazon Picking Challenge. From the experience of building this system and competing in the Amazon Picking Challenge, we derive several conclusions: 1) We suggest to characterize robotic systems building along four key aspects, each of them spanning a spectrum of solutions: modularity vs. integration, generality vs. assumptions, computation vs. embodiment, and planning vs. feedback. 2) To understand which region of each spectrum most adequately addresses which robotic problem, we must explore the full spectrum of possible approaches. To achieve this, our community should agree on key aspects that characterize the solution space of robotic systems. 3) For manipulation problems in unstructured environments, certain regions of each spectrum match the problem most adequately, and should be exploited further. This is supported by the fact that our solution deviated from the majority of the other challenge entries along each of the spectra.",
        "bibtex": "@INPROCEEDINGS{Eppner-RSS-16, \r\n    AUTHOR    = {Clemens Eppner and Sebastian H{\\\"o}fer and Rico Jonschkowski and Roberto Mart{\\'i}n-Mart{\\'i}n and Arne Sieverling and Vincent Wall and Oliver Brock}, \r\n    TITLE     = {Lessons from the Amazon Picking Challenge: Four Aspects of Building Robotic Systems}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.036} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p36.pdf",
        "supp": "",
        "pdf_size": 4044169,
        "gs_citation": 280,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16930088242427897784&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 11,
        "aff": "Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany; Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany; Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany; Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany; Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany; Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany; Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany",
        "aff_domain": ";;;;;;",
        "email": ";;;;;;",
        "github": "",
        "project": "",
        "author_num": 7,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0;0;0",
        "aff_unique_norm": "Robotics and Biology Laboratory, Technische Universit\"at Berlin, Germany",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "f2abb57df0",
        "title": "Mathematical Tools for Analysis, Simulation and Design of Robotic Angular Encoders",
        "site": "https://www.roboticsproceedings.org/rss12/p28.html",
        "author": "Peter G. Cramer",
        "abstract": "A set of practical mathematical tools for creating self correcting, self compensating optical angular encoders is presented. Included is [a] a discussion and proof of the so-called Angular Encoder Theorem, which is the fundamental element of real time self correction based on read head symmetry aver- aging; [b] a discussion and derivation of the self-compensation equations, which can be used in tandem with the encoder theorem to increase accuracy further; [c] a kinematic model which can be used to simulate realistic operational scenarios; and [d] rules of thumb and implications for the designer. Sample simulation results and sample test results are also presented. These tools enable the designer to work out cost-effective encoder designs to meet different accuracy requirements for different applications. Such encoders automatically retain their accuracy over indefinite periods of time without human intervention of any kind and are thus well suited for challenging robotic applications. These tools can and have been used to construct cost-effective encoders with demonstrated sub-arcsecond accuracy. Finally, sample source code is available online.",
        "bibtex": "@INPROCEEDINGS{Cramer-RSS-16, \r\n    AUTHOR    = {Peter G. Cramer}, \r\n    TITLE     = {Mathematical Tools for Analysis, Simulation and Design of Robotic Angular Encoders}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.028} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p28.pdf",
        "supp": "",
        "pdf_size": 1629029,
        "gs_citation": 0,
        "gs_cited_by_link": "https://scholar.google.com/scholar?q=related:zMuEXQ-YyD4J:scholar.google.com/&scioq=Mathematical+Tools+for+Analysis,+Simulation+and+Design+of+Robotic+Angular+Encoders&hl=en&as_sdt=0,33",
        "gs_version_total": 4,
        "aff": "",
        "aff_domain": "",
        "email": "",
        "github": "",
        "project": "",
        "author_num": 1,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "48bb59b23e",
        "title": "Mechanical Antagonism in Legged Robots",
        "site": "https://www.roboticsproceedings.org/rss12/p08.html",
        "author": "Andy Abate; Jonathan W. Hurst; Ross L. Hatton",
        "abstract": "In this work, we use first principles of kinematics to provide a fundamental insight into mechanical power distribution within multi-actuator machines. Individual actuator powersâ\u0080\u0094not their net sumâ\u0080\u0094determine the efficiency and actuator size of a multi-joint machine. Net power delivered to the environment naturally discards important information about how that power is generated. For example, simultaneous positive and negative powers will cancel within a mechanism, wasting energy and raising peak power requirements. The same effect can bias power draw toward a single actuator while the other actuators do zero work. In general, it is best for all actuators to contribute equally to the net power demand because balance minimizes the mechanical power requirements of individual actuators. In this paper, we present the actuation power space, within which we measure the antagonism in a machine (joints working against each other due to kinematic constraints). We show the difference between the net power consumed by the task and the total power supplied by the actuators. We derive the power quality measure as a smooth objective function which encodes both antagonism and the balance of power between actuators. As a demonstration of our general framework, we apply our technique to a legged-robot design to find improved kinematics for performing a running gait. This technique finds mechanisms with optimal power distribution, regardless of actuator choice or loss models, so it can be applied early in the design process using mechanism kinematics alone. After choosing appropriate kinematics for an application, designers can independently optimize each actuator in a design to minimize local losses.",
        "bibtex": "@INPROCEEDINGS{Abate-RSS-16, \r\n    AUTHOR    = {Andy Abate AND Jonathan W. Hurst AND Ross L. Hatton}, \r\n    TITLE     = {Mechanical Antagonism in Legged Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.008} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p08.pdf",
        "supp": "",
        "pdf_size": 699653,
        "gs_citation": 51,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=12129559846650841570&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "Robotics Program, School of Mechanical, Industrial, and Manufacturing Engineering, Oregon State University, Corvallis, Oregon 97331–6001; Robotics Program, School of Mechanical, Industrial, and Manufacturing Engineering, Oregon State University, Corvallis, Oregon 97331–6001; Robotics Program, School of Mechanical, Industrial, and Manufacturing Engineering, Oregon State University, Corvallis, Oregon 97331–6001",
        "aff_domain": "oregonstate.edu;oregonstate.edu;oregonstate.edu",
        "email": "oregonstate.edu;oregonstate.edu;oregonstate.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Robotics Program, School of Mechanical, Industrial, and Manufacturing Engineering, Oregon State University, Corvallis, Oregon 97331–6001",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "a6e2a9dad7",
        "title": "Motion Planning as Probabilistic Inference using Gaussian Processes and Factor Graphs",
        "site": "https://www.roboticsproceedings.org/rss12/p01.html",
        "author": "Jing Dong; Mustafa Mukadam; Frank Dellaert; Byron Boots",
        "abstract": "With the increased use of high degree-of-freedom robots that must perform tasks in real-time, there is a need for fast algorithms for motion planning. In this work, we view motion planning from a probabilistic perspective. We consider smooth continuous-time trajectories as samples from a Gaussian process (GP) and formulate the planning problem as probabilistic inference. We use factor graphs and numerical optimization to perform inference quickly, and we show how GP interpolation can further increase the speed of the algorithm. Our framework also allows us to incrementally update the solution of the planning problem to contend with changing conditions. We benchmark our algorithm against several recent trajectory optimization algorithms on planning problems in multiple environments. Our evaluation reveals that our approach is several times faster than previous algorithms while retaining robustness. Finally, we demonstrate the incremental version of our algorithm on replanning problems, and show that it often can find successful solutions in a fraction of the time required to replan from scratch.",
        "bibtex": "@INPROCEEDINGS{Dong-RSS-16, \r\n    AUTHOR    = {Jing Dong AND Mustafa Mukadam AND Frank Dellaert AND Byron Boots}, \r\n    TITLE     = {Motion Planning as Probabilistic Inference using Gaussian Processes and Factor Graphs}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.001} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p01.pdf",
        "supp": "",
        "pdf_size": 2193374,
        "gs_citation": 171,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=782617941792676259&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Institute for Robotics & Intelligent Machines, Georgia Institute of Technology, Atlanta, GA, USA; Institute for Robotics & Intelligent Machines, Georgia Institute of Technology, Atlanta, GA, USA; Institute for Robotics & Intelligent Machines, Georgia Institute of Technology, Atlanta, GA, USA; Institute for Robotics & Intelligent Machines, Georgia Institute of Technology, Atlanta, GA, USA",
        "aff_domain": "gatech.edu;gatech.edu;cc.gatech.edu;cc.gatech.edu",
        "email": "gatech.edu;gatech.edu;cc.gatech.edu;cc.gatech.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "Georgia Institute of Technology",
        "aff_unique_dep": "Institute for Robotics & Intelligent Machines",
        "aff_unique_url": "https://www.gatech.edu",
        "aff_unique_abbr": "Georgia Tech",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Atlanta",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "a92d584fa3",
        "title": "Multi-modal Auto-Encoders as Joint Estimators for Robotics Scene Understanding",
        "site": "https://www.roboticsproceedings.org/rss12/p41.html",
        "author": "Cesar Cadena; Anthony Dick; Ian D. Reid",
        "abstract": "We explore the capabilities of Auto-Encoders to fuse the information available from cameras and depth sensors, and to reconstruct missing data, for scene understanding tasks. In particular we consider three input modalities: RGB images; depth images; and semantic label information. We seek to generate complete scene segmentations and depth maps, given images and partial and/or noisy depth and semantic data. We formulate this objective of reconstructing one or more types of scene data using a Multi-modal stacked Auto-Encoder. We show that suitably designed Multi-modal Auto-Encoders can solve the depth estimation and the semantic segmentation problems simultaneously, in the partial or even complete absence of some of the input modalities. We demonstrate our method using the outdoor dataset KITTI that includes LIDAR and stereo cameras. Our results show that as a means to estimate depth from a single image, our method is comparable to the state-of-the-art, and can run in real time (i.e., less than 40ms per frame). But we also show that our method has a significant advantage over other methods in that it can seamlessly use additional data that may be available, such as a sparse point-cloud and/or incomplete coarse semantic labels.",
        "bibtex": "@INPROCEEDINGS{Cadena-RSS-16, \r\n    AUTHOR    = {Cesar Cadena AND Anthony Dick AND Ian D. Reid}, \r\n    TITLE     = {Multi-modal Auto-Encoders as Joint Estimators for Robotics Scene Understanding}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.041} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p41.pdf",
        "supp": "",
        "pdf_size": 2245959,
        "gs_citation": 122,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16477146109420744547&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 6,
        "aff": "Autonomous Systems Lab, ETH Zurich, Zurich, Switzerland 8092; School of Computer Science, The University of Adelaide, Adelaide, Australia 5005; School of Computer Science, The University of Adelaide, Adelaide, Australia 5005",
        "aff_domain": "ethz.ch;adelaide.edu.au;adelaide.edu.au",
        "email": "ethz.ch;adelaide.edu.au;adelaide.edu.au",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1",
        "aff_unique_norm": "Autonomous Systems Lab, ETH Zurich, Zurich, Switzerland 8092;School of Computer Science, The University of Adelaide, Adelaide, Australia 5005",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "c3b61f4d1b",
        "title": "New perspective on sampling-based motion planning via random geometric graphs",
        "site": "https://www.roboticsproceedings.org/rss12/p03.html",
        "author": "Kiril Solovey; Oren Salzman; Dan Halperin",
        "abstract": "Roadmaps constructed by many sampling-based motion planners coincide, in the absence of obstacles, with standard models of random geometric graphs (RGGs). Those models have been studied for several decades and by now a rich body of literature exists analyzing various properties and types of RGGs. In their seminal work on optimal motion planning Karaman and Frazzoli [31] conjectured that a sampling-based planner has a certain property if the underlying RGG has this property as well. In this paper we settle this conjecture and leverage it for the development of a general framework for the analysis of sampling-based planners. Our framework, which we call localization-tessellation, allows for easy transfer of arguments on RGGs from the free unit-hypercube to spaces punctured by obstacles, which are geometrically and topologically much more complex. We demonstrate its power by providing alternative and (arguably) simple proofs for probabilistic completeness and asymptotic (near-)optimality of probabilistic roadmaps (PRMs). Furthermore, we introduce two variants of PRMs, analyze them using our framework, and discuss the implications of the analysis.",
        "bibtex": "@INPROCEEDINGS{Solovey-RSS-16, \r\n    AUTHOR    = {Kiril Solovey AND Oren Salzman AND Dan Halperin}, \r\n    TITLE     = {New perspective on sampling-based motion planning via random geometric graphs}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.003} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p03.pdf",
        "supp": "",
        "pdf_size": 386208,
        "gs_citation": 51,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=14120299293786011744&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 14,
        "aff": "Blavatnic School of Computer Science, Tel Aviv University, Israel; Blavatnic School of Computer Science, Tel Aviv University, Israel; Blavatnic School of Computer Science, Tel Aviv University, Israel",
        "aff_domain": "post.tau.ac.il;post.tau.ac.il;post.tau.ac.il",
        "email": "post.tau.ac.il;post.tau.ac.il;post.tau.ac.il",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Blavatnic School of Computer Science, Tel Aviv University, Israel",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "8f85e8f073",
        "title": "Online Feedback Control for Input-Saturated Robotic Systems on Lie Groups",
        "site": "https://www.roboticsproceedings.org/rss12/p27.html",
        "author": "Taosha Fan; Todd Murphey",
        "abstract": "In this paper, we propose an approach to designing online feedback controllers for input-saturated robotic systems evolving on Lie groups by extending the recently developed Sequential Action Control (SAC). In contrast to existing feedback controllers, our approach poses the nonconvex constrained non- linear optimization problem as the tracking of a desired negative mode insertion gradient on the configuration space of a Lie group. This results in a closed-form feedback control law even with input saturation and thus is well suited for online application. In extending SAC to Lie groups, the associated mode insertion gradient is derived and the switching time optimization on Lie groups is studied. We demonstrate the efficacy and scalability of our approach in the 2D kinematic car on SE(2) and the 3D quadrotor on SE(3). We also implement iLQG on a quadrator model and compare to SAC, demonstrating that SAC is both faster to compute and has a larger basin of attraction.",
        "bibtex": "@INPROCEEDINGS{Fan-RSS-16, \r\n    AUTHOR    = {Taosha Fan AND Todd Murphey}, \r\n    TITLE     = {Online Feedback Control for Input-Saturated Robotic Systems on Lie Groups}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.027} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p27.pdf",
        "supp": "",
        "pdf_size": 976244,
        "gs_citation": 18,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=227363188862316143&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Department of Mechanical Engineering, Northwestern University; Department of Mechanical Engineering, Northwestern University",
        "aff_domain": "u.northwestern.edu;northwestern.edu",
        "email": "u.northwestern.edu;northwestern.edu",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Northwestern University",
        "aff_unique_dep": "Department of Mechanical Engineering",
        "aff_unique_url": "https://www.northwestern.edu",
        "aff_unique_abbr": "NU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "938001d5b0",
        "title": "Planar Time Optimal Paths for Non-Symmetric Vehicles in Constant Flows",
        "site": "https://www.roboticsproceedings.org/rss12/p31.html",
        "author": "Bilal Hammoud; Elie Shammas",
        "abstract": "This paper introduces a new kinematic model to describe the planar motion of an Autonomous Underwater Vehicle (AUV) moving in constant current flows. The AUV is modeled as a rigid body moving at maximum attainable forward velocity with symmetric bounds on the control input for the turning rate. The model incorporates the effect a flow will induce on the turning rate of the AUV due to the non-symmetric geometry of the vehicle. The model is then used to characterize and construct the minimum time paths that take the AUV from a given initial configuration to a final configuration in the plane. Two algorithms for the time-optimal path synthesis problem are also introduced along with several simulations to validate the proposed method.",
        "bibtex": "@INPROCEEDINGS{Hammoud-RSS-16, \r\n    AUTHOR    = {Bilal Hammoud AND Elie Shammas}, \r\n    TITLE     = {Planar Time Optimal Paths for Non-Symmetric Vehicles in Constant Flows}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.031} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p31.pdf",
        "supp": "",
        "pdf_size": 1027185,
        "gs_citation": 4,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=15285545076424941833&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": "Department of Mechanical Engineering, American University of Beirut; Department of Mechanical Engineering, American University of Beirut",
        "aff_domain": ";",
        "email": ";",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Department of Mechanical Engineering, American University of Beirut",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "a8995e7363",
        "title": "Planning for Autonomous Cars that Leverage Effects on Human Actions",
        "site": "https://www.roboticsproceedings.org/rss12/p29.html",
        "author": "Dorsa Sadigh; Shankar Sastry; Sanjit A. Seshia; Anca D. Dragan",
        "abstract": "Traditionally, autonomous cars make predic- tions about other driversâ\u0080\u0099 future trajectories, and plan to stay out of their way. This tends to result in defensive and opaque behaviors. Our key insight is that an autonomous carâ\u0080\u0099s actions will actually affect what other cars will do in response, whether the car is aware of it or not. Our thesis is that we can leverage these responses to plan more efficient and communicative behaviors. We model the interaction between an autonomous car and a human driver as a dy- namical system, in which the robotâ\u0080\u0099s actions have immediate consequences on the state of the car, but also on human actions. We model these consequences by approximating the human as an optimal planner, with a reward function that we acquire through Inverse Reinforcement Learning. When the robot plans with this reward function in this dynamical system, it comes up with actions that purposefully change human state: it merges in front of a human to get them to slow down or to reach its own goal faster; it blocks two lanes to get them to switch to a third lane; or it backs up slightly at an intersection to get them to proceed first. Such behaviors arise from the optimization, without relying on hand-coded signaling strategies and without ever explicitly modeling communication. Our user study results suggest that the robot is indeed capable of eliciting desired changes in human state by planning using this dynamical system.",
        "bibtex": "@INPROCEEDINGS{Sadigh-RSS-16, \r\n    AUTHOR    = {Dorsa Sadigh AND Shankar Sastry AND Sanjit A. Seshia AND Anca D. Dragan}, \r\n    TITLE     = {Planning for Autonomous Cars that Leverage Effects on Human Actions}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.029} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p29.pdf",
        "supp": "",
        "pdf_size": 10615725,
        "gs_citation": 661,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=1084842491225972805&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "aff": "University of California, Berkeley; University of California, Berkeley; University of California, Berkeley; University of California, Berkeley",
        "aff_domain": "eecs.berkeley.edu;eecs.berkeley.edu;eecs.berkeley.edu;eecs.berkeley.edu",
        "email": "eecs.berkeley.edu;eecs.berkeley.edu;eecs.berkeley.edu;eecs.berkeley.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0",
        "aff_unique_norm": "University of California, Berkeley",
        "aff_unique_dep": "",
        "aff_unique_url": "https://www.berkeley.edu",
        "aff_unique_abbr": "UC Berkeley",
        "aff_campus_unique_index": "0;0;0;0",
        "aff_campus_unique": "Berkeley",
        "aff_country_unique_index": "0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "f9fa2c6d02",
        "title": "Probabilistic Approaches to the AXB = YCZ Calibration Problem in Multi-Robot Systems",
        "site": "https://www.roboticsproceedings.org/rss12/p14.html",
        "author": "Qianli Ma; Zachariah Goh; Gregory S. Chirikjian",
        "abstract": "In recent years, the topic of multi-robot systems has become very popular. These systems have been demonstrated in various applications, including exploration, construction, and warehouse operations. In order for the whole system to function properly, sensor calibrations such as determining the camera frame relative to the IMU frame are important. Compared to the traditional hand-eye & robot-world calibration, a relatively new problem called the AX B = Y C Z calibration problem arises in the multi-robot scenario, where A, B, C are rigid body transformations measured from sensors and X,Y,Z are unknown transformations to be calibrated. Several solvers have been proposed previously in different application areas that can solve for X, Y and Z simultaneously. However, all of the solvers assume a priori knowledge of the exact correspondence among the data streams {Ai}, {Bi} and {Ci}. While that assumption may be justified in some scenarios, in the application domain of multi-robot systems, which may use ad hoc and asynchronous communication protocols, knowledge of this correspondence gen- erally cannot be assumed. Moreover, the existing methods in the literature require good initial estimates that are not always easy or possible to obtain. In this paper, we propose two probabilistic approaches that can solve the AXB = Y CZ problem without a priori knowledge of the correspondence of the data. In addition, no initial estimates are required for recovering X, Y and Z. These methods are particularly well suited for multi-robot systems, and also apply to other areas of robotics in which AXB = YCZ arises.",
        "bibtex": "@INPROCEEDINGS{Ma-RSS-16, \r\n    AUTHOR    = {Qianli Ma AND Zachariah Goh AND Gregory S. Chirikjian}, \r\n    TITLE     = {Probabilistic Approaches to the AXB = YCZ Calibration Problem in Multi-Robot Systems}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.014} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p14.pdf",
        "supp": "",
        "pdf_size": 789896,
        "gs_citation": 49,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17352483082085082753&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 9,
        "aff": "Department of Mechanical Engineering, Johns Hopkins University; Department of Mechanical Engineering, Johns Hopkins University; Department of Mechanical Engineering, Johns Hopkins University",
        "aff_domain": "jhu.edu;jhu.edu;jhu.edu",
        "email": "jhu.edu;jhu.edu;jhu.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Johns Hopkins University",
        "aff_unique_dep": "Department of Mechanical Engineering",
        "aff_unique_url": "https://www.jhu.edu",
        "aff_unique_abbr": "JHU",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "8448b480ca",
        "title": "Recursive Decentralized Collaborative Localization for Sparsely Communicating Robots",
        "site": "https://www.roboticsproceedings.org/rss12/p16.html",
        "author": "Lukas Luft; Tobias Schubert; Stergios I. Roumeliotis; Wolfram Burgard",
        "abstract": "This paper provides a new fully-decentralized al- gorithm for Collaborative Localization based on the extended Kalman filter. The major challenge in decentralized collaborative localization is to track inter-robot dependencies â\u0080\u0093 which is particularly difficult in situations where sustained synchronous communication between robots cannot be guaranteed. Current approaches suffer from the need for particular communica- tion schemes, extensive bookkeeping of measurements, overly- conservative assumptions, or the restriction to specific mea- surement models. To the best of our knowledge, the algorithm we propose in this paper is the first one that tracks inter- robot correlations while fulfilling all of the following relevant conditions: communication is limited to two robots that obtain a relative measurement, the algorithm is recursive in the sense that it does not require storage of measurements and each robot maintains only the latest estimate of its own pose, and it supports generic measurement models. These particularly hard conditions make the approach applicable to a wide range of multi-robot applications. Extensive experiments carried out using real world datasets demonstrate the improved performance of our method compared to several existing approaches.",
        "bibtex": "@INPROCEEDINGS{Luft-RSS-16, \r\n    AUTHOR    = {Lukas Luft AND Tobias Schubert AND Stergios I. Roumeliotis AND Wolfram Burgard}, \r\n    TITLE     = {Recursive Decentralized Collaborative Localization for Sparsely Communicating Robots}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.016} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p16.pdf",
        "supp": "",
        "pdf_size": 618690,
        "gs_citation": 63,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3686191389764699624&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": ";;;",
        "aff_domain": ";;;",
        "email": ";;;",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "9cc89cf0c2",
        "title": "Representing and Learning Complex Object Interactions",
        "site": "https://www.roboticsproceedings.org/rss12/p39.html",
        "author": "Yilun Zhou; George Konidaris",
        "abstract": "We present a framework for representing scenarios with complex object interactions, in which a robot cannot directly interact with the object it wishes to control, but must instead do so via intermediate objects. For example, a robot learning to drive a car can only indirectly change its pose, by rotating the steering wheel. We formalize such complex interactions as chains of Markov decision processes and show how they can be learned and used for control. We describe two systems in which a robot uses learning from demonstration to achieve indirect control: playing a computer game, and using a hot water dispenser to heat a cup of water.",
        "bibtex": "@INPROCEEDINGS{Zhou-RSS-16, \r\n    AUTHOR    = {Yilun Zhou AND George Konidaris}, \r\n    TITLE     = {Representing and Learning Complex Object Interactions}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.039} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p39.pdf",
        "supp": "",
        "pdf_size": 14856937,
        "gs_citation": 1,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=6621760320912567558&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 4,
        "aff": "Duke Robotics; Duke Robotics",
        "aff_domain": "cs.duke.edu;cs.duke.edu",
        "email": "cs.duke.edu;cs.duke.edu",
        "github": "",
        "project": "https://www.youtube.com/watch?v=TJlxXX1v6S4",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0",
        "aff_unique_norm": "Duke Robotics",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "57b8a1e467",
        "title": "Robot Motion Planning on a Chip",
        "site": "https://www.roboticsproceedings.org/rss12/p04.html",
        "author": "Sean Murray; Will Floyd-Jones; Ying Qi; Daniel Sorin; George Konidaris",
        "abstract": "We describe a process that constructs robot-specific circuitry for motion planning, capable of generating motion plans approximately three orders of magnitude faster than existing methods. Our method is based on building collision detection circuits for a probabilistic roadmap. Collision detection for the roadmap edges is completely parallelized, so that the time to determine which edges are in collision is independent of the number of edges. We demonstrate planning using a 6-degree- of-freedom robot arm in less than 1 millisecond.",
        "bibtex": "@INPROCEEDINGS{Murray-RSS-16, \r\n    AUTHOR    = {Sean Murray AND Will Floyd-Jones AND Ying Qi AND Daniel Sorin AND George Konidaris}, \r\n    TITLE     = {Robot Motion Planning on a Chip}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.004} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p04.pdf",
        "supp": "",
        "pdf_size": 10843805,
        "gs_citation": 164,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4950989429593228489&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 2,
        "aff": "Duke Robotics; Duke University; Duke University; Duke University; Duke University",
        "aff_domain": "; ; ; ; ",
        "email": "; ; ; ; ",
        "github": "",
        "project": "https://youtu.be/u4snHhSAo",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;1;1",
        "aff_unique_norm": "Duke Robotics;Duke University",
        "aff_unique_dep": ";",
        "aff_unique_url": ";https://www.duke.edu",
        "aff_unique_abbr": ";Duke",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "1;1;1;1",
        "aff_country_unique": ";United States"
    },
    {
        "id": "9419e3c19e",
        "title": "Robotic Assistance in Coordination of Patient Care",
        "site": "https://www.roboticsproceedings.org/rss12/p26.html",
        "author": "Matthew Gombolay; Xi Jessie Yang; Brad Hayes; Nicole Seo; Zixi Liu; Samir Wadhwania; Tania Yu; Neel Shah; Toni Golen; Julie Shah",
        "abstract": "We conducted a study to investigate trust in and dependence upon robotic decision support among nurses and doctors on a labor and delivery floor. There is evidence that suggestions provided by embodied agents engender inappropriate degrees of trust and reliance among humans. This concern is a critical barrier that must be addressed before fielding intelligent hospital service robots that take initiative to coordinate patient care. Our experiment was conducted with nurses and physicians, and evaluated the subjectsâ\u0080\u0099 levels of trust in and dependence on high- and low-quality recommendations issued by robotic versus computer-based decision support. The support, generated through action-driven learning from expert demonstration, was shown to produce high-quality recommendations that were ac- cepted by nurses and physicians at a compliance rate of 90%. Rates of Type I and Type II errors were comparable between robotic and computer-based decision support. Furthermore, em- bodiment appeared to benefit performance, as indicated by a higher degree of appropriate dependence after the quality of recommendations changed over the course of the experiment. These results support the notion that a robotic assistant may be able to safely and effectively assist in patient care. Finally, we conducted a pilot demonstration in which a robot assisted resource nurses on a labor and delivery floor at a tertiary care center.",
        "bibtex": "@INPROCEEDINGS{Gombolay-RSS-16, \r\n    AUTHOR    = {Matthew Gombolay AND Xi Jessie Yang AND Brad Hayes AND Nicole Seo AND Zixi Liu AND Samir Wadhwania AND Tania Yu AND Neel Shah AND Toni Golen AND Julie Shah}, \r\n    TITLE     = {Robotic Assistance in Coordination of Patient Care}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.026} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p26.pdf",
        "supp": "",
        "pdf_size": 6140866,
        "gs_citation": -1,
        "gs_cited_by_link": "",
        "gs_version_total": -1,
        "aff": "Massachusetts Institute of Technology; Massachusetts Institute of Technology; Massachusetts Institute of Technology; Massachusetts Institute of Technology; Massachusetts Institute of Technology; Massachusetts Institute of Technology; Massachusetts Institute of Technology; Beth Israel Deaconess Medical Center; Beth Israel Deaconess Medical Center; Massachusetts Institute of Technology",
        "aff_domain": "csail.mit.edu;csail.mit.edu;mit.edu;mit.edu;mit.edu;mit.edu;mit.edu;bidmc.harvard.edu;bidmc.harvard.edu;csail.mit.edu",
        "email": "csail.mit.edu;csail.mit.edu;mit.edu;mit.edu;mit.edu;mit.edu;mit.edu;bidmc.harvard.edu;bidmc.harvard.edu;csail.mit.edu",
        "github": "",
        "project": "",
        "author_num": 10,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0;0;0;0;0;1;1;0",
        "aff_unique_norm": "Massachusetts Institute of Technology;Beth Israel Deaconess Medical Center",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://web.mit.edu;https://www.bethisraeldeaconess.org",
        "aff_unique_abbr": "MIT;BIDMC",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "0;0;0;0;0;0;0;0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "77c5b27f58",
        "title": "Robust Multimodal Sequence-Based Loop Closure Detection via Structured Sparsity",
        "site": "https://www.roboticsproceedings.org/rss12/p43.html",
        "author": "Hao Zhang; Fei Han; Hua Wang",
        "abstract": "Loop closure detection is an essential component for simultaneously localization and mapping in a variety of robotics applications. One of the most challenging problems is to perform long-term place recognition with strong perceptual aliasing and appearance variations due to changes of illumination, vegetation, weather, etc. To address this challenge, we propose a novel Robust Multimodal Sequence-based (ROMS) method for long-term loop closure detection, by formulating image sequence matching as an optimization problem regularized by structured sparsity-inducing norms. Our method is able to model the sparsity nature of place recognition, i.e., the current location should match only a small subset of previously visited places, as well as to model underlying structures of image sequences and incorporate multiple feature modalities to construct a discriminative scene representation. In addition, a new optimization algorithm is developed to efficiently solve the formulated problem, which has a theoretical guarantee to converge to the global optimal solution. To evaluate the ROMS algorithm, extensive experiments are performed using large-scale benchmark datasets, including St Lucia, CMU-VL, and Nordland datasets. Experimental results have validated that our algorithm outperforms previous loop closure detection methods, and obtains the state-of-the-art performance on long-term place recognition.",
        "bibtex": "@INPROCEEDINGS{Zhang-RSS-16, \r\n    AUTHOR    = {Hao Zhang AND Fei Han AND Hua Wang}, \r\n    TITLE     = {Robust Multimodal Sequence-Based Loop Closure Detection via Structured Sparsity}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.043} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p43.pdf",
        "supp": "",
        "pdf_size": 5063841,
        "gs_citation": 54,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=18266286509779250140&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 5,
        "aff": "Department of Electrical Engineering and Computer Sceience, Colorado School of Mines, Golden, Colorado 80401; Department of Electrical Engineering and Computer Sceience, Colorado School of Mines, Golden, Colorado 80401; Department of Electrical Engineering and Computer Sceience, Colorado School of Mines, Golden, Colorado 80401",
        "aff_domain": "mines.edu;mines.edu;gmail.com",
        "email": "mines.edu;mines.edu;gmail.com",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Department of Electrical Engineering and Computer Sceience, Colorado School of Mines, Golden, Colorado 80401",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "a70cca2c58",
        "title": "Robust Phase-Space Planning for Agile Legged Locomotion over Various Terrain Topologies",
        "site": "https://www.roboticsproceedings.org/rss12/p10.html",
        "author": "Ye Zhao; Benito Fernandez; Luis Sentis",
        "abstract": "In this study, we present a framework for phase- space planning and control of agile bipedal locomotion while robustly tracking a set of non-periodic keyframes. By using a reduced-order model, we formulate a hybrid planning framework where the center-of-mass motion is constrained to a general sur- face manifold. This framework also proposes phase-space bundles to characterize robustness and a robust hybrid automaton to effectively design planning algorithms. A newly defined phase- space locomotion manifold is used as a Riemannian metric to measure the distance between the disturbed state and the planned manifold. Based on this metric, a dynamic programming based hybrid controller is introduced to produce robust locomotions. The robustness of the proposed framework is validated by using simulations of rough terrain locomotion recovery from external disturbances. Additionally, the agility of this framework is demonstrated by using simulations of the dynamic locomotion over random rough terrains.",
        "bibtex": "@INPROCEEDINGS{Zhao-RSS-16, \r\n    AUTHOR    = {Ye Zhao AND Benito Fernandez AND Luis Sentis}, \r\n    TITLE     = {Robust Phase-Space Planning for Agile Legged Locomotion over Various Terrain Topologies}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.010} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p10.pdf",
        "supp": "",
        "pdf_size": 6308424,
        "gs_citation": 14,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13851665319258866091&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 7,
        "aff": "Human Centered Robotics Laboratory, The University of Texas at Austin, USA; Neuro-Engineering Research and Development Laboratory, The University of Texas at Austin, USA; Human Centered Robotics Laboratory, The University of Texas at Austin, USA",
        "aff_domain": "utexas.edu;austin.utexas.edu;austin.utexas.edu",
        "email": "utexas.edu;austin.utexas.edu;austin.utexas.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "Human Centered Robotics Laboratory, The University of Texas at Austin, USA;Neuro-Engineering Research and Development Laboratory, The University of Texas at Austin, USA",
        "aff_unique_dep": ";",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "a0bf446574",
        "title": "Routing Autonomous Vehicles in Congested Transportation Networks: Structural Properties and Coordination Algorithms",
        "site": "https://www.roboticsproceedings.org/rss12/p32.html",
        "author": "Rick Zhang; Federico Rossi; Marco Pavone",
        "abstract": "This paper considers the problem of routing and rebalancing a shared fleet of autonomous (i.e., self-driving) vehicles providing on-demand mobility within a capacitated trans- portation network, where congestion might disrupt throughput. We model the problem within a network flow framework and show that under relatively mild assumptions the rebalancing vehicles, if properly coordinated, do not lead to an increase in congestion (in stark contrast to common belief). From an algorithmic standpoint, such theoretical insight suggests that the problem of routing customers and rebalancing vehicles can be decoupled, which leads to a computationally-efficient routing and rebalancing algorithm for the autonomous vehicles. Numerical experiments and case studies corroborate our theoretical insights and show that the proposed algorithm outperforms state-of-the- art point-to-point methods by avoiding excess congestion on the road. Collectively, this paper provides a rigorous approach to the problem of congestion-aware, system-wide coordination of autonomously driving vehicles, and to the characterization of the sustainability of such robotic systems.",
        "bibtex": "@INPROCEEDINGS{Zhang-RSS-16, \r\n    AUTHOR    = {Rick Zhang AND Federico Rossi AND Marco Pavone}, \r\n    TITLE     = {Routing Autonomous Vehicles in Congested Transportation Networks: Structural Properties and Coordination Algorithms}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.032} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p32.pdf",
        "supp": "",
        "pdf_size": 575461,
        "gs_citation": 214,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4736227478965940932&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 15,
        "aff": "Department of Aeronautics & Astronautics, Stanford University; Department of Aeronautics & Astronautics, Stanford University; Department of Aeronautics & Astronautics, Stanford University",
        "aff_domain": "stanford.edu;stanford.edu;stanford.edu",
        "email": "stanford.edu;stanford.edu;stanford.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Stanford University",
        "aff_unique_dep": "Department of Aeronautics & Astronautics",
        "aff_unique_url": "https://www.stanford.edu",
        "aff_unique_abbr": "Stanford",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Stanford",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "3cfbeac954",
        "title": "Safe Control under Uncertainty with Probabilistic Signal Temporal Logic",
        "site": "https://www.roboticsproceedings.org/rss12/p17.html",
        "author": "Dorsa Sadigh; Ashish Kapoor",
        "abstract": "Safe control of dynamical systems that satisfy tem- poral invariants expressing various safety properties is a challeng- ing problem that has drawn the attention of many researchers. However, making the assumption that such temporal properties are deterministic is far from the reality. For example, a robotic system might employ a camera sensor and a machine learned system to identify obstacles. Consequently, the safety properties the controller has to satisfy, will be a function of the sensor data and the associated classifier. We propose a framework for achieving safe control. At the heart of our approach is the new Probabilistic Signal Temporal Logic (PrSTL), an expressive language to define stochastic properties, and enforce probabilistic guarantees on them. We also present an efficient algorithm to reason about safe controllers given the constraints derived from the PrSTL specification. One of the key distinguishing features of PrSTL is that the encoded logic is adaptive and changes as the system encounters additional data and updates its beliefs about the latent random variables that define the safety properties. We demonstrate our approach by deriving safe control of quadrotors and autonomous vehicles in dynamic environments.",
        "bibtex": "@INPROCEEDINGS{Sadigh-RSS-16, \r\n    AUTHOR    = {Dorsa Sadigh AND Ashish Kapoor}, \r\n    TITLE     = {Safe Control under Uncertainty with Probabilistic Signal Temporal Logic}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.017} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p17.pdf",
        "supp": "",
        "pdf_size": 578105,
        "gs_citation": 182,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=2385974309064947082&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "University of California, Berkeley + Microsoft Research, Redmond; Microsoft Research, Redmond",
        "aff_domain": "eecs.berkeley.edu;microsoft.com",
        "email": "eecs.berkeley.edu;microsoft.com",
        "github": "",
        "project": "",
        "author_num": 2,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0+1;1",
        "aff_unique_norm": "University of California, Berkeley;Microsoft Research",
        "aff_unique_dep": ";",
        "aff_unique_url": "https://www.berkeley.edu;https://www.microsoft.com/en-us/research",
        "aff_unique_abbr": "UC Berkeley;MSR",
        "aff_campus_unique_index": "0+1;1",
        "aff_campus_unique": "Berkeley;Redmond",
        "aff_country_unique_index": "0+0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "abf9f89b81",
        "title": "Seeing Glassware: from Edge Detection to Pose Estimation and Shape Recovery",
        "site": "https://www.roboticsproceedings.org/rss12/p21.html",
        "author": "Cody J. Phillips; Matthieu Lecce; Kostas Daniilidis",
        "abstract": "Perception of transparent objects has been an open challenge in robotics despite advances in sensors and data- driven learning approaches. In this paper, we introduce a new approach that combines recent advances in learnt object detectors with perceptual grouping in 2D, and projective geometry of apparent contours in 3D. We train a state of the art structured edge detector on an annotated set of foreground glassware. We assume that we deal with surfaces of revolution (SOR) and apply perceptual symmetry grouping in a 2D spherical transformation of the image to obtain a 2D detection of the glassware object and a hypothesis about its 2D axis. Rather than stopping at a single view detection, we ultimately want to reconstruct the 3D shape of the object and its 3D pose to allow for a robot to grasp it. Using two views allows us to decouple the 3D axis localization from the shape estimation. We develop a parametrization that uniquely relates the shape reconstruction of SOR to given a set of contour points and tangents. Finally, we provide the first annotated dataset for 2D detection, 3D pose and 3D shape of glassware and we show results comparable to category-based detection and localization of opaque objects without any training on the object shape.",
        "bibtex": "@INPROCEEDINGS{Phillips-RSS-16, \r\n    AUTHOR    = {Cody J. Phillips AND Matthieu Lecce AND Kostas Daniilidis}, \r\n    TITLE     = {Seeing Glassware: from Edge Detection to Pose Estimation and Shape Recovery}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.021} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p21.pdf",
        "supp": "",
        "pdf_size": 9237204,
        "gs_citation": 67,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13943461263590021526&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 0,
        "aff": "GRASP Laboratory, University of Pennsylvania; GRASP Laboratory, University of Pennsylvania; GRASP Laboratory, University of Pennsylvania",
        "aff_domain": "cis.upenn.edu;cis.upenn.edu;cis.upenn.edu",
        "email": "cis.upenn.edu;cis.upenn.edu;cis.upenn.edu",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "University of Pennsylvania",
        "aff_unique_dep": "GRASP Laboratory",
        "aff_unique_url": "https://www.upenn.edu",
        "aff_unique_abbr": "UPenn",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Philadelphia",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States"
    },
    {
        "id": "a340c73291",
        "title": "Set-labelled filters and sensor transformations",
        "site": "https://www.roboticsproceedings.org/rss12/p15.html",
        "author": "Fatemeh Zahra Saberifar; Shervin Ghasemlou; Jason M. O'Kane; Dylan A. Shell",
        "abstract": "For a given robot and a given task, this paper addresses questions about which modifications may be made to the robotâ\u0080\u0099s suite of sensors without impacting the robotâ\u0080\u0099s behavior in completing its task. Though this is an important design-time question, few principled methods exist for providing a definitive answer in general. Utilizing and extending the language of combinatorial filters, this paper aims to fill that lacuna by introducing theoretical tools for reasoning about sensors and representations of sensors. It introduces new representations for sensors and filters, exploring the relationship between those elements and the specific information needed to perform a task. It then shows how these tools can be used to algorithmically answer questions about changes to a robotâ\u0080\u0099s sensor suite. The paper substantially expands the expressiveness of combinatorial filters so that, where they were previously limited to quite simple sensors, our richer filters are able to reasonably model a much broader variety of real devices. We have implemented the proposed algorithms, and describe their application to an example instance involving a series of simplifications to the sensors of a specific, widely deployed mobile robot.",
        "bibtex": "@INPROCEEDINGS{Saberifar-RSS-16, \r\n    AUTHOR    = {Fatemeh Zahra Saberifar AND Shervin Ghasemlou AND Jason M. O'Kane AND Dylan A. Shell}, \r\n    TITLE     = {Set-labelled filters and sensor transformations}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.015} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p15.pdf",
        "supp": "",
        "pdf_size": 1404242,
        "gs_citation": 21,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17448469405686093410&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": "Dept. of Math. and Comp. Sci., Amirkabir University of Technology, Tehran, Iran; Dept. of Comp. Sci. & Eng., University of South Carolina, Columbia, South Carolina, USA; Dept. of Comp. Sci. & Eng., University of South Carolina, Columbia, South Carolina, USA; Dept. of Comp. Sci. & Eng., Texas A&M University, College Station, Texas, USA",
        "aff_domain": "aut.ac.ir;cse.sc.edu;cse.sc.edu;cs.tamu.edu",
        "email": "aut.ac.ir;cse.sc.edu;cse.sc.edu;cs.tamu.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;1;2",
        "aff_unique_norm": "Dept. of Math. and Comp. Sci., Amirkabir University of Technology, Tehran, Iran;Dept. of Comp. Sci. & Eng., University of South Carolina, Columbia, South Carolina, USA;Dept. of Comp. Sci. & Eng., Texas A&M University, College Station, Texas, USA",
        "aff_unique_dep": ";;",
        "aff_unique_url": ";;",
        "aff_unique_abbr": ";;",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "741f165ed1",
        "title": "Shape-Based Compliance in Locomotion",
        "site": "https://www.roboticsproceedings.org/rss12/p20.html",
        "author": "Matt Travers; Julian Whitman; Perrin Schiebel; Dan Goldman; Howie Choset",
        "abstract": "Having many degrees of freedom is both a blessing and a curse. A mechanism with a large number of degrees of freedom can better comply to and therefore better move in complex environments. Yet, possessing many degrees of freedom is only an advantage if the system is capable of coordinating them to achieve desired goals in realtime. This work supports the belief that a middle layer of abstraction between conventional planning and control is needed to enable robust locomotion of articulated systems in complex terrains. The basis for this abstraction is the notion that a systemâ\u0080\u0099s shape can be used to capture joint- to-joint coupling and provide an intuitive set of controllable parameters that adapt the system to the environment in real time. This paper presents a generalizable framework that specifies desired shapes in terms of shape functions. We show how shape functions can be used to link low-level controllers to high-level planners in a compliant control framework that directly controls shape parameters. The resultant shape-based controllers produce behaviors that enable robots to robustly feel their way through unknown environments. This framework is applied to the control of two separate mechanisms, a snake-like and a hexapod robot.",
        "bibtex": "@INPROCEEDINGS{Travers-RSS-16, \r\n    AUTHOR    = {Matt Travers AND Julian Whitman AND Perrin Schiebel AND Dan Goldman AND Howie Choset}, \r\n    TITLE     = {Shape-Based Compliance in Locomotion}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.020} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p20.pdf",
        "supp": "",
        "pdf_size": 3236687,
        "gs_citation": 43,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=16259174359930020366&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Robotics Institute at Carnegie Mellon University, Pittsburgh, PA, USA; Robotics Institute at Carnegie Mellon University, Pittsburgh, PA, USA; School of Physics at Georgia Institute of Technology, Atlanta, GA, USA; School of Physics at Georgia Institute of Technology, Atlanta, GA, USA; Robotics Institute at Carnegie Mellon University, Pittsburgh, PA, USA",
        "aff_domain": ";;;;",
        "email": ";;;;",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;1;1;0",
        "aff_unique_norm": "Carnegie Mellon University;School of Physics at Georgia Institute of Technology, Atlanta, GA, USA",
        "aff_unique_dep": "Robotics Institute;",
        "aff_unique_url": "https://www.cmu.edu;",
        "aff_unique_abbr": "CMU;",
        "aff_campus_unique_index": "0;0;0",
        "aff_campus_unique": "Pittsburgh;",
        "aff_country_unique_index": "0;0;0",
        "aff_country_unique": "United States;"
    },
    {
        "id": "69367b496a",
        "title": "Simplifying Gait Design via Shape Basis Optimization",
        "site": "https://www.roboticsproceedings.org/rss12/p06.html",
        "author": "Chaohui Gong; Daniel I. Goldman; Howie Choset",
        "abstract": "Gaits are crucial to the performance of locomotors. However, it is often difficult to design effective gaits for complex locomotors. Geometric mechanics offers powerful gait design tools, but the utilities of these tools have been limited to systems with two joints. Using shape basis functions, it is possible to approximate the kinematics of complex locomotors using only two shape variables. As a result, the tools of geometric mechanics can be used to study complex locomotion in an intuitive way. The choice of shape basis functions plays an important role in determining gait kinematics, and therefore the performance of a locomotor. To find appropriate basis functions, we introduce the shape basis optimization algorithm, an algorithm that iteratively improve basis functions to find effective kinematic programs. Applying this algorithm to a snake robot resulted a novel gait, which improves its speed of swimming in granular materials.",
        "bibtex": "@INPROCEEDINGS{Gong-RSS-16, \r\n    AUTHOR    = {Chaohui Gong AND Daniel I. Goldman AND Howie Choset}, \r\n    TITLE     = {Simplifying Gait Design via Shape Basis Optimization}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.006} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p06.pdf",
        "supp": "",
        "pdf_size": 3067042,
        "gs_citation": 31,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=3284104766972425729&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 8,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "4cd4bc0a00",
        "title": "Situated Language Understanding with Human-like and Visualization-Based Transparency",
        "site": "https://www.roboticsproceedings.org/rss12/p40.html",
        "author": "Leah Perlmutter; Eric Kernfeld; Maya Cakmak",
        "abstract": "Communication with robots is challenging, partly due to their differences from humans and the consequent discrepancy in peopleâ\u0080\u0099s mental model of what robots can see, hear, or understand. Transparency mechanisms aim to mitigate this challenge by providing users with information about the robotâ\u0080\u0099s internal processes. While most research in human-robot interaction aim towards natural transparency using human-like verbal and non-verbal behaviors, our work advocates for the use of visualization-based transparency. In this paper, we first present an end-to-end system that infers task commands that refer to objects or surfaces in everyday human environments, using Bayesian inference to combine scene understanding, pointing detection, and speech recognition. We characterize capabilities of this system through systematic tests with a corpus collected from people (N=5). Then we design human-like and visualization- based transparency mechanisms and evaluate them in a user study (N=20). The study demonstrates the effects of visualizations on the accuracy of peopleâ\u0080\u0099s mental models, as well as their effectiveness and efficiency in communicating task commands.",
        "bibtex": "@INPROCEEDINGS{Perlmutter-RSS-16, \r\n    AUTHOR    = {Leah Perlmutter AND Eric Kernfeld AND Maya Cakmak}, \r\n    TITLE     = {Situated Language Understanding with Human-like and Visualization-Based Transparency}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.040} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p40.pdf",
        "supp": "",
        "pdf_size": 2870678,
        "gs_citation": 36,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17503991210931345818&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Computer Science & Engineering Department; Department of Statistics; Computer Science & Engineering Department",
        "aff_domain": "; ; ",
        "email": "; ; ",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "Computer Science & Engineering Department;University Affiliation Not Specified",
        "aff_unique_dep": "Computer Science & Engineering;Department of Statistics",
        "aff_unique_url": ";",
        "aff_unique_abbr": ";",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    },
    {
        "id": "348c37c897",
        "title": "Street-View Change Detection with Deconvolutional Networks",
        "site": "https://www.roboticsproceedings.org/rss12/p44.html",
        "author": "Pablo F. Alcantarilla; Simon Stent; German Ros; Roberto Arroyo; Riccardo Gherardi",
        "abstract": "We propose a system for performing structural change detection in street-view videos captured by a vehicle- mounted monocular camera over time. Our approach is moti- vated by the need for more frequent and efficient updates in the large-scale maps used in autonomous vehicle navigation. Our method chains a multi-sensor fusion SLAM and fast dense 3D reconstruction pipeline, which provide coarsely registered image pairs to a deep deconvolutional network for pixel-wise change detection. To train and evaluate our network we introduce a new urban change detection dataset which is an order of magnitude larger than existing datasets and contains challenging changes due to seasonal and lighting variations. Our method outperforms existing literature on this dataset, which we make available to the community, and an existing panoramic change detection dataset, demonstrating its wide applicability.",
        "bibtex": "@INPROCEEDINGS{Stent-RSS-16, \r\n    AUTHOR    = {Pablo F. Alcantarilla AND Simon Stent AND German Ros AND Roberto Arroyo AND Riccardo Gherardi}, \r\n    TITLE     = {Street-View Change Detection with Deconvolutional Networks}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.044} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p44.pdf",
        "supp": "",
        "pdf_size": 21882038,
        "gs_citation": 401,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4993679902350781690&as_sdt=400005&sciodt=0,14&hl=en",
        "gs_version_total": 10,
        "aff": "iRobot Corporation, London, UK; Department of Engineering, University of Cambridge, Cambridge, UK; Computer Vision Center, UAB, Barcelona, Spain; Department of Electronics, University of Alcal ´a, Madrid, Spain; Toshiba Research Europe Ltd., Cambridge, UK",
        "aff_domain": "irobot.com;cantab.net;cvc.uab.es;depeca.uah.es;crl.toshiba.co.uk",
        "email": "irobot.com;cantab.net;cvc.uab.es;depeca.uah.es;crl.toshiba.co.uk",
        "github": "",
        "project": "",
        "author_num": 5,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;2;3;4",
        "aff_unique_norm": "iRobot Corporation;University of Cambridge;Computer Vision Center, UAB, Barcelona, Spain;Department of Electronics, University of Alcal ´a, Madrid, Spain;Toshiba Research Europe Ltd., Cambridge, UK",
        "aff_unique_dep": ";Department of Engineering;;;",
        "aff_unique_url": "https://www.irobot.com;https://www.cam.ac.uk;;;",
        "aff_unique_abbr": "iRobot;Cambridge;;;",
        "aff_campus_unique_index": "1",
        "aff_campus_unique": ";Cambridge",
        "aff_country_unique_index": "0;0",
        "aff_country_unique": "United Kingdom;"
    },
    {
        "id": "7956297264",
        "title": "Synergistic Design of a Bio-Inspired Micro Aerial Vehicle with Articulated Wings",
        "site": "https://www.roboticsproceedings.org/rss12/p09.html",
        "author": "Jonathan Hoff; Alireza Ramezani; Soon-Jo Chung; Seth Hutchinson",
        "abstract": "The sophisticated and intricate connection between bat morphology and flight capabilities makes it challenging to employ conventional flying robots to replicate the aerial locomotion of these creatures. In recent work, a bat inspired soft Micro Aerial Vehicle (MAV) called Bat Bot (B2) with five Degrees of Actuation (DoA) has been constructed to mimic the flight behavior of a biological bat. Major differences in structural topology resulted from this simpler kinematic complexity, and thus it is necessary to find the dimensions of B2â\u0080\u0099s structure and the behavior of its actuators such that the wingbeat cycle of B2 closely mimics that of a biological bat. The current work assumes the previously designed structure of B2 and presents a synergistic design approach to imitate the kinematic synergies of a biological bat. Recent findings have unveiled that the most dominant synergies in a biological bat could be combined to accurately represent the original kinematic movement, therefore simplifying its dimensional complexity. In this work, Principal Component Analysis (PCA) has been employed in order to extract dominant principal components of biological bat flight kinematics. Thereafter, first and second principal components are chosen to shape the parametric kinematics and actuator trajectories of B2 through finite state nonlinear constrained optimization. The method yields a robot mechanism that despite having a few DoAs, it possesses several biologically meaningful morphing specializations.",
        "bibtex": "@INPROCEEDINGS{Hoff-RSS-16, \r\n    AUTHOR    = {Jonathan Hoff AND Alireza Ramezani AND Soon-Jo Chung AND Seth Hutchinson}, \r\n    TITLE     = {Synergistic Design of a Bio-Inspired Micro Aerial Vehicle with Articulated Wings}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.009} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p09.pdf",
        "supp": "",
        "pdf_size": 5696645,
        "gs_citation": 40,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=11487647701442640481&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 6,
        "aff": "Coordinated Science Laboratory; Department of Mechanical Science and Engineering+Coordinated Science Laboratory; Department of Aerospace Engineering+Coordinated Science Laboratory; Department of Electrical and Computer Engineering+Coordinated Science Laboratory",
        "aff_domain": "illinois.edu;illinois.edu;illinois.edu;illinois.edu",
        "email": "illinois.edu;illinois.edu;illinois.edu;illinois.edu",
        "github": "",
        "project": "",
        "author_num": 4,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1+0;2+0;3+0",
        "aff_unique_norm": "Coordinated Science Laboratory;Department of Mechanical Science and Engineering;University Affiliation Not Specified;Unknown Institution",
        "aff_unique_dep": ";;Department of Aerospace Engineering;Department of Electrical and Computer Engineering",
        "aff_unique_url": ";;;",
        "aff_unique_abbr": ";;;",
        "aff_campus_unique_index": ";;",
        "aff_campus_unique": "",
        "aff_country_unique_index": ";;",
        "aff_country_unique": ""
    },
    {
        "id": "b7cba5953e",
        "title": "Task Variant Allocation in Distributed Robotics",
        "site": "https://www.roboticsproceedings.org/rss12/p45.html",
        "author": "JosÃ© Cano; David R. White; Alejandro Bordallo; Ciaran McCreesh; Patrick Prosser; Jeremy Singer; Vijay Nagarajan",
        "abstract": "We consider the problem of assigning software pro- cesses (or tasks) to hardware processors in distributed robotics environments. We introduce the notion of a task variant, which supports the adaptation of software to specific hardware con- figurations. Task variants facilitate the trade-off of functional quality versus the requisite capacity and type of target execution processors. We formalise the problem of assigning task variants to processors as a mathematical model that incorporates typical con- straints found in robotics applications; the model is a constrained form of a multi-objective, multi-dimensional, multiple-choice knapsack problem. We propose and evaluate three different solution methods to the problem: constraint programming, a constructive greedy heuristic and a local search metaheuristic. Furthermore, we demonstrate the use of task variants in a real in- stance of a distributed interactive multi-agent navigation system, showing that our best solution method (constraint programming) improves the systemÃ¢Â€Â™s quality of service, as compared to the local search metaheuristic, the greedy heuristic and a randomised solution, by an average of 16%, 41% and 56% respectively.",
        "bibtex": "@INPROCEEDINGS{Cano-RSS-16, \r\n    AUTHOR    = {JosÃ© Cano AND David R. White AND Alejandro Bordallo AND Ciaran McCreesh AND Patrick Prosser AND Jeremy Singer AND Vijay Nagarajan}, \r\n    TITLE     = {Task Variant Allocation in Distributed Robotics}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.045} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p45.pdf",
        "supp": "",
        "pdf_size": 452196,
        "gs_citation": 6,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=4749248926994636900&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 17,
        "aff": ";;;;;;",
        "aff_domain": ";;;;;;",
        "email": ";;;;;;",
        "github": "",
        "project": "",
        "author_num": 7,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "d7e2e778bf",
        "title": "Time and Energy Optimal Path Planning in General Flows",
        "site": "https://www.roboticsproceedings.org/rss12/p47.html",
        "author": "Dhanushka Kularatne; Subhrajit Bhattacharya; M. Ani Hsieh",
        "abstract": "Autonomous surface and underwater vehicles (ASVs and AUVs) are increasingly being used for persistent monitoring of ocean phenomena. Typically, these vehicles are deployed for long periods of time and must operate with limited energy budgets. As a result, there is increased interest in recent years on developing energy efficient motion plans for these vehicles that leverage the dynamics of the surrounding flow field. In this paper, we present a graph search based method to plan time and energy optimal paths in a flow field where the kinematic actuation constraints on the vehicles are captured in our cost functions. We also use tools from topological path planning to generate optimal paths in different homotopy classes, which facilitates simultaneous exploration of the environment. The proposed strategy is validated using analytical flow models for large scale ocean circulation and in experiments using an indoor laboratory testbed capable of creating flows with ocean-like features. We also present a Riemannian metric based approximation for these cost functions which provides an alternative method for computing time and energy optimal paths. The Riemannian approximation results in smoother trajectories in contrast to the graph based approach while requiring less computational time.",
        "bibtex": "@INPROCEEDINGS{Kularatne-RSS-16, \r\n    AUTHOR    = {Dhanushka Kularatne AND Subhrajit Bhattacharya AND M. Ani Hsieh}, \r\n    TITLE     = {Time and Energy Optimal Path Planning in General Flows}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.047} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p47.pdf",
        "supp": "",
        "pdf_size": 4239038,
        "gs_citation": 70,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=17124614481737068672&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 7,
        "aff": ";;",
        "aff_domain": ";;",
        "email": ";;",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster"
    },
    {
        "id": "ce5da18a04",
        "title": "Understanding Hand-Object Manipulation with Grasp Types and Object Attributes",
        "site": "https://www.roboticsproceedings.org/rss12/p34.html",
        "author": "Minjie Cai; Kris M. Kitani; Yoichi Sato",
        "abstract": "Our goal is to automate the understanding of natural hand-object manipulation by developing computer vision- based techniques. Our hypothesis is that it is necessary to model the grasp types of hands and the attributes of manipulated objects in order to accurately recognize manipulation actions. Specifically, we focus on recognizing hand grasp types, object attributes and actions from a single image within an unified model. First, we explore the contextual relationship between grasp types and object attributes, and show how that context can be used to boost the recognition of both grasp types and object attributes. Second, we propose to model actions with grasp types and object attributes based on the hypothesis that grasp types and object attributes contain complementary information for characterizing different actions. Our proposed action model outperforms traditional appearance-based models which are not designed to take into account semantic constraints such as grasp types or object attributes. Experiment results on public egocentric activities datasets strongly support our hypothesis.",
        "bibtex": "@INPROCEEDINGS{Cai-RSS-16, \r\n    AUTHOR    = {Minjie Cai AND Kris M. Kitani AND Yoichi Sato}, \r\n    TITLE     = {Understanding Hand-Object Manipulation with Grasp Types and Object Attributes}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.034} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p34.pdf",
        "supp": "",
        "pdf_size": 1170635,
        "gs_citation": 124,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=65657725523942666&as_sdt=2005&sciodt=0,5&hl=en",
        "gs_version_total": 9,
        "aff": "Institute of Industrial Science, The University of Tokyo, Japan; Robotics Institute, Carnegie Mellon University, USA; Institute of Industrial Science, The University of Tokyo, Japan",
        "aff_domain": "iis.u-tokyo.ac.jp;cs.cmu.edu;iis.u-tokyo.ac.jp",
        "email": "iis.u-tokyo.ac.jp;cs.cmu.edu;iis.u-tokyo.ac.jp",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;1;0",
        "aff_unique_norm": "The University of Tokyo;Carnegie Mellon University",
        "aff_unique_dep": "Institute of Industrial Science;Robotics Institute",
        "aff_unique_url": "https://www.iis.u-tokyo.ac.jp;https://www.cmu.edu",
        "aff_unique_abbr": "UTokyo;CMU",
        "aff_campus_unique_index": "0;0",
        "aff_campus_unique": "Tokyo;",
        "aff_country_unique_index": "0;1;0",
        "aff_country_unique": "Japan;United States"
    },
    {
        "id": "4f5b84f7e3",
        "title": "Vehicle Detection from 3D Lidar Using Fully Convolutional Network",
        "site": "https://www.roboticsproceedings.org/rss12/p42.html",
        "author": "Bo Li; Tianlei Zhang; Tian Xia",
        "abstract": "Convolutional network techniques have recently achieved great success in vision based detection tasks. This paper introduces the recent development of our research on transplanting the fully convolutional network technique to the detection tasks on 3D range scan data. Specifically, the scenario is set as the vehicle detection task from the range data of Velodyne 64E lidar. We proposes to present the data in a 2D point map and use a single 2D end-to-end fully convolutional network to predict the objectness confidence and the bounding boxes simultaneously. By carefully design the bounding box encoding, it is able to predict full 3D bounding boxes even using a 2D convolutional network. Experiments on the KITTI dataset shows the state-of- the-art performance of the proposed method.",
        "bibtex": "@INPROCEEDINGS{Li-RSS-16, \r\n    AUTHOR    = {Bo Li AND Tianlei Zhang AND Tian Xia}, \r\n    TITLE     = {Vehicle Detection from 3D Lidar Using Fully Convolutional Network}, \r\n    BOOKTITLE = {Proceedings of Robotics: Science and Systems}, \r\n    YEAR      = {2016}, \r\n    ADDRESS   = {AnnArbor, Michigan}, \r\n    MONTH     = {June}, \r\n    DOI       = {10.15607/RSS.2016.XII.042} \r\n}",
        "pdf": "https://www.roboticsproceedings.org/rss12/p42.pdf",
        "supp": "",
        "pdf_size": 1348158,
        "gs_citation": 835,
        "gs_cited_by_link": "https://scholar.google.com/scholar?cites=13182238164870100873&as_sdt=5,33&sciodt=0,33&hl=en",
        "gs_version_total": 11,
        "aff": "Baidu Research – Institute for Deep Learning; Baidu Research – Institute for Deep Learning; Baidu Research – Institute for Deep Learning",
        "aff_domain": "baidu.com;baidu.com;baidu.com",
        "email": "baidu.com;baidu.com;baidu.com",
        "github": "",
        "project": "",
        "author_num": 3,
        "track": "main",
        "status": "Poster",
        "aff_unique_index": "0;0;0",
        "aff_unique_norm": "Baidu Research – Institute for Deep Learning",
        "aff_unique_dep": "",
        "aff_unique_url": "",
        "aff_unique_abbr": "",
        "aff_campus_unique_index": "",
        "aff_campus_unique": "",
        "aff_country_unique_index": "",
        "aff_country_unique": ""
    }
]